{
  "id": "optical-coherence-tomography",
  "name": "Optical Coherence Tomography",
  "acronym": "OCT",
  "category": "Imaging Techniques",
  "subcategory": "Depth-Resolved Optical Imaging / Interferometry",
  "summary": "Optical Coherence Tomography (OCT) is a non-invasive, non-contact optical imaging technique that captures high-resolution, depth-resolved cross-sectional images of semi-transparent and scattering materials using low-coherence interferometry. Originally developed for biomedical applications (retinal imaging in ophthalmology, 1990s), OCT has been increasingly adapted for cultural heritage since the 2000s, leveraging near-infrared light (typically 800-1550 nm wavelengths) to penetrate beneath surfaces and generate 2D and 3D structural maps with axial (depth) resolution of 1-15 μm and lateral resolution of 5-25 μm, imaging depths of 0.5-3 mm depending on material optical properties. The technique works by splitting a low-coherence light source (superluminescent diode, femtosecond laser, or swept-source laser) into reference and sample arms; light reflected from different depths within the sample interferes with the reference beam only when the optical path lengths match within the coherence length (~1-10 μm), creating depth-encoded interference fringes that are detected and processed to reconstruct cross-sectional images (B-scans) analogous to ultrasound but using light instead of sound. Heritage applications include: varnish and coating layer visualization (thickness measurement 5-200 μm, distribution, degradation), paint layer stratigraphy (number of layers, thickness, interfaces without sampling), underdrawing and pentimenti detection (carbon black, graphite beneath paint layers if within penetration depth), glazing and transparent layer characterization (glazes, media, consolidated areas), damage assessment (cracks, delamination, voids internal structure), and monitoring conservation treatments (varnish removal progress, consolidation penetration depth). OCT provides unique micro-stratigraphic information non-destructively that previously required destructive cross-sectioning, though penetration is limited to optically accessible depths (typically <3 mm, often <1 mm in dense, highly scattering materials like thick oil paint) and provides structural not chemical information (complemented by spectroscopic techniques for material identification).",
  "keyApplications": [
    "Varnish layer imaging (thickness 10-200 μm, surface vs. buried layers, degradation, removal monitoring)",
    "Paint layer stratigraphy (count layers, measure thickness 20-500 μm, identify interfaces without cross-sectioning)",
    "Underdrawing detection (carbon-based drawing materials beneath paint if <1 mm depth, shallow vs. IRR deeper)",
    "Glaze and transparent layer characterization (thin glazes 5-50 μm, media, consolidants, distribution)",
    "Subsurface damage visualization (cracks, delamination, voids 50-500 μm beneath surface, invisible surface inspection)",
    "Treatment monitoring (real-time varnish removal, consolidation penetration, cleaning depth control non-invasive)"
  ],
  "destructiveness": "non-destructive (near-infrared light, low power ~mW; no contact, no alteration; safe for all heritage materials including light-sensitive)",
  "portability": "portable to transportable (commercial systems: 10-50 kg portable cart-based; research systems: benchtop 50-200 kg; field-deployable systems emerging 5-15 kg handheld, though less common)",
  "typicalTimePerMeasurement": "Seconds to minutes (single B-scan 2D cross-section: 0.5-5 s; 3D volume: 30 s - 5 min depending on area, resolution; real-time imaging possible modern systems 10-100 fps for monitoring)",
  "costRange": {
    "instrument": "$50,000-$300,000 (commercial heritage OCT: $80-150K typical; biomedical OCT adapted: $50-200K; custom research systems: $100-300K with specialized capabilities)",
    "perSample": "$100-$500 per imaging session (operator time 1-3 hours setup, acquisition, processing; no consumables; if external service: $500-2000 per object depending on area, resolution, complexity)"
  },
  "relatedTechniques": [
    "irr-infrared-reflectography",
    "ultrasound-imaging",
    "confocal-microscopy",
    "macro-xrf-mapping",
    "raman-spectroscopy",
    "thz-imaging"
  ],
  "fundamentalPhysics": {
    "principle": "Low-coherence interferometry: broadband light source (Δλ = 20-100 nm, coherence length l_c = λ²/Δλ ≈ 2-10 μm) split into reference arm (mirror at fixed or scanning position) and sample arm (light penetrates sample, backscattered from internal structures at different depths). Reflected light from both arms recombines at detector; interference occurs only when optical path length difference ΔL < l_c (within coherence length), creating depth-gated detection. By scanning reference mirror (time-domain OCT) or analyzing spectral interference (spectral-domain OCT, swept-source OCT), depth information (z-axis) is encoded in interference pattern. Lateral scanning (x-y galvanometer mirrors or sample stage) builds 2D cross-sections (B-scans: x-z slices) and 3D volumes (x-y-z). Axial resolution Δz ≈ 0.44 λ²/(nΔλ) (determined by source coherence length; 800 nm, Δλ = 50 nm, n = 1.5 → Δz ≈ 4 μm in tissue-like media). Lateral resolution Δx ≈ 4λf/(πD) (diffraction-limited, determined by focusing optics; f = focal length, D = beam diameter; typically 5-25 μm). Penetration depth limited by scattering: multiple scattering randomizes photon paths, reduces coherent signal (ballistic + snake photons detected, diffuse photons rejected); typical penetration 0.5-3 mm depending on material (transparent varnish: 1-3 mm; dense oil paint: 0.2-1 mm; metals, opaque materials: surface only <10 μm).",
    "physicalPhenomenon": "Michelson interferometer configuration: low-coherence source (broadband, short coherence length distinguishes it from laser interferometry which has long coherence, cannot depth-resolve). Light backscattered from sample depth z_s interferes with reference mirror at z_r only if |z_s - z_r| < l_c/2 (coherence gate, rejects out-of-range light, provides depth resolution). Interference intensity I ∝ I_r + I_s + 2√(I_r I_s) cos(2πΔz/λ + φ) (where Δz = |z_s - z_r|, φ = phase). Axial scan (A-scan): record intensity vs. depth (1D profile, millisecond acquisition modern systems). Lateral scan: repeated A-scans at x positions → B-scan (2D cross-section, seconds acquisition). Raster scan: B-scans at y positions → 3D volume (minutes acquisition). **Spectral-domain OCT (SD-OCT, Fourier-domain):** Modern standard; reference mirror fixed, interference spectrum recorded via spectrometer (wavelength λ vs. intensity), Fourier transform converts spectrum → depth profile (all depths simultaneously, 100-1000× faster than time-domain scanning mirror, superior sensitivity). **Swept-source OCT (SS-OCT):** Wavelength-tunable laser sweeps through spectral range, single photodetector records intensity vs. λ, Fourier transform → depth profile; advantages: higher speed (100-400 kHz A-scan rate vs. 20-100 kHz SD-OCT), longer wavelength options (1300-1550 nm, deeper penetration), but more expensive laser source.",
    "equations": [
      {
        "latex": "$$\\Delta z = \\frac{2 \\ln(2)}{\\pi} \\frac{\\lambda_0^2}{n \\Delta\\lambda} \\approx 0.44 \\frac{\\lambda_0^2}{n \\Delta\\lambda}$$",
        "description": "Axial Resolution (depth resolution, coherence-limited)",
        "variables": [
          {"symbol": "\\Delta z", "meaning": "axial resolution (depth resolution in sample, FWHM)", "units": "μm"},
          {"symbol": "\\lambda_0", "meaning": "center wavelength of light source", "units": "nm (typically 800, 1050, or 1300 nm)"},
          {"symbol": "\\Delta\\lambda", "meaning": "spectral bandwidth (FWHM of source spectrum)", "units": "nm (20-100 nm typical)"},
          {"symbol": "n", "meaning": "refractive index of sample (1.3-1.6 typical heritage materials: varnish, paint)", "units": "dimensionless"}
        ]
      },
      {
        "latex": "$$\\Delta x = \\frac{4\\lambda_0 f}{\\pi D} \\approx 1.22 \\frac{\\lambda_0 f}{D}$$",
        "description": "Lateral Resolution (diffraction-limited, focused beam spot size)",
        "variables": [
          {"symbol": "\\Delta x", "meaning": "lateral resolution (x or y, spot size FWHM)", "units": "μm"},
          {"symbol": "\\lambda_0", "meaning": "center wavelength", "units": "nm"},
          {"symbol": "f", "meaning": "focal length of objective lens", "units": "mm (10-100 mm typical)"},
          {"symbol": "D", "meaning": "beam diameter at objective (before focusing)", "units": "mm (1-10 mm)"}
        ]
      },
      {
        "latex": "$$z_{\\text{max}} = \\frac{\\lambda_0^2}{4n\\delta\\lambda}$$",
        "description": "Maximum Imaging Depth (SD-OCT, spectral resolution-limited)",
        "variables": [
          {"symbol": "z_{\\text{max}}", "meaning": "maximum depth range (imaging depth, limited by spectral sampling)", "units": "mm"},
          {"symbol": "\\delta\\lambda", "meaning": "spectral resolution (pixel spacing in spectrometer)", "units": "nm (0.05-0.2 nm typical spectrometer)"},
          {"symbol": "\\lambda_0, n", "meaning": "center wavelength, refractive index", "units": "nm, dimensionless"}
        ]
      },
      {
        "latex": "$$I(z) = I_r + I_s(z) + 2\\sqrt{I_r I_s(z)} \\cos\\left(\\frac{4\\pi n z}{\\lambda_0}\\right)$$",
        "description": "Interference Signal (simplified, single scatterer at depth z)",
        "variables": [
          {"symbol": "I(z)", "meaning": "detected interference intensity (depth-encoded)", "units": "arbitrary"},
          {"symbol": "I_r", "meaning": "reference arm intensity", "units": "arbitrary"},
          {"symbol": "I_s(z)", "meaning": "sample arm backscattered intensity from depth z", "units": "arbitrary"},
          {"symbol": "n, z, \\lambda_0", "meaning": "refractive index, depth, wavelength", "units": "dimensionless, μm, nm"}
        ]
      },
      {
        "latex": "$$\\mu_{\\text{eff}} = \\sqrt{3\\mu_a(\\mu_a + \\mu_s')}$$",
        "description": "Effective Attenuation Coefficient (limits penetration depth, scattering + absorption)",
        "variables": [
          {"symbol": "\\mu_{\\text{eff}}", "meaning": "effective attenuation coefficient (determines signal decay with depth)", "units": "mm⁻¹ or cm⁻¹"},
          {"symbol": "\\mu_a", "meaning": "absorption coefficient (material-dependent, wavelength-dependent)", "units": "mm⁻¹"},
          {"symbol": "\\mu_s'", "meaning": "reduced scattering coefficient (μ_s' = μ_s (1 - g), where g = anisotropy)", "units": "mm⁻¹"}
        ]
      }
    ],
    "interactionDepth": {
      "description": "OCT penetration depth material-dependent, governed by optical scattering and absorption. Near-infrared light (800-1550 nm) chosen for: (1) **Low absorption:** Water, organics (varnish, binders) have absorption minima NIR (vs. visible absorbed by pigments, UV absorbed by organics). (2) **Moderate scattering:** Sufficient backscatter for signal (vs. transparent glass, no scattering, weak OCT signal), but not excessive (vs. metals, opaque pigments, immediate scattering, no penetration). **Typical penetration:** Varnish (transparent, low scatter): 1-3 mm, limited by absorption, multiple scattering at depth (signal decays, S/N decreases, effective depth ~1-2 mm practical). Oil paint (moderate scatter, pigment-dependent): 0.2-1 mm (lead white, zinc white moderately scattering → 0.5-1 mm; umber, ochre, red pigments more absorbing → 0.2-0.5 mm; carbon black highly absorbing → surface only, <50 μm; titanium white extremely scattering → 0.1-0.3 mm). Tempera (matte, high scatter): 0.2-0.5 mm. Paper, parchment (fibers scatter): 0.5-1.5 mm. Wood (cellular structure): 0.5-2 mm (species-dependent, along grain deeper than cross-grain). Textiles (woven, loose): 1-3 mm (between fibers, low scatter air gaps, deeper than solid paint). Metals, opaque substrates: surface only, <10 μm (no penetration, OCT not useful bulk metals, but surface coatings detectable). **Wavelength dependence:** Longer wavelength (1300-1550 nm) penetrates deeper than 800 nm (scattering ∝ 1/λ⁴ Rayleigh regime, or 1/λ Mie; absorption windows); trade-off: longer λ → worse axial resolution (Δz ∝ λ²), so balance penetration vs. resolution (800 nm: 2-5 μm resolution, 0.5-1.5 mm depth; 1300 nm: 5-15 μm resolution, 1-3 mm depth; choose per application).",
      "materialSpecific": [
        {"material": "Varnished paintings (natural resin, synthetic)", "penetrationDepth": "1-3 mm total (varnish 20-200 μm clear, paint layers 50-500 μm beneath, may image 2-4 layers if not too opaque)", "visualizedFeatures": "Varnish thickness, surface cracks, interface with paint, paint layer count (if layers <50-100 μm distinguishable, thicker if refractive index mismatch strong), top 2-3 paint layers typically (deeper if light colors: lead white, zinc white, cadmium yellow; shallower if dark: umbers, blacks)"},
        {"material": "Unvarnished tempera, fresco", "penetrationDepth": "0.2-1 mm (matte surface scatters, pigment-dependent; tempera 0.3-0.7 mm typical; fresco lime matrix scatters 0.5-1 mm)", "visualizedFeatures": "Paint layer structure (tempera multiple thin layers 20-50 μm egg binder; fresco lime layers, pigment distribution), surface texture (brushstrokes, application method), cracks, delamination"},
        {"material": "Glazed ceramics, pottery", "penetrationDepth": "Glaze 50-300 μm (transparent, images through), ceramic body 0.5-1.5 mm (porous, scatters moderately)", "visualizedFeatures": "Glaze thickness, crazing (cracks in glaze, sharp refractive index change air/glaze → strong OCT signal), glaze-body interface, porosity in ceramic (voids, inclusions)"},
        {"material": "Parchment, vellum (manuscripts)", "penetrationDepth": "0.5-1.5 mm (collagen matrix, fibers scatter; entire parchment thickness 100-500 μm usually within penetration)", "visualizedFeatures": "Surface preparation (scraping, polishing marks), ink penetration (iron-gall ink 10-50 μm into parchment, OCT detects if sufficient contrast), fiber structure, repairs (patches, adhesives different scattering)"},
        {"material": "Paper (rag, wood-pulp)", "penetrationDepth": "0.5-1.5 mm (fiber network scatters, density-dependent; rag paper less scatter, wood-pulp more)", "visualizedFeatures": "Fiber structure (laid lines, chain lines if watermark paper), ink/pigment penetration, surface coatings (sizing, consolidants), foxing, degradation (fiber loss, voids)"},
        {"material": "Wood (panels, sculpture)", "penetrationDepth": "0.5-2 mm (cellular structure scatters; along grain 1-2 mm, cross-grain 0.5-1 mm; species-dependent: oak, pine more porous, deeper; ebony, mahogany denser, shallower)", "visualizedFeatures": "Wood grain (growth rings, vessels, rays), surface coatings (gesso, paint, varnish), cracks (radial, tangential), insect damage (galleries, exit holes if near surface)"},
        {"material": "Textiles (silk, linen, wool)", "penetrationDepth": "1-3 mm (woven structure, air gaps between fibers, low effective scattering allows deep penetration; solid threads 50-200 μm scatter individually)", "visualizedFeatures": "Weave structure (warp, weft, 3D arrangement), fiber diameter, surface coatings (dyes, consolidants, adhesives), damage (breaks, abrasion, thinning)"},
        {"material": "Metals, opaque pigments (pure)", "penetrationDepth": "<10 μm (no penetration; metals reflect, opaque; carbon black, iron oxides absorb strongly NIR)", "visualizedFeatures": "Surface coatings only (varnish, wax, patina on metal surface detectable if transparent; bulk metal, opaque pigment layers invisible OCT; use X-ray, ultrasound for bulk metals)"}
      ]
    },
    "spatialResolution": {
      "lateral": "5-25 μm typical (diffraction-limited by focusing optics). **Standard systems:** 10-20 μm (focal length 30-50 mm, beam diameter 2-5 mm, 800-1300 nm wavelength; adequate for layer boundaries, varnish, paint; resolves features >20-30 μm: brushstrokes, cracks, grain boundaries). **High-resolution systems:** 5-10 μm (short focal length 10-20 mm, or higher NA optics; resolves pigment grains 10-50 μm, fine cracks, but shorter working distance <10 mm, less practical uneven surfaces). **Widefield systems:** 20-50 μm (longer focal length, larger FOV, faster scans but coarser lateral; used for large-area surveys, then zoom high-res ROIs). Trade-off: lateral resolution vs. depth-of-focus (DOF) (high-resolution short focal length → shallow DOF <0.5 mm, sample must be flat or scan Z-axis; low-resolution long focal length → deep DOF 2-5 mm, tolerates surface topography).",
      "depth": "1-15 μm axial resolution (depth, z-axis; determined by coherence length, better than lateral by 2-5×). **Standard systems:** 5-10 μm (Δλ = 30-50 nm bandwidth, 800-1300 nm center; adequate distinguish paint layers 20-50 μm thickness, varnish 10-200 μm). **Ultra-high-resolution systems:** 1-3 μm (Δλ = 100-200 nm, broadband source or femtosecond laser; resolves thin glazes 5-20 μm, varnish degradation layers, interfaces, but expensive, less common heritage). Axial resolution isotropic (independent of focus, sample position; vs. lateral resolution varies with focus depth). Depth range (z_max): Typically 1-5 mm in air (spectrometer-limited, SD-OCT; in sample: z_max/n ≈ 0.7-3 mm for n = 1.5 typical). Adjustable via spectrometer design (more pixels, narrower δλ → larger z_max, but slower, more expensive).",
      "limitingFactors": [
        "Source bandwidth (axial resolution: broader Δλ better, but cost increases; 50 nm standard, 100-200 nm research ultra-high-res)",
        "Focusing optics (lateral resolution: NA, focal length; high-NA short focus better resolution, worse DOF, working distance)",
        "Scattering (signal decays with depth, effective penetration <3 mm typically, limits useful depth range even if z_max larger)",
        "Sample surface topography (uneven surfaces: focus varies, degrades lateral resolution unless dynamic focus correction or long focal length low-NA accepts roughness)",
        "Speckle noise (coherent imaging artifact, granular pattern from interference multiple scatterers; reduces contrast, spatial resolution effective; mitigate via compounding, averaging, or adaptive filtering)"
      ]
    },
    "sensitivity": {
      "description": "OCT detects refractive index changes (interfaces between layers: air/varnish n = 1.0/1.5, varnish/paint n = 1.5/1.6, paint/ground n = 1.6/2.0; Δn ≈ 0.1-0.5 typical) and backscattering intensity differences (pigment grains, fibers, voids scatter differently than binders, media). **Minimum detectable Δn:** ~0.01-0.05 (strong interface, high S/N >30 dB; weaker 0.05-0.1 detectable but low contrast <10 dB, may miss if noisy). **Minimum layer thickness:** ~2-3× axial resolution (10 μm axial resolution → detect layers ≥20-30 μm; thinner layers: overlap, appear blurred, difficult distinguish; ultra-thin <10 μm: require 1-3 μm UHR-OCT systems). **Dynamic range:** 40-60 dB typical (10⁴-10⁶ intensity range; detects weak signals from depth despite scattering attenuation, but noise floor limits: weak scatterers at depth <1% surface intensity may be undetectable). **Sensitivity vs. depth:** Decreases exponentially (scattering attenuates signal, e^(-2μt) round-trip; at penetration depth ~1/μ, signal reduced 37% = 4 dB loss; practical imaging depth where S/N >10 dB ≈ 1-3 mm depending on μ material). **Compared to other techniques:** OCT resolution intermediate (ultrasound: axial 50-200 μm, worse; confocal microscopy: 1 μm, better but slower, shallower <500 μm; THz imaging: 10-50 μm axial, similar but different contrast mechanisms). OCT unique: fast (real-time B-scans), non-contact (vs. ultrasound coupling gel), deeper than confocal (mm vs. μm), better resolution than THz, optimal niche heritage stratigraphy."
    }
  },
  "instrumentation": {
    "source": {
      "type": "Low-coherence broadband light source: (1) **Superluminescent diode (SLD, SLED):** Most common (fiber-coupled, compact, stable, 10-30 mW output, 800-1550 nm center wavelengths available, Δλ = 20-80 nm, cost $1-5K per SLD, long lifetime 10K-50K hours). (2) **Femtosecond laser (Ti:Sapphire, Yb-doped fiber):** Ultra-broadband (Δλ = 100-300 nm, center 800-1300 nm, enables 1-3 μm axial resolution), but expensive ($50-200K), complex, less common except research. (3) **Swept-source laser (tunable):** Wavelength sweeps rapidly 100-400 kHz (1300-1550 nm typical, Δλ = 50-100 nm), high speed, but expensive laser ($20-80K), used advanced SS-OCT systems. (4) **Thermal / ASE broadband sources:** Cheaper ($500-2K), lower power, less common (amplified spontaneous emission from fiber amplifier, or tungsten halogen filtered to NIR; used budget systems, slower).",
      "specifications": "**Wavelength:** 800 nm (most common heritage OCT; good balance resolution, penetration, detector availability), 1050 nm (emerging; deeper penetration than 800 nm, less absorption water, organics), 1300-1550 nm (telecom wavelengths; deepest penetration, but worse resolution, requires InGaAs detectors more expensive than Si at 800 nm). **Bandwidth:** 20-80 nm standard (5-10 μm axial resolution), 100-300 nm ultra-high-res (1-3 μm resolution, research systems). **Power:** 1-30 mW (low power safe for heritage, non-damaging even light-sensitive materials; vs. W-scale lasers Raman, ablation, too intense). **Coherence length:** 2-10 μm (inversely related bandwidth; shorter = better axial resolution).",
      "powerRange": "1-30 mW total (split reference + sample arms; sample arm ~0.5-15 mW incident on object, distributed over spot size 10-20 μm diameter → ~0.01-1 W/cm² intensity; safe, below damage threshold heritage materials typically >10² W/cm² CW, >10⁶ W/cm² pulsed)."
    },
    "detector": {
      "type": "Depends on OCT configuration: **Spectral-domain (SD-OCT):** Spectrometer + line-scan camera (1D array CCD or CMOS, 1024-4096 pixels, 20-100 kHz line rate, Si-based for 600-1000 nm, InGaAs for 1000-1700 nm). **Swept-source (SS-OCT):** Photodiode (single-element, InGaAs or Si, 100 MHz bandwidth, AC-coupled, balanced detection typical to suppress DC, common-mode noise). **Time-domain (TD-OCT, obsolete):** Photodiode, but slow (scanning mirror, 1-10 kHz A-scan rate; replaced by SD-OCT, SS-OCT 100-1000× faster).",
      "spectralRange": "Detector matches source: 800 nm SLD → Si detector (400-1000 nm response), 1300-1550 nm swept-source → InGaAs detector (900-1700 nm). Spectrometer bandwidth matches source Δλ (800 ± 50 nm → spectrometer 750-850 nm range, 0.05-0.2 nm resolution per pixel, 1024-2048 pixels typical).",
      "efficiency": "Quantum efficiency: Si detector 80-95% @ 600-900 nm (good match 800 nm systems), drops <50% @ >1000 nm. InGaAs 80-90% @ 1000-1700 nm (used 1300-1550 nm systems, more expensive than Si). Spectrometer efficiency: 30-60% (grating diffraction, lens losses, detector fill factor); overall system efficiency sample-to-detector ~10-30% (optical losses: fiber coupling, beam splitters, objective focus, sample backscatter, interferometer, detector).",
      "resolution": "Spectral resolution (δλ): 0.05-0.2 nm per pixel (determines maximum imaging depth z_max = λ²/(4nδλ); 800 nm, δλ = 0.1 nm, n = 1.5 → z_max ≈ 1 mm in sample, 1.5 mm in air; coarser δλ → shallower z_max, finer → deeper but more expensive spectrometer, slower). Temporal resolution (A-scan rate): SD-OCT 20-100 kHz (limited by camera frame rate), SS-OCT 100-400 kHz (limited by sweep speed laser, detector bandwidth). Real-time imaging: B-scans (2D cross-sections) 10-100 fps (500-2000 A-scans per B-scan; 50 kHz A-scan rate, 1000 A-scans → 50 fps B-scan), fast enough visualize during treatment (varnish removal, monitor in real-time)."
    },
    "opticalSystem": {
      "components": [
        "**Fiber-optic Michelson interferometer:** Core OCT setup. (1) **Fiber coupler (beam splitter):** 50/50 or 90/10 split (50/50: balanced reference + sample power, typical; 90/10: more sample power if reference mirror reflective, less common). (2) **Reference arm:** Fiber to collimator → mirror (fixed SD-OCT, scanning TD-OCT, or calibration mirror SS-OCT), controls reference path length. Dispersion compensation (glass block, fiber, matches sample arm dispersion, critical broadband systems; mismatch → axial resolution degrades). (3) **Sample arm:** Fiber to collimator → galvanometer mirrors (2-axis, x-y scanning, closed-loop, ±5-10° deflection, 1-10 kHz scan rate; or resonant galvo: one axis 8-12 kHz, fast B-scans) → objective lens (focal length 10-100 mm, NA 0.05-0.3, achromat or plan-apochromat, diffraction-limited 5-25 μm spot) → sample. (4) **Detection arm:** Combined beams (reference + sample) → spectrometer (SD-OCT) or photodetector (SS-OCT), interference signal captured.",
        "**Galvanometer scanners:** Two mirrors (typically x-axis slow, y-axis fast, or one galvo + resonant scanner; or both closed-loop galvos if precise positioning needed). Scan patterns: Raster (B-scans along x, stepped in y, builds 3D volume; typical 500-2000 A-scans per B-scan, 100-1000 B-scans per volume), radial (spokes from center, used circular symmetric samples: paintings round damage), arbitrary (user-defined ROI, sparse sampling for speed). Positioning accuracy: ±1-10 μm (encoder feedback, closed-loop; critical for registering repeat scans, monitoring treatments).",
        "**Objective lens:** Refractive (achromat, plan-apochromat; 10-100 mm focal length, 5-25 mm clear aperture, NA 0.05-0.3; commercial microscope objectives adapted or custom telecentric lenses) or reflective (Schwarzschild, parabolic mirror; achromatic, broad wavelength range, used ultra-broadband systems, but more expensive, bulky). Working distance: 10-100 mm (short focal length, high-NA: 10-30 mm WD, high resolution, but close to sample, risk collision; long focal length, low-NA: 50-100 mm WD, safe clearance, tolerates topography, but lower resolution). Telecentric design (preferred): chief rays parallel to optical axis, constant magnification across depth, simplifies calibration, measurement.",
        "**Spectrometer (SD-OCT specific):** Collimating lens (fiber output, collimate beam) → transmission grating (1200-1800 lines/mm, disperses wavelengths) → focusing lens (camera focal plane) → line-scan camera (1024-4096 pixels, 20-100 kHz line rate, Si or InGaAs). Spectral range matches source (e.g., 750-850 nm for 800 nm SLD), calibrated (wavelength per pixel; use known absorption lines: water vapor, or reference interferometer, precision <0.01 nm). Sensitivity roll-off: Signal decreases with depth (spectrometer finite resolution limits fringe frequency detection; deeper layers → higher frequency fringes → reduced sensitivity; practical depth <50% z_max for good S/N).",
        "**Swept-source laser (SS-OCT specific):** Wavelength-tunable laser (external cavity, MEMS mirror or polygon filter; or Fourier-domain mode-locked (FDML) fiber laser, fastest; sweeps 1000-1600 nm over 50-100 nm range, 100-400 kHz sweep rate). Photodetector balanced pair (subtract DC, enhance AC interference signal, common-mode rejection, improves sensitivity 3-10 dB vs. single detector). K-clock (calibration interferometer, generates evenly-spaced frequency samples k = 2πn/λ; software resamples data, corrects sweep nonlinearity, essential accurate Fourier transform, axial resolution).",
        "**Sample mount and positioning:** XYZ stage (manual or motorized; coarse positioning, cm-range, μm-precision if motorized; or fixed sample, scan head moves, less common heritage due to object size). Tilt adjustment (align sample surface perpendicular to beam, optimize signal, reduce shadowing oblique surfaces). Some systems: handheld probe (fiber-coupled sample arm, handheld delivery, flexibility large objects murals, but less stable, more operator skill needed; emerging commercial heritage OCT). Ergonomics: sample horizontal (paintings on table, easier access, stable) or vertical (easel-mounted, natural orientation paintings, but scan head must articulate).",
        "**Data acquisition and processing:** DAQ (data acquisition: digitize spectrometer camera or photodetector, 12-16 bit ADC, USB 3.0 / CameraLink / PCIe, real-time streaming 100+ MB/s). Computer (workstation or laptop, GPU-accelerated processing for real-time display: CUDA, OpenCL; or post-processing batch mode). Software: Commercial OCT (vendor-specific: Thorlabs OCTsoftware, Santec, Michelson Diagnostics; or open-source: OCTproZ, OCIP toolkit Python/MATLAB; functions: Fourier transform spectra → depth profiles, dispersion compensation, log-scale display, B-scan/C-scan rendering, layer segmentation, thickness measurement, 3D visualization). Calibration: Axial (mirror or known material, verify μm/pixel depth scale ±1-5%), lateral (calibration target grid, verify μm/pixel x-y ±1-5%)."
      ],
      "beamPath": "Source (SLD or laser) → fiber coupler (50/50 split) → reference arm (fiber → collimator → mirror, back-reflected) + sample arm (fiber → collimator → galvo scanners → objective lens → sample, backscattered from depths z₁, z₂, ..., z_n within sample) → fiber coupler (beams recombine, interfere) → spectrometer (SD-OCT, disperses wavelengths, camera records spectrum) or photodetector (SS-OCT, records intensity vs. time as wavelength sweeps). Interference fringes encode depth information (oscillation frequency ∝ depth; Fourier transform converts spectrum/time-domain → depth-domain, A-scan profile).",
      "focusing": "Fixed focus (sample placed at objective focal plane, single depth focus; if sample tilted, warped: some regions out-of-focus, blurred, reduced sensitivity; adequate flat samples <1 mm topography variation). Dynamic focus (rare, expensive: electrically tunable lens or MEMS mirror adjusts focus depth during scan, maintains resolution across topography; or software: multiple volumes at different focus depths, merge; time-intensive). Depth-of-focus (DOF) consideration: DOF ≈ 2λ/(NA)² ≈ confocal parameter (for NA = 0.1, λ = 800 nm: DOF ≈ 0.2 mm; for NA = 0.3: DOF ≈ 20 μm; trade-off lateral resolution vs. DOF, choose NA per application: flat sample high-NA, rough sample low-NA)."
    },
    "criticalComponents": [
      "Broadband light source (quality, stability: bandwidth determines resolution, power determines sensitivity, stability <0.1% intensity drift during scan ensures uniform image intensity)",
      "Spectrometer or swept-source laser (SD-OCT: spectrometer spectral resolution, calibration critical; SS-OCT: laser sweep linearity, speed, k-clock accuracy essential)",
      "Galvanometer scanners (repeatability, speed: ±1 μm positioning accuracy, low jitter, enable reproducible scans, monitoring treatments, repeat measurements)",
      "Objective lens (quality, focal length: determines lateral resolution, working distance; achromatic over full bandwidth avoids chromatic blur, maintains axial resolution)",
      "Fiber optics and alignment (low-loss single-mode fiber, proper FC/APC connectors minimize back-reflections which create artifacts; alignment reference + sample arms <1° ensures good interference contrast)"
    ],
    "typicalConfiguration": "**Standard heritage OCT system (commercial, e.g., Thorlabs Ganymede, Santec IVS-3000):** 930 nm SLD (Δλ = 100 nm, 10 mW, 3 μm axial resolution in tissue ≈ 5 μm in paint), SD-OCT (spectrometer 2048 pixels, 70 kHz A-scan rate), galvanometer scanners (5 mm × 5 mm lateral range, 1 kHz x, 10 kHz y speeds), objective lens (focal length 36 mm, NA 0.13, spot 12 μm, working distance 25 mm), fiber Michelson interferometer (50/50 coupler), PC (GPU processing, real-time B-scan display 50 fps), software (vendor GUI: live imaging, B-scan/volume acquisition, layer detection, measurement tools, export TIFF/AVI). **Specifications:** Axial resolution 5-7 μm (in air; 3-5 μm in sample n = 1.5), lateral resolution 10-15 μm, imaging depth 2.5 mm (air), penetration 0.5-2 mm (sample), scan speed 20-70 fps B-scans (500-2000 A-scans per frame), FOV 2×2 to 10×10 mm (adjustable zoom, galvo amplitude), size 40×30×20 cm scan head, 60×40×30 cm control box + PC, weight ~20-30 kg scan head, 15-25 kg control box (portable on cart, wheels). Cost $80-150K. **Research / custom UHR-OCT system:** Ti:Sapphire femtosecond laser (center 800 nm, Δλ = 150 nm, 1 μm axial resolution), SD-OCT spectrometer (4096 pixels, custom-built, high dispersion grating 2400 lines/mm, covers 700-900 nm), high-NA objective (NA 0.3, 10 μm focal length microscope objective, 5 μm lateral resolution, WD 10 mm), closed-loop galvos (±1 μm repeatability), workstation (GPU Fourier transform, MATLAB processing). Specifications: Axial 1-2 μm, lateral 5 μm, depth 1.5 mm (limited by spectrometer, scattering), FOV 1×1 to 5×5 mm (small due to short focal length), scan speed 50 kHz A-scan (limited by camera), real-time B-scans 25-50 fps. Size: benchtop 1×0.5 m breadboard (research lab, not portable). Cost: $150-300K (laser $100K, custom spectrometer $30K, optics + detectors + electronics $50-100K, labor setup). Used: ultra-high-res studies thin varnish layers, glaze interfaces, research publications, not routine conservation.",
    "facilityRequirements": {
      "space": "Small lab or conservation studio. 2×2 m workspace (OCT system on cart or table, sample stage, operator). Portable systems: transport to gallery, storage, field site (fit standard vehicle, 2-person lift, setup 15-30 min). Benchtop research: dedicated optics lab (vibration isolation table, dark room for alignment, climate-controlled ±2°C, 40-60% RH stable).",
      "utilities": ["Electrical: 110/240 VAC, 5-10 A (OCT system 100-500 W; PC, monitors, scanners, laser cooling if present; standard wall outlet adequate).", "Cooling: Forced air or water (laser cooling if femtosecond or high-power; SLD/swept-source typically air-cooled TEC, integrated, no external cooling).", "Network: Ethernet or WiFi (optional; remote monitoring, cloud backup data, not essential standalone operation).", "Compressed air / N₂ (optional; purge optical path if low-scatter environment desired, reduces air turbulence, improves stability; most heritage OCT operate ambient air, acceptable)."],
      "environmental": ["Temperature: 18-25°C (system stable, ±2°C drift during scan acceptable; laser wavelength temperature-dependent, compensated by software or thermostat; >5°C drift may shift calibration, refractive index sample changes slightly, affects measurement ±1-2 μm per °C, minor).", "Humidity: 30-60% RH (electronics, optics; avoid condensation <10% or >80%, fiber connectors, lenses fog; heritage objects stored 40-60% typically, compatible OCT operation).", "Vibration: Low (sub-μm axial resolution sensitive to vibration; heavy table, concrete floor, or passive isolation (rubber pads) adequate most conservation labs; ultrasound, nearby machinery off during scan; if severe vibration: active isolation table, not usually necessary).", "Ambient light: Negligible impact (NIR detector insensitive visible light, some visible scatter may enter detector, increases noise floor slightly; darken room if critical, but typically ambient light tolerable, opaque enclosures on detectors)."]
    },
    "commercialSystems": [
      {
        "vendor": "Thorlabs (optical components, imaging systems)",
        "modelName": "Ganymede Spectral Domain OCT System",
        "specifications": "930 nm SLD center wavelength, 100 nm bandwidth, 3 μm axial resolution (tissue, ≈5 μm in varnish/paint), 70 kHz A-scan rate, 2048-pixel spectrometer, 12 μm lateral resolution, 2.5 mm imaging depth (air), 5×5 mm FOV, real-time display 50 fps B-scans, USB 3.0 interface, software included (Windows, layer segmentation, measurements). Adapted for heritage via custom sample mounts, larger lateral scan (aftermarket galvos or software adjustments). Cost $80-120K.",
        "approximateCost": "$80,000-$120,000",
        "url": "https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=10766"
      },
      {
        "vendor": "Santec Corporation (swept-source OCT)",
        "modelName": "IVS-3000 / IVS-300 Series",
        "specifications": "1310 nm swept-source laser, 100 nm sweep range, 8 μm axial resolution, 160 kHz A-scan rate, 18 μm lateral resolution, 3 mm imaging depth, 6×6 mm FOV, InGaAs balanced detector, real-time GPU processing. More expensive than 800 nm SD-OCT, but deeper penetration (1310 nm less scatter, absorption water, organics). Used biomedical ophthalmology, anterior segment imaging; adaptable heritage. Cost $100-150K.",
        "approximateCost": "$100,000-$150,000",
        "url": "https://inst.santec.com/products/octsystems"
      },
      {
        "vendor": "Michelson Diagnostics Ltd. (UK, dermatology OCT adapted heritage)",
        "modelName": "EX1301 OCT System",
        "specifications": "1305 nm, 10 μm axial resolution, 20-70 kHz A-scan, 7.5 μm lateral, 2 mm depth, 6×6 mm FOV. Handheld probe option (fiber delivery, portable, paintings, murals in situ). Research collaborations with heritage institutions (Rijksmuseum, National Gallery London, adapted for art). Commercial cost $80-150K, academic collaborations subsidized.",
        "approximateCost": "$80,000-$150,000",
        "url": "https://www.michelsondiagnostics.com"
      },
      {
        "vendor": "OCT systems adapted from biomedical (ophthalmology, dermatology)",
        "modelName": "Heidelberg Engineering Spectralis, Zeiss Cirrus, Optovue, Topcon (clinical OCT)",
        "specifications": "Not heritage-specific, but adaptable (replace chin rest with sample stage, modify software for non-medical use, regulatory gray area but functional). Specifications: 870 nm typical, 5-7 μm axial resolution, 15-20 μm lateral, 2-3 mm depth, 6×6 mm or 9×12 mm FOV, high-speed 40-80 kHz. Cost: clinical market $50-100K per system (volume production, lower than heritage-specific), second-hand $10-30K (older models, research use). Ethics: clinical systems FDA/CE-approved for human eyes, adaptation to heritage not intended use, but no legal prohibition research, conservation labs; some institutions use, others prefer heritage-specific avoid regulatory ambiguity.",
        "approximateCost": "$50,000-$100,000 new, $10,000-$30,000 used",
        "url": "Various (Heidelberg, Zeiss, Optovue, Topcon clinical sites)"
      },
      {
        "vendor": "Custom / research builds",
        "modelName": "Laboratory-built OCT systems (university optics labs, research institutes)",
        "specifications": "Tailored specifications: wavelength, resolution, speed, FOV per project needs. Example: NCU Poland (Nicolaus Copernicus University Toruń), UMK custom OCT for paintings, varnish studies (800 nm, 5 μm axial, 3D volumes, publications 2010s-2020s). TU Delft, Netherlands (technical art history group, custom OCT manuscripts, paintings). Build cost: $50-150K (parts: SLD $2K, spectrometer components $10-30K, optics $5-10K, galvos $3-10K, DAQ + PC $5-10K, optomechanics + labor $10-50K; expertise required: optics, programming, calibration; 3-12 months development time). Advantage: customize, publish methods, open-source software; disadvantage: no warranty, maintenance, support, not turnkey.",
        "approximateCost": "$50,000-$150,000 (parts + labor)",
        "url": "N/A (academic publications, institutional websites describe systems)"
      }
    ]
  },
  "methodology": {
    "samplePreparation": {
      "samplingRequired": false,
      "sampleSize": "Intact objects or fragments. No size limit conceptually (FOV 2-10 mm typical single scan, but mosaic stitch 10s-100s scans, cover large areas cm-dm scale; limited by time, not physics). Typical: paintings (canvas, panel, entire painting or selected cm² ROIs), manuscripts (folios, book pages, selected text, illumination areas), textiles (cm²-dm² samples or full objects if portable system), ceramics, wood, samples (any size if positionable under scan head). Micro-samples acceptable (cross-sections 100 μm - 1 mm, chips, fibers; if flat, polished surface optimal but not required).",
      "mountingProcedure": "Position sample flat, stable (horizontal table, vertical easel depending on system). **Flat objects:** Lay horizontal (paintings, manuscripts, textiles; most stable, gravity-assisted). **3D objects:** Support (foam cradles, clamps; orient region-of-interest perpendicular to beam if possible, maximizes signal, reduces shadowing oblique surfaces; or accept oblique, longer path length, adjust interpretation). **Alignment:** Level surface (sample perpendicular to beam; some systems auto-detect surface, compensate tilt in software; others require manual alignment; misalignment ±5° acceptable, >10° degrades image quality, axial distortion). **No contact:** OCT non-contact (no coupling gel unlike ultrasound, no pressure); clearance 10-100 mm working distance depending on objective; ensure sample surface within WD, focus range.",
      "surfacePreparation": "None required (OCT images through dust, surface dirt, transparent consolidants, varnishes; no cleaning needed unless excessive surface contamination scatters light, degrades image quality, in which case gentle dust removal: compressed air, soft brush, conservation permissible). **Polished cross-sections:** If sample is embedded, polished cross-section (SEM-EDS, optical microscopy), OCT can image same cross-section (correlate OCT layer structure with SEM elemental maps, optical microscopy colors; polished surface flat, optimal OCT image quality, avoids topography artifacts).",
      "contaminationConcerns": "None (non-contact, no transfer). Surface dust, fingerprints: scatter light (increase noise floor, reduce penetration depth slightly; remove if excessive, but typically minor impact, acceptable). Ambient light: NIR detector, visible light insensitive (room light negligible; if very bright, close blinds or opaque enclosure on detector, but usually unnecessary)."
    },
    "measurementProtocol": {
      "preMeasurementPlanning": {
        "objectAssessment": "Visual inspection: Photograph object (visible, raking light, UV fluorescence if available), identify features of interest (varnish condition, surface texture, suspected damage, previous treatments, areas of concern). Condition assessment: Note fragile areas (flaking paint, loose varnish, delamination visible), surface topography (warped, curved, textured >5 mm relief), obstructions (frames, mounts, cannot access edges). Technical history review: Prior analyses (XRF, FTIR, microscopy reports; note pigments identified, layers known), conservation records (past varnish removal, consolidation; understand treatment history), provenance (date, artist, materials expected period-appropriate). Research questions: Define objectives (varnish thickness for removal planning? Layer count for technique study? Damage extent for consolidation? Underdrawing detection for attribution?), prioritize (critical measurements vs. nice-to-have). ROI selection preliminary: Mark on photographs (5-20 locations typical: representative areas, transitions, anomalies, damage, historical interest), justify each (why this location? What question answers?).",
        "systemPreparation": "Hardware check: Power on OCT system 30-60 min before (SLD/laser warm-up, stabilize intensity ±1%, wavelength drift <0.1 nm), inspect optics (objective lens clean: no fingerprints, dust; wipe isopropanol + lens tissue if needed), galvanometer function test (scan without sample, observe mirrors, should move smoothly no jitter). Software setup: Load/update calibration files (axial μm/pixel, lateral μm/pixel, refractive index setting n = 1.5 typical or material-specific if known), configure scan parameters (FOV 5×5 mm default, adjust per need; A-scans 1000-2000, averaging 5-10 frames; save settings template). Calibration verification: Axial (depth): Scan mirror or glass coverslip (150 μm known thickness), measure OCT, compare (if error >5%: adjust software n, or record correction factor, or recalibrate if severe >10%). Lateral (x-y): Scan USAF target or grid (measure line spacing pixels, compare known μm; if mismatch >5%: update galvo calibration, or note effective resolution report). Sensitivity: Neutral density filter + mirror (measure SNR vs. attenuation, verify >90 dB system sensitivity typical good systems, <80 dB investigate: detector connection, fiber alignment, power reduced). Reference arm optimization (SD-OCT): Position reference mirror (zero-delay near middle depth range, z = 0 at sample surface expected position), check interference fringe visibility (contrast >50%, maximize by adjusting reference power if variable attenuator available).",
        "sampleMounting": "No contact, no preparation needed (OCT advantage: non-invasive), but optimize setup: Surface access: Remove frames, backings if safe (conservator approval), expose region of interest fully, avoid shadowing from edges. Positioning: Place object on stable mount (horizontal table preferred: paintings, manuscripts, flat; or vertical easel if large painting, ensure stability). Flat orientation (sample surface perpendicular to beam ±5°; if tilted >10°, note, may degrade axial resolution, or tilt-correct in software if available). Fiducial markers (optional but recommended): Affix small markers near ROIs (1-2 mm Au dots, sticky labels, or ink dots if removable, or natural features: cracks, pigment spots; photograph, record coordinates; enables: return same location repeat scans, monitoring treatments, correlation with other techniques). Clearance check: Objective working distance (10-100 mm depending on system; ensure sample surface within range, no collision risk; if 3D object, highest point <working distance). Lighting: Ambient (if system has co-axial camera, visible LED for alignment; ensure adequate lighting, position sample, but OCT itself NIR, ambient light negligible)."
      },
      "executionSteps": [
        {
          "stepNumber": 1,
          "title": "Initial Sample Positioning and Alignment",
          "description": "Coarse positioning: Move XYZ stage (manual knobs or joystick if motorized) to bring first ROI under scan head. If system has alignment laser/LED: red dot shows beam position on sample surface, align feature of interest (e.g., suspected damage, varnish area) under dot. Z-axis focus: If motorized Z: jog up/down, observe live B-scan preview (should see sample surface as bright horizontal line top of OCT display). Optimal Z-position: Surface centered in depth range (if z_max = 2 mm, surface at z ≈ 0.2-0.5 mm, leaves 1.5 mm depth for layers beneath). Verify signal: Surface should be bright (high intensity, 60-90% of max in log-scale display). Tilt adjustment (critical for flat samples): If sample tilted: surface appears oblique in B-scan (left-right height difference >50 μm over 5 mm FOV → >1° tilt, degrades penetration one side). Adjust sample tilt (tilt stage if available, or shim under sample edges with foam, cardstock; iterate until surface appears horizontal B-scan ±10 μm over FOV). Lock position: Record XYZ coordinates (software, notebook; essential return same location later scans, treatments, monitoring), photograph (sample + scan head position, overview context).",
          "duration": "10-20 minutes",
          "criticalParameters": ["Sample surface visible in OCT display", "Signal strength adequate (>30% max intensity)", "Surface horizontal ±10 μm over FOV", "Position coordinates recorded"]
        },
        {
          "stepNumber": 2,
          "title": "Quick Survey Scan - Initial Assessment",
          "description": "Purpose: Rapid evaluation (penetration depth, layer visibility, image quality) before committing to high-resolution acquisition. Parameters: Lateral extent: 5-10 mm (cover feature + surrounding context). A-scans: 500-1000 (coarse sampling, ~5-10 μm step if 5 mm FOV; adequate survey, faster than high-res 2000 A-scans). Averaging: 1-3 frames (minimal, quick, sufficient assess quality; increase if noisy). Scan speed: 0.5-2 seconds per B-scan (50 kHz A-scan rate: 1000 A-scans / 50,000 Hz = 0.02 s + galvo overhead ~0.5-1 s total). Execution: Initiate scan: Software button 'Capture B-scan' or 'Live mode' (real-time display updates 10-50 fps, observe as scanning). Monitor during acquisition: Watch display (layers appearing? Penetration adequate? Artifacts: motion, saturation?). Review immediately: Penetration depth: Measure where signal fades to noise (click depth measurement tool, or count pixels × μm/pixel; e.g., signal visible to z = 800 μm → adequate for varnish 50-100 μm + paint 200-300 μm; if <200 μm, material opaque, document, may limit study). Layer visibility: Count distinct layers (varnish top bright line, paint layers beneath as intensity variations, interfaces; e.g., '3 layers visible: varnish 80 μm, paint 1 50 μm, paint 2 100+ μm fades to noise'). Image quality: Speckle acceptable (grainy but structure visible)? Saturation (surface clipped, reduce power)? Focus (sharp or blurred)? Motion artifacts (horizontal streaks, re-scan if severe)? Adjust if needed: Insufficient penetration (<200 μm, expected >500 μm): Increase power (reduce attenuator), or switch wavelength (1300 nm if available, deeper than 800 nm), or increase averaging (5-10 frames, improves S/N deep layers), or accept (document 'material highly scattering, penetration limited'). Decision: Proceed high-resolution (if quality good, adequate penetration), or adjust parameters/wavelength, or move to different ROI (if material unsuitable OCT: opaque, no penetration, document and skip).",
          "duration": "5-10 minutes per ROI",
          "criticalParameters": ["Penetration depth >200 μm (adequate for layers)", "Layer boundaries visible", "No severe artifacts", "Signal-to-noise ratio >20 dB"]
        },
        {
          "stepNumber": 3,
          "title": "High-Resolution 2D B-Scan Acquisition",
          "description": "Purpose: Quantitative measurement (layer thickness, depth profiles, interfaces) for analysis, publication. Parameters (optimize per research question): Standard: Lateral extent 5 mm, A-scans 1500-2000, averaging 10 frames, acquisition time 3-10 s. High-detail: Lateral extent 2-3 mm, A-scans 3000-4000, averaging 20 frames, acquisition time 20-60 s. Fast survey: Lateral extent 10 mm, A-scans 500-1000, averaging 3-5 frames, acquisition time 0.5-2 s. Treatment monitoring: Lateral extent 3-5 mm, A-scans 1000-1500, averaging 1-5 frames (fast, real-time), acquisition time 0.2-2 s (10-50 fps). Execution: Set parameters: Software scan settings dialog (FOV x-extent, # A-scans, averaging, save path). Filename convention: Systematic (e.g., ObjectID_ROI#_Date_Scan#.tif → Rembrandt_NightWatch_ROI05_20250116_001.tif; include metadata: parameters, notes in log or EXIF tags). Acquire: Single B-scan: Initiate (progress bar, ETA; 2000 A-scans × 10 avg @ 50 kHz = 4 s + processing 1-2 s = 5-6 s total), save automatically (TIFF, proprietary format, or both). Multiple parallel B-scans (optional, 3D precursor): If layer thickness varies laterally, acquire 5-10 B-scans spaced 0.5-1 mm apart (covers 5-10 mm in Y; reveals spatial variation; total 5-10× time: 25-50 s for 5 B-scans). Cross-sectional B-scans (orthogonal): If feature extends both X and Y (e.g., crack diagonal), scan X-direction and Y-direction (intersecting cross-sections reveal 3D structure; 2 scans, 10-20 s total). Quality check immediate: Open saved file: Verify (not corrupted, displays correctly, layers visible). Measure test: Quick thickness measurement (software line tool, distance between layer boundaries; e.g., varnish 78 μm, paint layer 1 52 μm; record). Compare survey vs. high-res: Improved detail (finer structures, less speckle due to more averaging), consistent (same layers, depths ±5 μm survey values, validates). Repeat for all ROIs: 5-20 locations typical (2-10 min per ROI: position, acquire high-res B-scan(s), QC, move next; total session 1-3 hours depending on # ROIs, complexity).",
          "duration": "1-5 minutes per scan",
          "criticalParameters": ["Sample stable (no movement; check fiducial markers before/after each scan)", "Parameters logged (each scan: FOV, # A-scans, averaging, power, wavelength, date/time)", "Backup initiated (copy data to external drive, cloud; after every 5-10 scans or hourly)"]
        },
        {
          "stepNumber": 4,
          "title": "3D Volume Acquisition (Optional, Comprehensive Mapping)",
          "description": "When to acquire 3D: Spatial variation expected (varnish thickness uneven, brushstroke relief, damage network extent). Treatment planning (map entire treatment zone 1×1 cm, visualize layers, cracks 3D, plan strategy). Research publication (3D renderings, en-face C-scans, impressive visualizations). Monitoring over time (acquire baseline 3D, re-scan post-treatment, compare volumetrically). Parameters: Small detail: FOV 2×2 mm, A-scans 1000×200, total 200,000 A-scans, time 10-30 s. Standard: FOV 5×5 mm, A-scans 1500×300, total 450,000 A-scans, time 30-60 s. Large area: FOV 10×10 mm, A-scans 2000×500, total 1,000,000 A-scans, time 1-3 min. Ultra-high-res: FOV 3×3 mm, A-scans 3000×500, total 1,500,000 A-scans, time 2-5 min. Execution: Define volume region: Software 3D scan dialog (X-range, Y-range, # A-scans X, # B-scans Y; or FOV + resolution input, calculates automatically). Set averaging: 1-5 frames per B-scan (balance: 1 frame fastest, noisier; 5 frames 5× slower, cleaner; 3 typical compromise). Scan pattern: Raster (default: scan X-direction repeatedly, step Y-direction; or bidirectional: alternate X-direction, faster, snake pattern). Initiate: Progress display (current B-scan # / total, ETA; e.g., 'B-scan 150/300, 90 s remaining'). Monitor: Live preview: Some systems display current B-scan during acquisition (verify quality, watch for issues: motion, saturation, sample drift). Do not disturb: Sample must remain absolutely stationary (minutes-scale acquisition; vibration, drift → misalignment B-scans, corrupted volume; ensure no AC drafts, building vibration, people walking nearby). Post-acquisition processing: Fourier transform: If raw data (SD-OCT spectra), batch Fourier transform all A-scans → 3D array [X, Y, Z] intensity (GPU-accelerated: 1-10 s for 1M A-scans; CPU: 10-60 s). Log-scale conversion: Linear intensity → log (dB) display (enhances weak signals depth, standard). Save: Large file (1000×500×1024 voxels × 2 bytes = 1 GB; or compressed TIFF stack, HDF5 ~200-500 MB; ensure sufficient storage, backup).",
          "duration": "30 seconds - 10 minutes per volume",
          "criticalParameters": ["Resolution adequate (X, Y sampling: 5-10 μm typical to resolve lateral features)", "Sample stationary (motion during multi-minute scan: drift, vibration artifacts)", "Storage prepared (GB-scale data; backup immediately post-acquisition)"]
        },
        {
          "stepNumber": 5,
          "title": "Treatment Monitoring (Real-Time or Sequential Scans)",
          "description": "Scenario: Conservator removing varnish with solvent swabs, or applying consolidant, or laser cleaning. Objective: Monitor in real-time (immediate feedback, safety, quality control), or sequential (before/during/after). Protocol A - Real-Time Continuous Monitoring (Fast Systems, 20-100 fps B-scans): Setup: Position scan head over treatment area (fix location: mark sample, or motorized stage locked coordinates), select B-scan line (through center of treatment zone, 3-5 mm lateral). Continuous live display: Software 'Live mode' (B-scans acquired continuously, displayed real-time 10-50 fps; conservator views screen while working). Treatment execution: Conservator swabs (e.g., solvent on cotton swab, gently roll across varnish 5-10 s per pass). Observe changes: Varnish removal: Top layer thickness decreases (80 μm → 70 μm → 60 μm real-time updates every 1-2 s per swab pass). Paint surface exposure: If varnish fully removed, paint surface appears (increased roughness, intensity changes, texture different; STOP immediately if detected, varnish gone, further swabbing damages paint). Over-cleaning warning: If paint layer starts thinning (top interface moving downward, paint surface eroding; rare but possible if over-aggressive; STOP, adjust solvent strength, technique). Record: Screen capture video (software, or external screen recorder; AVI, MP4 saved; documents entire treatment, time-stamped), or snapshots (every 1-5 min, save B-scan TIFF, annotate '5 min treatment, 60 μm varnish remaining'). Endpoint decision: Conservator + imaging specialist monitor (when target thickness reached, e.g., 10 μm varnish remaining minimal, or complete removal 0 μm, STOP), document final state (save final B-scan, photograph surface). Protocol B - Sequential Monitoring (Slower Systems, or Intermittent): Baseline (pre-treatment): Acquire high-res B-scan and/or 3D volume (document initial state: varnish 100 μm, paint layers intact, no damage visible; save 'Baseline_PreTreatment_Date.tif'). During treatment, periodic scans: Pause treatment every 5-10 min (conservator stops, waits 10-20 s for solvent evaporation, settling). Re-scan same location (critical: return exact position via fiducial markers, stage coordinates, or sample features; ±50 μm tolerance acceptable, <10 μm ideal but difficult without motorized stage high precision). Acquire B-scan (1-2 s, standard parameters: 1500 A-scans, 5 avg), save timestamped ('DuringTreatment_10min_Date.tif', 'DuringTreatment_20min_Date.tif', etc.). Quick measurement: Varnish thickness (software line tool, distance top to varnish-paint interface; e.g., t=0: 100 μm, t=10 min: 75 μm, t=20 min: 50 μm; removal rate ~2.5 μm/min, consistent, good). Resume treatment. Post-treatment (final): After complete removal or target reached, final high-res scan + 3D volume if initial included (document end state: varnish 0 μm removed completely, or new varnish 30 μm applied, paint surface unchanged vs. baseline, no damage).",
          "duration": "Minutes to hours (depending on treatment duration)",
          "criticalParameters": ["Non-interference (OCT beam low power, does not affect treatment)", "Registration (same location each scan; fiducial marks, stage positioning)", "Safety (if treatment involves solvents, heat, lasers: ensure OCT optics protected)"]
        },
        {
          "stepNumber": 6,
          "title": "Data Quality Control and Session Documentation",
          "description": "Immediate (before leaving instrument): Verify all scans saved: Check file directory (count files: expect 20 B-scans + 5 volumes = 25 files; verify all present, sizes reasonable: B-scans 0.5-5 MB, volumes 50-500 MB). Backup: Copy to external drive, cloud (redundant, prevent loss; 1-50 GB typical session, 5-30 min transfer USB 3.0). Quick visualization: Open 5-10 scans randomly (verify readable, not corrupted, display correctly). Thumbnail generation (optional, helpful): Export quick JPEG previews (B-scan images, 1024×768 pixels, compressed; create contact sheet, overview session at-a-glance). Lab notebook / session log: Object ID: Name, accession number, date. Imaging parameters: Wavelength (800 nm, 1300 nm?), axial resolution (5 μm, 10 μm measured calibration), lateral resolution (15 μm spec), power (10 mW sample arm), refractive index assumed (n = 1.5). ROIs: List (ROI #1: upper left sky, coordinates X=50mm Y=120mm from corner; varnish thick, baseline. ROI #2: face detail, X=150 Y=200; thin varnish, damage suspected. Etc.), reasons (why each: research question, treatment planning, condition documentation). Scan inventory: Table (ROI, scan type [B-scan / 3D volume], filename, notes [good quality / motion artifact / surface saturated]). Observations: Qualitative (varnish appears uniform ROI 1, heterogeneous ROI 2; penetration excellent ROI 1 1.2 mm, poor ROI 5 <300 μm material opaque; layers visible ROI 1-4, count 2-4 layers depending on location). Issues: Problems encountered (sample moved during 3D scan ROI 3, re-acquired; surface dirty ROI 7, reduced penetration, cleaned gently compressed air, improved; detector saturated initially, reduced power 15 mW → 8 mW, resolved). Next steps: Plan (analyze thickness maps ROI 1-10, segment layers; correlate with XRF data acquired yesterday; prepare varnish removal treatment plan based OCT thickness measurements; return next week for treatment monitoring scans). Post-session (within 1-3 days): Detailed QC: Review all scans systematically (ImageJ, vendor software; check artifacts: speckle tolerable, motion artifacts severe? Note, decide re-scan if critical measurement, or accept document limitation). Preliminary measurements: Batch process (if software supports: auto-detect varnish layer, measure thickness all B-scans; or manual: measure 5-10 B-scans, statistics), generate summary (mean varnish thickness 85 ± 25 μm across 15 ROIs; penetration range 0.3-1.5 mm; layer count mode 3 layers typical). Identify re-scan needs: If any scans inadequate (corrupted, motion, insufficient penetration, wrong location), schedule re-scan (contact conservator, arrange return, soon as possible while setup fresh memory). Metadata documentation: Embed (TIFF EXIF tags: add scan parameters, notes; or separate README.txt in folder: object, date, parameters, ROI descriptions, calibration data).",
          "duration": "30-60 minutes end of session, 1-3 days post-session",
          "criticalParameters": ["All scans verified and backed up", "Session log complete with all parameters", "Preliminary measurements documented", "Re-scan needs identified if any"]
        }
      ],
      "specializedProtocols": {
        "underdrawingDetection": "Challenge: Carbon black, graphite underdrawing beneath paint (<500 μm depth typical, deeper difficult); must distinguish from pigment, cracks. Optimized parameters: Wavelength: 800 nm preferred (carbon absorbs strongly all NIR, but 800 nm slightly less scatter paint than 1300 nm, better resolution). High resolution: 3-5 μm axial (ultra-high-res if available), 5-10 μm lateral (resolve drawing lines 20-100 μm width). Sensitive detection: Increase averaging (20 frames), optimize power (maximum tolerable without damaging paint, ~10-15 mW). Procedure: IRR correlation (if available): Acquire IRR image first (identifies underdrawing locations, extent; plan OCT scans strategic locations: lines, hatching, intersections). OCT B-scans orthogonal to drawing lines: If IRR shows line orientation (e.g., vertical hatching), scan B-scans perpendicular (horizontal X-scan); cross-sections through lines reveal depth, thickness. Identify underdrawing in OCT: Appears as dark attenuation region beneath paint (reduced intensity, shadowing beneath due to absorption; vs. crack: sharp discontinuity, air gap bright edges refractive index change; vs. opaque pigment layer: gradual intensity decrease, uniform). Measure: Depth below surface (z distance surface to underdrawing top; e.g., 180 μm paint above drawing), thickness (if resolvable: 5-20 μm thick lines; or just note presence), lateral extent (if 3D volume: map x-y distribution, correlate IRR). Validation: Compare IRR (underdrawing visible IRR should correspond OCT attenuation; if not, re-interpret: OCT signal may be pigment, ground, not drawing; or drawing too deep >500 μm, beyond OCT penetration). Limitations: Shallow only (<500 μm; if underdrawing 1 mm beneath, undetectable OCT; IRR penetrates deeper 1-2 mm, complementary). Carbon-based only (if underdrawing metalpoint, white chalk, not absorbing NIR: invisible OCT; may appear as bright scatter if white, but ambiguous vs. ground layer).",
        "glazeLayerCharacterization": "Challenge: Glazes very thin (5-50 μm), transparent, low contrast; require ultra-high resolution, careful calibration. System requirements: UHR-OCT: 1-3 μm axial resolution (femtosecond laser Δλ = 100-300 nm; standard 5-10 μm OCT insufficient resolve <20 μm glazes). High NA objective: 0.2-0.3 NA (5-10 μm lateral resolution, matches axial; vs. standard 0.1 NA, 15-20 μm lateral). Procedure: Identify glaze regions: Visual inspection (dark, saturated colors: translucent glaze over opaque paint; light scattering different than thick paint). Optimize contrast: Adjust display (histogram equalization, CLAHE adaptive contrast; thin glaze weak signal, enhance). Acquire high-res B-scan: 3000-4000 A-scans (0.5-1 μm step), 20 frames averaging (reduce speckle, critical thin layers), slow scan (20-60 s). Measure glaze thickness: Manual (identify top interface: surface, bottom interface: glaze-paint; difficult if glaze very thin <10 μm, interfaces overlap, measure FWHM peak; or fit Gaussian, extract separation), software (edge detection, but thin layers often defeated by speckle, manual more reliable). Validate: Cross-section if available (SEM, optical microscopy; measure glaze thickness cross-section, compare OCT; should agree ±2-5 μm if calibration correct, n accurate). Refractive index critical: Glazes (oil, resin media; n = 1.45-1.55 depending on pigment loading, binder). Software assumes n (if set n = 1.5 but actual 1.48: 10 μm glaze displayed as 10 × 1.48/1.5 = 9.9 μm, error 1%; acceptable). If precision <1 μm needed (research publication, authentication critical): measure n independently (ellipsometry, Abbe refractometer on glaze sample if removable, or assume literature values ±0.02, uncertainty ±1-2 μm thickness for 50 μm glaze).",
        "crackDepthMapping": "Objective: Quantify crack depth (shallow <50 μm surface craquelure vs. deep >200 μm structural), map 3D extent (isolated vs. interconnected network). Procedure: Visual pre-survey: Photograph cracks (raking light enhances, visible photography, note locations, orientations). 3D volume acquisition: Scan area encompassing crack network (5×5 mm to 10×10 mm; resolution: 2 μm lateral, 5 μm axial; 1500×300 A-scans typical, 1-3 min). Volume processing: Load 3D data: Software or ImageJ. Crack identification: Threshold (cracks appear dark, low intensity; threshold < 30% mean intensity → binary mask, cracks white, material black; morphological operations: close small holes, remove noise). Depth measurement: For each crack, measure maximum depth (z-position where crack signal disappears, or reaches bottom surface; e.g., Crack #1 depth 120 μm, Crack #2 depth 85 μm, Crack #3 depth 250 μm → prioritize #3 consolidation, deepest, risk propagation). 3D connectivity analysis: Volume rendering (cracks in red, material semi-transparent gray; rotate, zoom, assess: isolated cracks vs. connected network; if connected, measure network volume, surface area, quantify damage extent). Statistical summary: Crack inventory (# cracks detected, mean depth, std dev, max depth, depth distribution histogram; e.g., 50 cracks, mean 85 μm, std 40 μm, max 250 μm, 80% <100 μm surface craquelure, 20% >100 μm concern). Prioritize treatment: Deep cracks (>200 μm; consolidant injection, fill), moderate (100-200 μm; monitor, preventive), shallow (<100 μm; cosmetic, low priority unless active propagation). Export: 3D renderings (PNG, video AVI flythrough; shows conservators, stakeholders visual damage extent, less technical than B-scans, intuitive). Depth maps (C-scan colormap: crack depth vs. x-y position; red deep, blue shallow, black no crack; 2D easy interpret, quantitative)."
      }
    },
    "operatingParameters": [
      {"parameter": "Wavelength (center)", "typicalValue": "800-930 nm (most common)", "range": "700-1550 nm (available systems)", "notes": "800 nm: Si detector, cheapest, good resolution Δλ = 50-100 nm → 5-10 μm axial; penetration 0.5-1.5 mm typical heritage. 1050 nm: emerging, deeper penetration water, organics absorption window. 1300-1550 nm: deepest, but worse resolution (Δλ = 50-100 nm → 8-15 μm axial), expensive InGaAs detector."},
      {"parameter": "Bandwidth (Δλ)", "typicalValue": "30-100 nm (standard)", "range": "20-300 nm (ultra-high-res research)", "notes": "Determines axial resolution: broader = better (Δz ∝ λ²/Δλ). 50 nm typical → 5-7 μm axial. 100-200 nm → 1-3 μm (femtosecond laser, research). Narrower 20-30 nm → 10-15 μm (swept-source, longer wavelength)."},
      {"parameter": "Axial resolution (Δz)", "typicalValue": "5-10 μm in sample", "range": "1-15 μm", "notes": "Coherence-limited, better than lateral. 5 μm adequate distinguish paint layers 20-50 μm thick, varnish. UHR 1-3 μm resolves thin glazes 5-15 μm, research. Measured in air 3-7 μm, divide by n ≈ 1.5 sample → 5-10 μm geometric."},
      {"parameter": "Lateral resolution (Δx)", "typicalValue": "10-20 μm", "range": "5-50 μm", "notes": "Diffraction-limited by objective NA, focal length. 10-15 μm typical (adequate brushstrokes 100-500 μm, pigment grains 20-50 μm, layers). High-NA 5-10 μm (short WD 10-20 mm, less practical rough surfaces). Low-res 20-50 μm (wide FOV, fast surveys)."},
      {"parameter": "Imaging depth (z_max)", "typicalValue": "1-3 mm (air), 0.7-2 mm (sample n = 1.5)", "range": "0.5-5 mm", "notes": "SD-OCT: spectrometer-limited (spectral sampling, z_max = λ²/(4nδλ); finer δλ → deeper, but costlier spectrometer, slower camera). Practical: scattering limits useful depth 0.5-2 mm even if z_max = 3 mm (signal decays, S/N poor beyond scattering length)."},
      {"parameter": "Penetration depth (sample-dependent)", "typicalValue": "0.5-2 mm (heritage materials)", "range": "0.05-3 mm", "notes": "Varnish 1-3 mm, oil paint 0.2-1 mm, tempera 0.3-0.7 mm, paper 0.5-1.5 mm, wood 0.5-2 mm, metals <0.01 mm (opaque). Deeper if light colors (white, yellow), shallower if dark (umber, black). Wavelength: 1300 nm deeper than 800 nm."},
      {"parameter": "A-scan rate", "typicalValue": "20-100 kHz (SD-OCT)", "range": "1 kHz - 400 kHz", "notes": "SD-OCT: 20-100 kHz (camera-limited, 2048-pixel line-scan camera 20-100 kHz frame rate). SS-OCT: 100-400 kHz (laser sweep speed, faster but expensive). TD-OCT: 1-10 kHz (obsolete, scanning mirror slow). Faster → real-time B-scans, 3D volumes seconds vs. minutes."},
      {"parameter": "B-scan frame rate (2D cross-section)", "typicalValue": "10-100 fps", "range": "1-200 fps", "notes": "Depends on A-scan rate / # A-scans per B-scan. 50 kHz / 1000 A-scans = 50 fps (real-time, sufficient monitor treatments). 100 kHz / 2000 = 50 fps. Slower if averaging: 50 fps × 10 averages = 5 fps effective. Faster if fewer A-scans (coarser lateral sampling)."},
      {"parameter": "Field-of-view (FOV, lateral)", "typicalValue": "2-10 mm × 2-10 mm", "range": "0.5-20 mm", "notes": "Adjustable via galvanometer amplitude, software settings. Small FOV 2×2 mm: high sampling density if same # pixels, detailed. Large FOV 10-20 mm: overview, but coarser per-pixel, or longer acquisition if maintain density. Mosaic stitching: scan multiple FOVs, combine → large area cm-dm scale."},
      {"parameter": "Laser power (sample arm)", "typicalValue": "1-15 mW", "range": "0.5-30 mW", "notes": "Low power, safe heritage (spot size 10-20 μm, 1-15 mW → 0.05-1 W/cm², below damage threshold organics typically >10² W/cm² CW). Higher power → better S/N, deeper penetration (but diminishing returns, scattering limits), risk photobleaching if extreme. Lower power: sensitive samples (dyes, light-sensitive pigments), adequate if high-efficiency detector."},
      {"parameter": "Refractive index (assumed, correction)", "typicalValue": "n = 1.5 (typical)", "range": "1.3-1.7 (heritage materials)", "notes": "OCT measures optical path length OPL = n × geometric thickness. Software assumes n (default 1.0 air, or 1.3-1.4 tissue; heritage: set to 1.5 typical varnish/paint, or material-specific if known). Affects displayed depth scale: if n = 1.5 actual, software set n = 1.0, thickness displayed 1.5× too large; correct via n_actual/n_software factor."},
      {"parameter": "Scan pattern", "typicalValue": "Raster (x-y grid)", "range": "Raster, radial, circular, arbitrary", "notes": "Raster: most common (B-scans along x, stepped y, builds 3D volumes rectangular). Radial: spokes from center (circular damage, paintings circular brushstrokes, mandala). Arbitrary: user-defined ROI, sparse sampling (fast preview, targeted). Software-selectable."}
    ],
    "calibration": {
      "standards": "**Axial (depth) calibration:** Mirror (100% reflector, back surface glass mirror or metallic; measures zero-delay position, PSF point spread function axial width verifies resolution). Known thickness samples (glass coverslip 150 ± 5 μm, microscope slide 1.0 mm ± 0.01 mm; measure OCT, compare specification; if mismatch >5%, adjust refractive index setting or instrument calibration). NIST traceable thickness standards (specialty, not common OCT; some labs use calibrated step-height samples, AFM-measured; precision ±0.1-1 μm). **Lateral (x-y) calibration:** Resolution targets (USAF 1951, NBS 1963A, or custom grids; chrome on glass, 10-100 μm features; image OCT C-scan, measure feature size pixels, compare known → μm/pixel. Or Siemens star: radial pattern, resolution limit where spokes merge). Stage micrometer (if motorized stage, 1 mm scale, 10 μm divisions; move stage known distance, measure OCT image shift pixels, verify μm/pixel x-y). **Refractive index (n):** If quantitative thickness needed, measure n sample material independently (Abbe refractometer, ellipsometry, or assume literature values: varnish 1.48-1.52, oil paint 1.4-1.6, tempera 1.45-1.55; uncertainty ±0.05 typical → thickness uncertainty ~3-5%). Or measure via OCT if known geometric thickness (measure optical thickness OCT, divide by geometric → n; requires destructive cross-section measurement, not usually done). **Sensitivity (system performance):** Neutral density filters, mirror (measure SNR vs. attenuation; characterize sensitivity roll-off with depth; compare to specification, verify >90 dB typical good systems).",
      "frequency": "**Daily or per-session:** Quick check (mirror, zero-delay position correct; or scan known sample: glass slide, verify thickness ±5-10%, adequate). **Monthly:** Full calibration (axial + lateral, resolution targets, document, update calibration file if drift detected >5%). **Post-maintenance:** After cleaning optics, realigning, changing source, detector (recalibrate fully, verify performance restored). **Annually:** Compare to traceable standards (if available, NIST or inter-lab comparison; some research groups, not routine conservation; ensure long-term accuracy, publications).",
      "procedure": "**Axial calibration (mirror):** Place mirror at sample position, scan (A-scan or B-scan), measure peak position (z = 0 if reference arm matched), FWHM (should be ~axial resolution; e.g., 5 μm system → 5-6 μm FWHM; if 10 μm, resolution degraded, investigate: dispersion mismatch, focus, bandwidth reduced). Adjust reference arm if zero-delay offset. **Axial calibration (known thickness):** Place glass coverslip (150 μm nominal), scan (B-scan cross-section, see top and bottom surfaces as two bright lines), measure separation pixels, multiply by μm/pixel_depth (from software settings), compare to 150 μm. If 165 μm measured: likely n = 1.1 assumed software but glass n = 1.52 actual → correct: 165 × (1.1/1.52) ≈ 120 μm air-equivalent, but geometric = 150 μm, so OPL = 150 × 1.52 = 228 μm, displayed as 165 μm if n = 1.1 → adjust software n = 1.52, re-measure, should read ~150 μm. **Lateral calibration:** Image USAF target (Group 7, Element 6 = 2.19 μm lines, but beyond OCT resolution; use Group 5, Element 1 = 8.77 μm lines, resolvable 10 μm system), or custom grid 50-100 μm pitch. Measure line spacing pixels (e.g., 50 μm grid, 5 pixels separation → 10 μm/pixel; if specification 8 μm/pixel, discrepancy 25%, adjust galvo calibration voltage/angle factors in software, or note in report 'effective lateral resolution 10 μm, not 8 μm due to galvo nonlinearity')."
    },
    "qualityControl": {
      "checkpoints": [
        "Axial resolution verified (mirror PSF FWHM ≈ specification ±10%; if worse, dispersion mismatch, focus degraded, investigate)",
        "Lateral resolution adequate (features >2× resolution resolvable; if not, defocus, optics dirty, misaligned)",
        "Penetration depth sufficient (signal visible >500 μm in varnish, >200 μm in paint; if less, sample too opaque, or power reduced, detector issue)",
        "No artifacts severe (speckle tolerable, granular; mirror artifacts suppressed; motion artifacts minimal; if present, note, mitigate averaging or accept document limitations)",
        "Sensitivity good (SNR >20 dB layers of interest, >30 dB surface; if <10 dB, reference arm misaligned, detector connection, sample arm blocked)",
        "Calibration current (thickness measurements ±5-10% known standards; if outside, recalibrate or document uncertainty)"
      ],
      "commonArtifacts": [
        {"artifact": "Speckle noise (granular pattern throughout image, obscures fine detail)", "cause": "Coherent imaging (interference from multiple scatterers, random phase, constructive/destructive interference → speckle; inherent OCT, laser speckle analog). Not removable entirely (fundamental), but reducible.", "mitigation": "Averaging (5-20 B-scans same location, pixel-wise average → speckle uncorrelated frame-to-frame, averaging reduces σ by √N; 10 frames → 3× reduction). Compounding (slightly shift beam or sample between frames, sub-resolution offsets, decorrelate speckle, average → spatial compounding). Adaptive filtering post-processing (Lee, Frost, Kuan filters: local statistics, preserve edges, smooth speckle regions; or wavelet denoising, bilateral filter). Frequency compounding (if multiple wavelengths available, average; spectral decorrelation reduces speckle, but requires multi-wavelength source, rare). Accept (report 'granular texture speckle noise, inherent OCT, does not obscure layer boundaries')."},
        {"artifact": "Mirror image / complex conjugate ambiguity (sample appears duplicated, symmetric about zero-delay)", "cause": "Fourier transform ambiguity (real-valued spectrum → complex signal depth-domain has symmetric components ±z; conventional processing discards half, but if sample extends both sides zero-delay, overlap, ghost). Or reference arm path length wrong (zero-delay not at sample surface, sample in negative z → appears positive z mirrored).", "mitigation": "Adjust reference arm (shift zero-delay to sample surface, ensure sample entirely in positive z-range, no negative z; software may allow shift post-processing). Full-range / complex OCT (phase-shifting reference arm, or digital frequency shifting, resolves ambiguity, suppresses mirror image; advanced, requires hardware or software modification, not standard all systems). Crop image (if mirror artifact in uninteresting region: deep air beyond sample, crop display, ignore). Document (if unavoidable, note 'artifact at z = -500 μm, ignore, sample only positive z')."},
        {"artifact": "Saturation / clipping (bright regions appear flat-topped white, loss of detail)", "cause": "Detector saturated (spectrometer camera or photodiode output voltage exceeds ADC range, clipping). Typically surface strong reflection: air/varnish interface, metallic inclusions, or reference arm too bright (imbalanced).", "mitigation": "Reduce power (sample arm attenuator, or source power down; reduce 10-50%, re-scan). Reduce exposure time (camera integration time shorter; only if camera-based SD-OCT, not swept-source). Attenuate reference arm (if imbalanced, increase sample arm signal relative, but may reduce S/N deeper layers; balance trade-off). Post-processing (if saturation localized surface only, subsurface OK: accept, or mask out saturated pixels, interpolate from adjacent depths if needed for visualization). Prevention: tune power initial setup (optimize: bright enough good S/N deep, not so bright surface saturates)."},
        {"artifact": "Motion artifacts (horizontal streaks, discontinuities, misalignment between B-scans in 3D volume)", "cause": "Sample or scanner moved during acquisition (patient motion in biomedical; in heritage: sample unstable, vibration building, galvo jitter, stage drift during long 3D scan minutes). Even μm motion → visible (lateral resolution 10 μm, so 5-10 μm shift noticeable).", "mitigation": "Secure sample (weights, tape, clamps; ensure no micro-movements, AC drafts, floor vibration). Isolate vibration (turn off nearby equipment: HVAC, ultrasonic cleaners, centrifuges; or passive isolation: rubber pads under table). Faster scans (reduce # A-scans, B-scans if motion inevitable; faster → less time for motion accumulate; trade-off resolution). Software registration (post-processing: track features between B-scans, auto-align, correct rigid shifts; some OCT software includes motion correction algorithms: cross-correlation, feature-tracking; or manual in ImageJ: StackReg plugin). Accept + document ('minor motion artifacts, vertical alignment uncertain ±10 μm, does not affect layer identification')."},
        {"artifact": "Vignetting / field-dependent intensity drop (edges of FOV darker than center)", "cause": "Galvanometer angle extreme (off-axis aberrations, beam clip at apertures; or power varies with scan angle: beam profile Gaussian, edges lower intensity). Or objective lens vignetting (large FOV, marginal rays blocked).", "mitigation": "Reduce FOV (scan smaller area, stay within good optical range galvos, objective; or multiple smaller FOVs, stitch, rather than single large). Flat-field correction (capture reference scan uniform scatter sample, or model, apply correction normalization; divide each image by flat-field reference → uniform intensity across FOV; standard some biomedical OCT, less common heritage, but doable post-processing). Adjust galvo offset (center scan around optical axis, ensure symmetric, minimize vignetting). Accept (if mild <20% drop, tolerable, layer boundaries still visible; note in report)."},
        {"artifact": "Dispersion mismatch (axial resolution degraded, peaks broadened, asymmetric tails)", "cause": "Reference arm and sample arm optical path dispersion different (glass thickness, fiber length, wavelength-dependent refractive index; broadband source, different wavelengths travel different speeds, phase mismatch, broaden interference peak). Common if sample arm has objective lens, reference arm mirror only (or vice versa).", "mitigation": "Dispersion compensation (add glass blocks, prisms, or fiber length in reference arm to match sample arm; manual adjustment iterative, or software: numerical dispersion compensation, apply phase correction post-processing; most OCT systems have dispersion compensation built-in, tuned at factory, but may need re-optimization if optics changed). Verify (measure PSF width mirror, should be ~axial resolution; if 2-3× broader, dispersion significant, compensate). If uncorrectable hardware (software compensation: standard algorithms: Wojtkowski et al. 2004, phase vs. depth polynomial fit, apply; effective, but adds processing time)."}
      ],
      "troubleshooting": [
        {"problem": "No signal, image blank (flat noise, no sample surface visible)", "solution": "Check sample arm (beam blocked? Fiber disconnected, shutter closed, sample arm power zero). Check reference arm (mirror position, if movable: may be far from zero-delay, no interference; adjust reference arm mirror toward sample path length match). Check detector (spectrometer camera powered, connected, acquiring; or photodetector if SS-OCT; cables, software recognizes device). Check software settings (correct camera selected, exposure time not zero, averaging not set to zero frames, display contrast not inverted or blank). Test with mirror at sample position (should see strong peak; if yes, sample issue: opaque, no backscatter; if no, system issue, troubleshoot optics, electronics). Call support if persistent (hardware failure: detector, source, fiber coupler broken; needs repair, replacement)."},
        {"problem": "Poor penetration, signal fades quickly <100 μm (expected >500 μm varnish, >200 μm paint)", "solution": "Check material (is sample unusually opaque? Carbon black, iron oxide, thick, umber paint: low penetration expected; or metal, no penetration; confirm expectations realistic). Increase power (sample arm attenuator, if present, reduce attenuation; or source power up if adjustable; but avoid saturation surface). Optimize wavelength (if multi-wavelength system: 1300 nm penetrates deeper than 800 nm; switch wavelength, re-scan). Check focus (if defocused, signal weak; adjust Z-axis, maximize surface intensity). Clean optics (objective lens dirty: fingerprints, dust, reduces transmission, signal; clean lens with isopropanol, lens tissue). Averaging (speckle noise may bury weak deep signal; increase averaging 5 → 20 frames, improves S/N deep layers, may reveal structure previously hidden noise). Accept limitation (some materials inherently opaque OCT wavelengths; document 'penetration limited 150 μm, material highly scattering/absorbing, complementary techniques X-ray, ultrasound if deeper structure needed')."},
        {"problem": "Resolution worse than specification (layers <50 μm appear blurred, not distinct)", "solution": "Check dispersion (PSF width mirror: if >2× specification, dispersion mismatch; compensate via hardware glass, or software correction). Check focus (sample at focal plane? Move Z-axis, optimize; if sample rough, some regions out-of-focus, inherent; use long DOF objective, accept). Check source (bandwidth: if SLD aging, spectrum narrows, resolution degrades; measure spectrum, compare to new; if <50% specified bandwidth, replace SLD). Verify settings (software processing: ensure Fourier transform window correct, zero-padding not excessive, dispersion compensation enabled if available). Calibration (known thickness sample: measure, if thickness blurred, not sharp transitions, resolution limited; confirm system specification, may need service, alignment, if severe degradation vs. spec). Inherent limitation (if <20 μm layers, even 5 μm resolution may not fully resolve; ultra-high-res system needed 1-3 μm, or accept, report 'layers 10-15 μm thickness estimated, near resolution limit')."},
        {"problem": "Severe motion artifacts, streaks (sample stable, but image corrupted)", "solution": "Check galvanometers (if jitter, vibration in galvo: mechanical issue, bearing worn, drive electronics noisy; test: scan without sample, view galvo mirrors with camera or eye, should move smoothly; if jerky, service needed). Floor vibration (building HVAC, traffic, nearby equipment; place accelerometer, smartphone accelerometer app, measure vibration; if >10 μm during scan, significant; passive isolation: foam, rubber pads, or scan off-hours when quiet). Software acquisition (if step-scan mode: settling time between A-scans too short, galvo hasn't settled, position error; increase settling time in software, slower but accurate; or use fly-scan mode, continuous motion, no settling issues but requires hardware support). Cables (if scan head connected via long cables, flex cables, EMI noise: electrical interference on galvo signals; shorten cables, use shielded, ground properly). Disable motion correction (if software has motion correction enabled, but buggy, may introduce artifacts rather than fix; disable, re-process raw data, see if improves)."},
        {"problem": "Layer boundaries not detected (automatic segmentation fails, manual tracing tedious)", "solution": "Adjust contrast (display settings: log scale, brightness, contrast; enhance layer visibility; if layers present but low contrast, difficult segment). Preprocessing (denoise: speckle reduction filters, median filter, improve layer edge clarity, re-segment). Software algorithms (try different: edge detection methods: Sobel, Canny, gradient; graph-cut, active contours; some OCT software has multiple algorithms, test which works best for your data; or external software: ImageJ, MATLAB, Python skimage custom scripts). Manual segmentation (if automatic fails: tedious but accurate; draw boundaries manually, measure thickness; time-consuming but definitive; consider if critical measurements, few samples). Improve acquisition (if layer boundaries inherently weak signal: increase averaging, reduce noise; or increase lateral sampling, finer resolution may improve boundary sharpness; or adjust focus, optimize signal). Report limitation ('layer boundaries low contrast, segmentation uncertain ±10-20 μm, measurements approximate')."}
      ]
    }
  },
  "multimodal": {
    "complementaryTechniques": [
      {
        "techniqueId": "macro-xrf-mapping",
        "rationale": "OCT provides structural information (layer thickness, interfaces, depth 0.5-2 mm), while Macro-XRF provides elemental maps (Pb, Hg, Cu, Fe, Ca distribution mm-cm scale). Combined: OCT identifies 'where layers are' (thickness, count), XRF identifies 'what elements' (pigments, materials). Workflow: Macro-XRF survey entire painting (4-8 hours, identify pigment zones), OCT targeted ROIs based XRF (2-4 hours, measure layer structure), correlate (elemental + structural = comprehensive material characterization). Example: XRF shows Cu-rich blue region, OCT measures 70 μm azurite layer thickness, confirms single layer vs. multiple, guides conservation (varnish removal safe, 50 μm above paint)."
      },
      {
        "techniqueId": "raman-spectroscopy",
        "rationale": "OCT structural (layer thickness, count, interfaces) + Raman molecular ID (pigments, binders, varnishes; vibrational spectra, compound-specific). Strategy: OCT surveys, identifies layers, selects points → Raman IDs materials targeted, efficient. Workflow: OCT B-scan identifies varnish 90 μm, paint 120 μm; Raman surface confirms dammar resin varnish, azurite paint; combined: complete characterization structure + chemistry. Time: 1.5-2 hours (OCT 30-60 min, Raman 20-40 min, integration 10-20 min). Value: Definitive material ID (OCT alone: '90 μm layer' structural, ambiguous; Raman alone: 'dammar, azurite' but no thickness, distribution; combined: complete characterization structure + chemistry)."
      },
      {
        "techniqueId": "irr-infrared-reflectography",
        "rationale": "IRR underdrawing detection (carbon-based drawing materials absorb visible, transparent NIR 1000-1700 nm, camera detects; penetrates paint layers 100-500 μm if not too opaque, reveals underdrawing). OCT structural (also NIR 800-1300 nm, but interferometric depth-resolved, 1-10 μm resolution axial vs. IRR projection image). Complementary: IRR wide-field (entire painting, cm-dm scale, fast minutes), identifies underdrawing present, location, style. OCT targeted (selected ROI where IRR saw underdrawing, high-res B-scan, measures depth underdrawing below surface, thickness drawing lines if sufficient contrast). Combined: IRR spatial extent + OCT depth information = 3D underdrawing characterization. Example: IRR shows lines, hatching; OCT confirms depth 200 μm below surface, drawing layer 5-10 μm thick (carbon black, graphite); informs conservation (if consolidating surface, underdrawing stable at depth, no risk; vs. if underdrawing surface, may be affected treatment, caution)."
      },
      {
        "techniqueId": "ultrasound-imaging",
        "rationale": "Ultrasound: deeper penetration (mm-cm scale, sound waves 1-50 MHz, penetrate canvas, panel, multiple paint layers; detects support structure, voids, delamination bulk). OCT: shallow high-resolution (0.5-2 mm penetration, 1-10 μm resolution; surface, varnish, top paint layers, fine detail). Complementary: ultrasound bulk structure (canvas weave, wood grain, ground layers, support damage; 50-200 μm resolution), OCT surface stratigraphy (varnish, paint layering, surface cracks 5-20 μm resolution). Sequential: ultrasound survey (identify delamination, voids bulk, support damage), OCT targeted (if delamination detected ultrasound, OCT images surface layers, measures extent near-surface 50-500 μm, correlate bulk + surface damage, plan consolidation strategy). Different physics (sound vs. light), different strengths, synergistic."
      },
      {
        "techniqueId": "sem-eds",
        "rationale": "SEM-EDS: cross-sections (embedded, polished; 0.1-1 μm spatial resolution, morphology pigment grains, layering; EDS elemental composition 0.1 wt% sensitivity). OCT: intact object, non-destructive, but interpretation ambiguous (layer bright OCT = which material?). Workflow: OCT survey (identify ROIs: interesting layer sequences, anomalies, damage; non-destructive, intact object, prioritize sampling). Micro-sample selected ROI (1-2 mm² chip, embed, polish), SEM-EDS characterize (correlate OCT layers to SEM: 'OCT z = 0-80 μm varnish layer corresponds SEM top 80 μm, resin + organic; OCT z = 80-130 μm paint corresponds SEM Cu-rich grains 5-20 μm, azurite morphology; OCT z = 130-250 μm paint = Pb-rich layer, lead white'). Validate OCT interpretation (cross-section ground truth, train eye, future OCT scans same object or similar materials, interpret with confidence). Minimize destructive (OCT reduces need multiple cross-sections; one validates, rest non-destructive OCT sufficient)."
      }
    ],
    "standardCombinations": [
      {
        "name": "OCT + Macro-XRF + Raman (Comprehensive Non-Destructive Painting Analysis)",
        "techniques": ["optical-coherence-tomography", "macro-xrf-mapping", "raman-spectroscopy"],
        "workflow": "1. Macro-XRF survey: Scan entire painting or large areas (10×10 cm to 50×100 cm, 0.5-2 mm step, 1-10 hours; generate elemental maps Pb, Hg, Cu, Fe, Ca; identify pigment distribution, pentimenti, composition). 2. Select ROIs: Based XRF (pigment-rich regions, transitions, anomalies; 5-20 locations typical). 3. OCT imaging: Selected ROIs (5×5 mm B-scans + 3D volumes if detail needed; 5-30 min per ROI, total 2-10 hours; measure varnish thickness, paint layer count, thickness, interfaces, damage). 4. Raman spectroscopy: Targeted points (surface varnish, paint if accessible, or based OCT layer positions if cross-section available; 10-50 spectra, 30-60 s each, total 0.5-2 hours; ID compounds: varnish dammar, paint azurite, lead white, etc.). 5. Correlate data: Overlay XRF elemental maps, OCT B-scans, Raman spectra (spatial registration via coordinates, fiducial marks, photographs; synthesize: 'ROI #3: XRF shows Cu + Pb, OCT layer 1 50 μm high scatter + layer 2 120 μm brighter, Raman confirms azurite + lead white → material ID definitive, stratigraphy understood'). 6. Report: Integrated (figures: side-by-side XRF map, OCT B-scan, Raman spectrum annotated; table: ROI, layers, materials, thickness; interpretation: technique, chronology, authenticity, condition). 7. Time: 1-2 days data acquisition (painting 50×50 cm: Macro-XRF 4-8 hr, OCT 2-4 hr, Raman 1-2 hr; setup, breaks, sample handling +50% time), 2-5 days processing, analysis (XRF data large GB-scale, OCT 1-10 GB, Raman 10-100 spectra, integrate, interpret, report).",
        "rationale": "Each technique essential: Macro-XRF fast, large-area, elemental (where elements, but not compounds, layers), OCT structural, high-res depth (layers, thickness, but not chemistry), Raman molecular, specific (compounds, but slow, small area, surface or accessible points). Combined: comprehensive, non-destructive, covers spatial scales (cm Macro-XRF, mm OCT, μm Raman), chemistry + structure + morphology. No single technique sufficient (XRF: Cu detected, but azurite vs. malachite vs. verdigris?; OCT: layer 50 μm, but which pigment?; Raman: azurite ID, but distribution? thickness?). Together: answer 'what, where, how much, how arranged' → complete material characterization, conservation, art history research, authentication.",
        "exampleApplication": "Baroque painting authentication (claimed 17th-century, suspect 19th-20th forgery). Macro-XRF (detects Ti distribution: titanium white TiO₂ invented 1920s, if present, anachronistic, forgery; none detected, passes). OCT (maps varnish 80-150 μm thick, uneven, consistent aged varnish; paint layers 2-3, thick 50-150 μm each, typical Baroque; no modern materials detected structurally, passes). Raman (varnish: natural resin dammar/mastic spectrum, not synthetic acrylic, consistent 17th-19th-century; paint: lead white 2PbCO₃·Pb(OH)₂, azurite, vermilion HgS, all historical pigments available 17th-century; no modern organics, synthetic pigments detected). Conclusion: All three techniques consistent historical materials, authentic 17th-century probable (vs. if Ti found XRF, or acrylic varnish Raman, or anomalous OCT layer sequence, suspect forgery). Comprehensive non-destructive analysis, high confidence, minimal risk object."
      },
      {
        "name": "OCT + IRR (Underdrawing Depth Profiling)",
        "techniques": ["optical-coherence-tomography", "irr-infrared-reflectography"],
        "workflow": "1. IRR imaging (1-2 hours): InGaAs camera (1000-1700 nm, sensitive carbon absorption), photograph entire painting 30×40 cm, 0.5 mm pixel resolution. Process: Histogram equalization, enhance contrast, underdrawing visible as dark lines (carbon absorbs NIR), paint layers translucent (lead white, azurite semi-transparent NIR, underdrawing shows through). Map: Annotate underdrawing features (contour lines face, hatching shadows, pentimenti). 2. Select OCT ROIs from IRR (10-20 locations): Criterion 1: Underdrawing line intersections (where lines cross, thicker carbon accumulation, stronger OCT signal, easier detect). Criterion 2: Underdrawing vs. no-underdrawing regions (compare depth profile: does drawing affect OCT signal? Thickness paint above drawing?). Criterion 3: Pentimenti (artist changes: IRR shows hidden feature, OCT can measure depth beneath, confirm paint layers covering, thickness). 3. OCT B-scans (2-3 hours, 15 ROIs × 10 min each): ROI 7 (face contour line, underdrawing present): B-scan perpendicular to line (cross-section through drawing). OCT: Varnish 50 μm, Paint 1 (flesh tone) 70 μm, Paint 2 (underpainting lead white) 80 μm, dark attenuation region 5-10 μm thick at z = 200 μm (interpreted underdrawing carbon layer, absorbs, shadows beneath), Ground 100+ μm below. Measure depth: 200 μm (varnish 50 + paint 1 70 + paint 2 80 = 200 μm, matches; drawing at interface paint 2 / ground, applied ground before paint, technique sequence confirmed). 4. Statistical analysis (1 hour): Underdrawing depth distribution: 15 ROIs, underdrawing detected 10/15 (66%, consistent IRR coverage), depth range 180-250 μm (mean 210 ± 25 μm; artist applied drawing on ground, varied slightly topography, brushstrokes ground preparation, or drawing technique pressure, thickness carbon varies). Drawing thickness: 5-15 μm (near OCT resolution limit 5 μm; thicker lines 10-15 μm visible, thin lines 5 μm borderline; ultra-high-res OCT 1-3 μm would improve, but standard system adequate detect presence, approximate thickness). 5. Art historical interpretation (1-2 hours discussion with curator, art historian): Technique: Underdrawing applied ground (before paint), 200 μm depth typical; artist prepared composition, sketch, then paint, deliberate, planned (vs. spontaneous direct painting no underdrawing, different technique); underdrawing charcoal or graphite (carbon-based, IRR + OCT consistent; vs. metalpoint, white chalk, would not show IRR, OCT different scatter). Pentimenti: ROI 12 (IRR shows nose originally drawn 5 mm left, final painted different position); OCT confirms paint layers above original nose drawing (70 + 80 μm paint, drawing 210 μm depth, covered; final nose area no drawing detected beneath, painted directly, artist changed mind, composition adjustment; creative process insight, attribution, authenticity evidence artist's hand, spontaneous changes vs. copyist rigidly follow model).",
        "rationale": "IRR spatial context (where drawing, extent, style) + OCT depth, thickness quantitative (3D localization drawing, technique sequence, validation IRR ambiguous signals).",
        "timeInvestment": "5-7 hours (IRR 1-2 hr, OCT 2-3 hr, analysis 1 hr, discussion 1-2 hr)"
      },
      {
        "name": "OCT + Ultrasound (Multi-Scale Delamination Detection)",
        "techniques": ["optical-coherence-tomography", "ultrasound-imaging"],
        "workflow": "1. Ultrasound survey (30-60 min): Handheld ultrasound probe (5-10 MHz, pulse-echo mode), gel coupling, scan bulge area + surrounding 10×10 cm. Identify: Delamination (air gap between ground and canvas, 0.5-2 mm depth; appears as bright reflector, loss of signal beneath due to air impedance mismatch). Measure: Extent lateral (delamination 3×5 cm area), depth (centered 1.5 mm below surface typical canvas + ground thickness). Limitation: Resolution coarse (50-200 μm axial, 1-2 mm lateral; cannot distinguish paint vs. ground, just 'something delaminated from canvas'). 2. OCT targeted imaging (30-60 min): Position over bulge center, periphery (5 locations: center, north, south, east, west edges of delamination). B-scans: Reveal detail (Varnish 60 μm intact, Paint layer 1 80 μm, Paint layer 2 100 μm, Ground 200 μm, then dark gap 50-500 μm air, then canvas reflection weak). Critical: Paint-ground interface intact (no delamination within paint layers, layers adhered each other), but ground-canvas interface failed (air gap 100-300 μm, varies spatially, correlates bulge topography). Measure: Delamination thickness (gap width 100 μm at edges, 300 μm center bulge highest; spatial map, 3D OCT volume if acquired shows topology). 3. Integrate ultrasound + OCT (30 min analysis): Depth assignment: Ultrasound detected delamination 1.5 mm depth (canvas support 0.5 mm + ground 0.2 mm + gap 0.3 mm + paint 0.5 mm ≈ 1.5 mm, consistent). OCT resolves gap precisely 100-300 μm, locates interface (ground-canvas not paint-ground, informs consolidation strategy: inject adhesive beneath ground, not between paint layers). Extent: Ultrasound lateral extent 3×5 cm (bulk survey, fast). OCT high-resolution spot checks (5 locations, confirms ultrasound, adds thickness detail, but slow, cannot scan entire 3×5 cm OCT 1 μm resolution, impractical; accept ultrasound extent, OCT detail targeted). 4. Consolidation plan: Based OCT (gap 100-300 μm, inject acrylic adhesive BEVA 371 via syringe, volume calculate: 3×5 cm × 0.02 cm gap average = 3 mL adhesive needed; depth target: OCT guides injection 1.5 mm, beneath ground, verify via OCT post-injection adhesive filled gap, reflector changed bright air to moderate adhesive refractive index closer ground, confirms treatment success). 5. Treatment monitoring (Day 2, 1-2 hours): Inject adhesive (conservator, syringe, inject periphery delamination, allow flow center via capillary action, gentle pressure flatten bulge). OCT monitor (scan same 5 locations, before/after injection; before: gap 300 μm, after: gap reduced 50 μm, adhesive filled, signal changed, success; if gap still large, re-inject, monitor until <100 μm residual gap acceptable, pressure flattens). Ultrasound re-scan (verify adhesive penetrated entire 3×5 cm area, not just OCT spot-check locations; ultrasound fast, wide-field, confirms comprehensive treatment, no untreated pockets delamination remain).",
        "rationale": "Multi-scale (ultrasound fast extent, OCT precise depth + monitoring), guided treatment (injection depth, volume, real-time feedback success), validated (both techniques confirm, redundant, confidence high).",
        "timeInvestment": "2-3 hours (ultrasound 30-60 min, OCT 30-60 min, analysis 30 min, treatment + monitoring 1-2 hr)"
      }
    ],
    "decisionTree": {
      "question1": "What is primary research goal? Material identification (pigments, binders, varnish): OCT + Raman + XRF (structure + molecular + elemental, definitive ID). Layer stratigraphy (thickness, sequence): OCT + cross-section (SEM-EDS, optical microscopy; validate OCT, then extend non-destructive). Treatment planning (varnish removal, consolidation): OCT + FTIR (structure + binder ID, solvent compatibility). Damage assessment (cracks, delamination, structural): OCT + ultrasound (surface + bulk, multi-scale). Underdrawing, pentimenti (hidden features): OCT + IRR (depth + spatial, carbon detection). Comprehensive (publication, authentication): OCT + XRF + Raman (± FTIR, ± SEM-EDS cross-section; gold standard multi-modal suite).",
      "question2": "What is sample access? Intact only (no sampling): OCT + XRF + Raman surface (non-destructive trio, maximum info no sampling). Cross-section available (destructive ok, limited): OCT intact + SEM-EDS cross-section (validate, then extend OCT non-destructive rest of object). Surface accessible (paint exposed, or small cleaning spot): OCT + Raman + FTIR surface (contact ok, targeted, comprehensive).",
      "question3": "What is time / budget constraint? Limited (1 day, <$2K): OCT + XRF (fast, wide-field XRF survey 4-8 hr, OCT targeted 2-4 hr based XRF, cover most questions single session, cost OCT session $500-2K if external service, XRF portable rental $500-1K/day). Moderate (2-3 days, <$5K): OCT + XRF + Raman (comprehensive, 2-3 days acquisition + 1-2 days analysis, cost $3-5K external services, or in-house if equipment available). Extensive (weeks, research publication): OCT + XRF + Raman + FTIR + SEM-EDS cross-section + ultrasound + IRR (full suite, research-grade, weeks data acquisition, months analysis, publication preparation).",
      "recommendedMinimum": "OCT + portable XRF (structural + elemental, 80% questions answered, non-destructive, practical budget/time, establish baseline most objects).",
      "recommendedResearchStandard": "OCT + Macro-XRF + Raman + SEM-EDS cross-section (structure + elemental spatial + molecular + morphology elemental validation, comprehensive, publication-quality, justifies synchrotron XRF if trace elements critical, but OCT + Macro-XRF sufficient most heritage applications)."
    }
  },
  "metadata": {
    "tags": ["OCT", "optical coherence tomography", "interferometry", "depth-resolved imaging", "varnish", "paint layers", "stratigraphy", "non-invasive", "conservation", "treatment monitoring", "subsurface damage", "NIR imaging"],
    "relatedTechniqueIds": ["irr-infrared-reflectography", "ultrasound-imaging", "confocal-microscopy", "macro-xrf-mapping", "raman-spectroscopy", "thz-imaging"],
    "lastUpdated": "2025-01-16",
    "version": "1.0",
    "contributors": ["Daniel Wilcox"]
  }
}

