{
  "id": "raman-spectroscopy",
  "name": "Raman Spectroscopy (Visible Excitation)",
  "acronym": "Raman",
  "category": "Molecular Spectroscopy",
  "subcategory": "Vibrational Analysis",
  "summary": "Raman spectroscopy is a molecular vibrational technique that identifies chemical compounds by analyzing inelastically scattered light when a sample is illuminated with monochromatic laser radiation (typically visible wavelengths: 488-785 nm). When photons interact with molecular vibrations, a small fraction (~10⁻⁶ to 10⁻⁸) undergoes Raman scattering: photons gain or lose energy equal to molecular vibrational energy quanta, producing spectral shifts (Raman shifts) measured in wavenumbers (cm⁻¹) relative to the excitation wavelength. The resulting Raman spectrum—a plot of scattered intensity versus Raman shift (typically 100-3500 cm⁻¹)—serves as a molecular fingerprint revealing chemical structure through characteristic vibrational modes: symmetric stretches, bends, ring breathing, lattice modes. Unlike infrared spectroscopy (which probes direct vibrational absorption via dipole moment changes), Raman detects vibrations through polarizability changes, providing complementary information with strong signals from symmetric, non-polar vibrations (C=C, C-C, aromatic rings, metal-oxygen bonds) and weak water interference. In cultural heritage applications, Raman spectroscopy enables non-destructive, microscopic-scale (1-2 μm spot size) identification of inorganic pigments (ultramarine, vermilion, lead white, chromates), organic colorants (indigo, alizarin, carotenoids), corrosion products, mineral phases, polymers, and binders with minimal sample preparation. Modern instruments employ confocal optics (depth resolution 2-10 μm, reject out-of-focus signals), fiber-optic probes (portable, in-situ analysis), and specialized techniques (SERS for trace detection, resonance Raman for chromophores) making the technique indispensable for pigment analysis, authentication, degradation studies, and conservation science where non-destructive molecular identification at microscopic scale is essential.",
  "keyApplications": [
    "Pigment identification (inorganic: ultramarine, vermilion, minium, chromates, cadmiums; organic: indigo, Prussian blue, synthetic organics)",
    "Mineral phase determination (polymorphs: anatase vs rutile TiO₂, calcite vs aragonite CaCO₃, corrosion products)",
    "Organic binder analysis (proteinaceous: collagen, gelatin; polysaccharides: gum arabic, starch; limited for oils/waxes due to fluorescence)",
    "Corrosion product identification (rust phases, verdigris, bronze disease, metal sulfides, chlorides)",
    "Gemstone authentication (distinguish natural vs synthetic, treatments, simulants via spectral fingerprints)",
    "Polymer characterization (synthetic resins, plastics in modern art, conservation materials)",
    "Degradation studies (photooxidation products, environmental damage, aging markers)",
    "Multi-layer analysis (confocal depth profiling through transparent/translucent layers: varnish, glazes, coatings)"
  ],
  "destructiveness": "non-destructive",
  "portability": "bench-top to portable",
  "typicalTimePerMeasurement": "Seconds to minutes per point (single spectrum: 1-60 s depending on signal strength; mapping: hours for 100×100 μm² area)",
  "costRange": {
    "instrument": "$40,000-$500,000 (portable: $40-80K; benchtop microscope: $80-200K; research-grade confocal: $150-500K)",
    "perSample": "$50-$300 per analysis session (staff time, consumables minimal; cost dominated by instrument time, expertise)"
  },
  "fundamentalPhysics": {
    "principle": "Raman spectroscopy exploits inelastic light scattering (Raman effect) where incident photons exchange energy with molecular vibrations. Monochromatic laser light (frequency ν₀) illuminates sample. Most photons scatter elastically (Rayleigh scattering, no energy change, same frequency ν₀). Small fraction (~10⁻⁶-10⁻⁸) scatters inelastically: photon promotes molecule to virtual excited state (not real electronic state, very short-lived ~10⁻¹⁴ s), molecule relaxes to different vibrational level than initial, photon energy changes. Two cases: (1) Stokes scattering (most common): molecule initially in ground vibrational state (v=0), ends in excited vibrational state (v=1); photon loses energy ΔE=hν_vib, scattered frequency ν_s = ν₀ - ν_vib (red-shifted). (2) Anti-Stokes scattering: molecule initially in excited vibrational state (v=1, thermally populated), ends in ground state (v=0); photon gains energy, ν_as = ν₀ + ν_vib (blue-shifted). Intensity I_Stokes >> I_anti-Stokes at room temperature (Boltzmann population factor), so Stokes region analyzed. Raman spectrum plots scattered intensity vs Raman shift Δν̃ = ν̃₀ - ν̃_s (wavenumber units cm⁻¹, independent of laser wavelength). Each molecular vibration (bond stretch, angle bend, ring breathing, lattice phonon) produces peak at characteristic Raman shift. Peak positions fingerprint molecular structure (e.g., C=O stretch 1700 cm⁻¹, aromatic ring breathing 1000 cm⁻¹), peak intensities depend on Raman scattering cross-section σ_R (proportional to polarizability derivative ∂α/∂Q, where α=polarizability tensor, Q=vibrational coordinate). Vibrations with large polarizability change (symmetric stretches, breathing modes of conjugated systems, metal-oxygen vibrations) produce strong Raman signals; vibrations with small polarizability change but large dipole moment change are Raman-weak but IR-strong (complementary techniques).",
    "physicalPhenomenon": "**Raman scattering mechanism (classical):** Oscillating electric field E of laser light induces dipole moment μ_ind = α·E in molecule (α = polarizability). For vibrating molecule, α varies with nuclear positions: α = α₀ + (∂α/∂Q)·Q, where Q = Q₀·cos(2πν_vib·t) (normal mode vibration). Induced dipole μ_ind = α₀·E₀·cos(2πν₀·t) + (∂α/∂Q)·Q₀·E₀·cos(2πν₀·t)·cos(2πν_vib·t). Trigonometric identity: product of cosines → sum/difference frequencies. Result: dipole oscillates at ν₀ (Rayleigh), ν₀±ν_vib (Stokes/anti-Stokes). Oscillating dipole radiates light at these frequencies. **Quantum picture:** Photon-molecule interaction described by second-order perturbation theory. Transition probability proportional to |⟨f|α|i⟩|² where |i⟩, |f⟩ are initial/final states. Selection rules: Δv = ±1 (fundamental), Δv = ±2, ±3 (overtones, weaker). For vibration to be Raman-active: polarizability must change during vibration (∂α/∂Q ≠ 0). Symmetric vibrations typically Raman-active; antisymmetric vibrations often Raman-inactive (but IR-active if dipole moment changes). **Intensity factors:** Raman intensity I_R ∝ I₀ · ν⁴ · σ_R · N · η, where I₀=incident intensity, ν=scattered frequency (~ν₀⁴, hence shorter wavelength excitation stronger signal but higher risk of fluorescence), σ_R=Raman cross-section (10⁻³⁰-10⁻²⁵ cm² for typical organic molecules; 10⁻²⁸-10⁻²⁶ for inorganics), N=number of scatterers in probe volume, η=collection efficiency. Raman cross-sections small → requires high photon flux (lasers) for adequate signal. **Fluorescence interference:** Electronic absorption followed by fluorescence (relaxation from excited electronic state → ground state + broad-band photon emission) can overwhelm weak Raman signal. Fluorescence quantum yield 10⁻⁴-10⁻¹ for many organic molecules; Raman scattering efficiency ~10⁻⁶-10⁻⁸ → fluorescence 10²-10⁴× stronger, swamps Raman. Mitigation: use longer wavelength excitation (red/NIR, 785 nm or 1064 nm: lower photon energy, less likely to excite electronic transitions; or photobleach fluorophores via prolonged irradiation).",
    "equations": [
      {
        "latex": "$$\\Delta \\tilde{\\nu} = \\tilde{\\nu}_0 - \\tilde{\\nu}_s = \\frac{1}{\\lambda_0} - \\frac{1}{\\lambda_s}$$",
        "description": "Raman Shift (wavenumber difference between incident and scattered light)",
        "variables": [
          {
            "symbol": "\\Delta \\tilde{\\nu}",
            "meaning": "Raman shift",
            "units": "cm⁻¹"
          },
          {
            "symbol": "\\tilde{\\nu}_0",
            "meaning": "incident laser wavenumber (1/λ₀)",
            "units": "cm⁻¹"
          },
          {
            "symbol": "\\tilde{\\nu}_s",
            "meaning": "scattered light wavenumber (1/λ_s)",
            "units": "cm⁻¹"
          },
          {
            "symbol": "\\lambda_0",
            "meaning": "incident laser wavelength",
            "units": "nm or cm"
          },
          {
            "symbol": "\\lambda_s",
            "meaning": "scattered light wavelength (Stokes)",
            "units": "nm or cm"
          }
        ]
      },
      {
        "latex": "$$I_{Raman} \\propto I_0 \\cdot \\nu^4 \\cdot \\sigma_R \\cdot N \\cdot \\eta$$",
        "description": "Raman Scattered Intensity",
        "variables": [
          {
            "symbol": "I_{Raman}",
            "meaning": "Raman scattered light intensity",
            "units": "photons/s or counts/s"
          },
          {
            "symbol": "I_0",
            "meaning": "incident laser intensity",
            "units": "W/cm² or photons/(s·cm²)"
          },
          {
            "symbol": "\\nu",
            "meaning": "scattered light frequency (≈ν₀ for small shifts)",
            "units": "Hz or cm⁻¹"
          },
          {
            "symbol": "\\sigma_R",
            "meaning": "Raman scattering cross-section",
            "units": "cm²/molecule"
          },
          {
            "symbol": "N",
            "meaning": "number of molecules in probe volume",
            "units": "molecules"
          },
          {
            "symbol": "\\eta",
            "meaning": "collection efficiency (optics, detector)",
            "units": "dimensionless"
          }
        ]
      },
      {
        "latex": "$$\\sigma_R \\propto \\left| \\frac{\\partial \\alpha}{\\partial Q} \\right|^2$$",
        "description": "Raman Cross-Section (polarizability derivative)",
        "variables": [
          {
            "symbol": "\\sigma_R",
            "meaning": "Raman scattering cross-section",
            "units": "cm²"
          },
          {
            "symbol": "\\alpha",
            "meaning": "polarizability tensor of molecule",
            "units": "Å³ or cm³"
          },
          {
            "symbol": "Q",
            "meaning": "normal mode coordinate (vibrational displacement)",
            "units": "Å or dimensionless"
          }
        ]
      },
      {
        "latex": "$$\\frac{I_{anti-Stokes}}{I_{Stokes}} = \\left( \\frac{\\nu_0 + \\nu_{vib}}{\\nu_0 - \\nu_{vib}} \\right)^4 \\exp\\left( -\\frac{h \\nu_{vib}}{k_B T} \\right)$$",
        "description": "Stokes to Anti-Stokes Intensity Ratio (temperature dependent)",
        "variables": [
          {
            "symbol": "I_{anti-Stokes}",
            "meaning": "anti-Stokes peak intensity (ν₀+ν_vib)",
            "units": "arbitrary"
          },
          {
            "symbol": "I_{Stokes}",
            "meaning": "Stokes peak intensity (ν₀-ν_vib)",
            "units": "arbitrary"
          },
          {
            "symbol": "\\nu_0",
            "meaning": "laser frequency",
            "units": "cm⁻¹"
          },
          {
            "symbol": "\\nu_{vib}",
            "meaning": "vibrational frequency",
            "units": "cm⁻¹"
          },
          {
            "symbol": "h",
            "meaning": "Planck constant",
            "units": "6.626×10⁻³⁴ J·s"
          },
          {
            "symbol": "k_B",
            "meaning": "Boltzmann constant",
            "units": "1.381×10⁻²³ J/K"
          },
          {
            "symbol": "T",
            "meaning": "absolute temperature",
            "units": "K"
          }
        ]
      },
      {
        "latex": "$$\\Delta z \\approx \\frac{\\lambda}{2 \\cdot NA^2} \\cdot n$$",
        "description": "Confocal Depth Resolution (axial)",
        "variables": [
          {
            "symbol": "\\Delta z",
            "meaning": "axial (depth) resolution",
            "units": "μm"
          },
          {
            "symbol": "\\lambda",
            "meaning": "wavelength of light (laser + Raman scattered)",
            "units": "nm"
          },
          {
            "symbol": "NA",
            "meaning": "numerical aperture of objective",
            "units": "dimensionless"
          },
          {
            "symbol": "n",
            "meaning": "refractive index of medium",
            "units": "dimensionless"
          }
        ]
      },
      {
        "latex": "$$d_{lateral} \\approx \\frac{0.61 \\lambda}{NA}$$",
        "description": "Lateral Spatial Resolution (Rayleigh criterion)",
        "variables": [
          {
            "symbol": "d_{lateral}",
            "meaning": "minimum resolvable feature separation (lateral)",
            "units": "μm"
          },
          {
            "symbol": "\\lambda",
            "meaning": "wavelength (laser, typically 532-785 nm)",
            "units": "nm"
          },
          {
            "symbol": "NA",
            "meaning": "numerical aperture of objective",
            "units": "dimensionless (0.1-0.9 typical for Raman)"
          }
        ]
      }
    ],
    "interactionDepth": "Raman spectroscopy probes a confocal volume determined by laser spot size (lateral) and depth of field (axial). For confocal systems: lateral resolution ~0.5-2 μm (diffraction-limited, depends on λ/NA), axial resolution ~2-10 μm (confocal pinhole rejects out-of-focus light). Non-confocal systems: depth of field tens to hundreds of μm (collects Raman signal from entire illuminated depth). Light penetration depends on sample: opaque materials (metals, dense pigments) = surface only (10-100 nm skin depth); translucent (varnish, glazes, minerals) = signal from depth up to 10-100 μm (absorption and scattering limit); transparent (glass, clear resin) = signal throughout thickness (mm-scale possible). Confocal Raman enables depth profiling: focus at different z-positions, collect spectra → 3D chemical mapping (stratigraphic analysis through paint layers, depth-resolved composition in gemstones).",
    "spatialResolution": "Lateral: 0.5-2 μm typical (microscope-based, high-NA objective 50-100×); 10-50 μm (fiber probe systems, lower-NA). Depth: Confocal: 2-10 μm (pinhole-defined, rejects out-of-focus signal). Non-confocal: 20-200 μm (depth of field of objective). Depth profiling: step size 0.5-5 μm (manual or motorized z-stage). Limiting factors: Diffraction limit: lateral resolution ~0.61λ/NA (λ=532 nm, NA=0.9 → ~360 nm theoretical; practical ~500-1000 nm due to aberrations). Confocal pinhole size: smaller pinhole → better axial resolution but lower signal (reject more light); trade-off between resolution and SNR. Sample scattering: highly scattering samples (rough surfaces, translucent pigments) blur spatial resolution (scatter light to adjacent regions). Laser spot size: fiber probes have larger core (50-100 μm) → lower lateral resolution but higher collection efficiency. Refractive index mismatch: focusing through layers with different n causes focal shift (apparent depth ≠ actual depth; correct via n measurements). Working distance: high-NA objectives (NA 0.8-0.9) have short working distance (<2 mm) → limited access to recessed areas; long-WD objectives lower NA → worse resolution.",
    "detectionLimit": "Major component: 0.1-1 wt% (depends on Raman cross-section). Strong scatterers (e.g., carbon nanotubes, aromatic compounds): ppm-level (10⁻⁶-10⁻⁴). SERS (surface-enhanced Raman): single-molecule detection possible (10⁻¹⁵-10⁻¹⁸ M, enhancement factor 10⁶-10⁸). Typical pigments: 1-10 wt% detectable in mixtures. Dynamic range: 10²-10⁴ in intensity (major peaks vs minor peaks in spectrum). Quantification: ±5-20% accuracy (ratiometric analysis of peak areas; matrix effects, fluorescence interference limit precision). Signal-to-noise: SNR >10:1 required for reliable peak identification. Strong Raman scatterers (diamond, graphite, TiO₂): SNR 100:1 to 1000:1 achievable (1 s integration). Weak scatterers (organics, carbonates): SNR 5:1 to 20:1 typical (10-60 s integration). Fluorescence interference reduces SNR (fluorescence background >>Raman signal; SNR <5:1 unusable unless background subtraction possible)."
  },
  "instrumentation": {
    "source": "Continuous-wave (CW) lasers: (1) Diode-pumped solid-state (DPSS): 532 nm (green, Nd:YAG doubled), 785 nm (NIR, diode), (2) HeNe: 633 nm (red), (3) Diode: 405 nm (violet), 830 nm, 1064 nm (NIR). Wavelengths: 405-1064 nm (visible-NIR range). Common for heritage: 532 nm (high Raman efficiency but fluorescence issues), 785 nm (reduced fluorescence, moderate efficiency), 1064 nm (minimal fluorescence, low efficiency). Power: 1-500 mW at source; 0.1-50 mW at sample (attenuated to avoid damage). Line width: <0.1 cm⁻¹ (narrow, monochromatic). Stability: ±0.5 cm⁻¹ (wavelength), ±2% (power). Energy range: Photon energies: 1.17 eV (1064 nm) to 3.06 eV (405 nm). Below electronic transitions for most materials (avoid resonance excitation unless desired; resonance Raman enhances specific modes but risks sample damage). Power range: At sample: 0.1-50 mW typical. Pigment analysis: 0.5-10 mW (avoid photobleaching, thermal damage). SERS: 0.1-1 mW (lower power, enhanced sensitivity). Inorganic minerals: 1-50 mW (robust to laser heating). Beam characteristics: Gaussian TEM₀₀ mode (single spatial mode, circular beam profile). Beam diameter at sample: 0.5-2 μm (focused via microscope objective, 50-100×); 10-100 μm (fiber probe, lower NA). Coherence length: meters (highly coherent, enables interference; not critical for Raman but affects speckle patterns).",
    "detector": "CCD (charge-coupled device): back-thinned, deep-depletion, cooled to -70°C (low dark current, high quantum efficiency). EMCCD (electron-multiplying CCD): on-chip gain, ultra-low light detection. InGaAs array: for NIR (1064 nm excitation, detect Stokes in 1100-1700 nm). Spectral range: Detection: 400-1100 nm (Si-based CCD); 900-1700 nm (InGaAs). Raman shift range: typically 100-4000 cm⁻¹ (fingerprint region 100-2000 cm⁻¹ most diagnostic; high-wavenumber 2500-4000 cm⁻¹ for O-H, N-H, C-H stretches). Efficiency: Quantum efficiency: 90-95% peak (back-thinned CCD at 600-800 nm); 50-70% (standard CCD at 532 nm); 70-85% (InGaAs at 1200-1600 nm). Overall system efficiency ~1-10% (accounting for collection optics, spectrograph, detector). Time resolution: Typical integration times: 0.1-60 seconds per spectrum (balance signal vs. noise, sample damage). Time-resolved Raman (kinetics, photochemistry): millisecond to microsecond resolution possible (gated detectors, not typical for heritage).",
    "optics": "Laser (CW, visible-NIR, power supply, temperature control). Beam delivery optics (mirrors, lenses, filters; couple laser to microscope or fiber). Microscope (upright or inverted, objectives 5-100×, stage for sample positioning). Or fiber optic probe (for portable/in-situ, collects Raman signal, delivers to spectrograph). Notch or edge filter (blocks Rayleigh scattered light ν₀, transmits Raman ν₀±Δν; OD 6-8 at ν₀). Spectrograph (dispersive grating: 600-1800 lines/mm, focal length 200-500 mm). CCD detector (array: 1024-2048 pixels, cooled, 16-bit digitization). Computer (control software, spectral acquisition, data processing, library matching).",
    "criticalComponents": [
      "Notch/edge filter (blocks Rayleigh scattered laser line, OD 6-8; essential to detect Raman shifts as low as 50-100 cm⁻¹ without stray laser light overwhelming detector)",
      "Spectrograph grating (disperses Raman-shifted wavelengths; higher groove density = better spectral resolution but narrower range; 1200-1800 lines/mm typical for 100-3500 cm⁻¹ range)",
      "Cooled CCD detector (thermoelectric cooling to -60 to -100°C; reduces dark current noise, critical for weak Raman signals, long integrations)",
      "High-quality microscope objective (high NA for spatial resolution, good transmission at laser/Raman wavelengths, minimal fluorescence from lens coatings)",
      "Confocal pinhole (adjustable diameter 25-1000 μm; smaller = better depth resolution but lower signal; optimize per application)",
      "Laser stability (power and wavelength; fluctuations cause spectral shifts, intensity variations; active stabilization or reference calibration)",
      "Vibration isolation (optical table or passive dampers; vibrations shift laser focus, blur spectra; critical for long integrations, high-resolution mapping)"
    ],
    "typicalConfiguration": "**Benchtop Raman microscope (heritage-optimized):** Renishaw inVia Reflex or Horiba LabRAM HR Evolution. Lasers: 532 nm DPSS (50 mW, attenuated to 0.5-5 mW at sample via ND filters) + 785 nm diode (300 mW, 1-20 mW at sample). Microscope: Leica DM2700M upright, objectives: 5× (NA 0.15, large area survey), 50× long-working-distance (NA 0.5, WD 8 mm, typical pigment analysis), 100× (NA 0.9, WD 0.3 mm, high-resolution). Confocal: motorized pinhole (50-300 μm adjustable). Spectrograph: 1800 lines/mm grating (high resolution, 1 cm⁻¹ spectral resolution), 600 lines/mm (wide range, 3-4 cm⁻¹ resolution). Detector: Peltier-cooled CCD (-70°C), 1024×256 pixels, 16-bit. Filters: notch filters at 532 nm and 785 nm (OD 6). Stage: motorized XYZ (0.1 μm precision, mapping capability). Spectral range: 100-4000 cm⁻¹ (fingerprint + high-wavenumber). Integration time: 1-60 s typical (0.5-5 mW laser power). Calibration: silicon wafer (520.7 cm⁻¹ peak), daily wavelength check. Software: WiRE (Renishaw) or LabSpec (Horiba): acquisition, baseline correction, library search (RRUFF mineral database, heritage pigment libraries). Optional: polarization control (analyze crystal orientation, polymorph discrimination), video camera (locate analysis point, document sample), mapping stage (automated XY raster scan, hyperspectral imaging).",
    "commercialSystems": [
      {
        "name": "inVia Reflex Confocal Raman Microscope",
        "vendor": "Renishaw",
        "notes": "Lasers: 325, 442, 488, 514, 532, 633, 785, 830 nm (up to 5 lasers). 1800 l/mm grating, <1 cm⁻¹ resolution. Confocal, motorized XYZ stage, StreamLine mapping. Approximate cost: $150,000-$350,000 (depending on laser/detector options). URL: https://www.renishaw.com/raman"
      },
      {
        "name": "LabRAM HR Evolution",
        "vendor": "Horiba",
        "notes": "Multi-laser (up to 4), 800 mm focal length, <0.5 cm⁻¹ resolution. Confocal, Olympus microscope, Swift automated mapping. Approximate cost: $180,000-$400,000. URL: https://www.horiba.com/en_en/products/raman-spectroscopy/"
      },
      {
        "name": "DXR3 Raman Microscope",
        "vendor": "Thermo Fisher Scientific",
        "notes": "532 nm or 780 nm laser, compact benchtop, ≤5 cm⁻¹ resolution, motorized stage, OMNIC software. Approximate cost: $80,000-$150,000. URL: https://www.thermofisher.com/raman"
      },
      {
        "name": "SENTERRA II Raman Microscope",
        "vendor": "Bruker",
        "notes": "Up to 4 lasers (405-1064 nm), high-throughput, video-guided, integrated microscope. ≤3 cm⁻¹ resolution. Approximate cost: $120,000-$250,000. URL: https://www.bruker.com/raman"
      },
      {
        "name": "i-Raman Plus Portable",
        "vendor": "B&W Tek (Metrohm)",
        "notes": "532 nm or 785 nm, handheld, 1024-pixel CCD, 8 cm⁻¹ resolution, 2 kg, battery 4 hr, video probe. Approximate cost: $40,000-$60,000. URL: https://www.bwtek.com"
      },
      {
        "name": "PORTA-RAMAN Portable System",
        "vendor": "StellarNet",
        "notes": "785 nm, 2048-pixel CCD, fiber probe or video, 6-10 cm⁻¹ resolution, laptop-based, 5 kg total. Approximate cost: $35,000-$55,000. URL: https://www.stellarnet.us"
      },
      {
        "name": "IDRaman Reader Handheld",
        "vendor": "Ocean Insight",
        "notes": "785 nm, 512-pixel array, 10 cm⁻¹ resolution, 0.5 kg, touchscreen, 8 hr battery, basic library. Approximate cost: $15,000-$25,000 (entry-level). URL: https://www.oceaninsight.com"
      }
    ]
  },
  "methodology": {
    "samplePreparation": [
      "Non-destructive: analyze in situ (paintings, objects) or micro-samples (10-100 μg if sampling needed for other techniques). Probe volume: 1-10 μm³ (confocal microscope, 1 μm spot × 2-10 μm depth).",
      "Objects: position on microscope stage (adjustable height, XY translation). Small samples: mount on glass slide (clean, non-fluorescing; standard microscope slide or quartz if 405 nm laser), no cover slip needed (analyze through air). Cross-sections: embed in resin (polyester, epoxy), polish, mount on slide. Powders: press into pellet or scatter on slide. No special preparation (unlike FTIR-ATR which requires flat intimate contact, or SEM which requires vacuum-compatible mounting).",
      "Clean surface (dust removal with soft brush, compressed air; dust scatters laser, weakens signal). No coatings required (unlike SEM which needs conductive coating). Avoid cleaning with solvents if possible (may dissolve organics, alter surface). For rough/curved surfaces: adjust focus carefully (optimize signal, critical for confocal depth profiling).",
      "Embed sample fragment (paint, ceramic, etc.) in resin (polyester or epoxy; low-fluorescence resin preferred, but standard embedding resins acceptable for inorganic pigments). Polish to expose layers (SiC papers 400-4000 grit, alumina 1 μm, 0.3 μm). Final polish: diamond paste 0.25 μm or colloidal silica (OP-S) for ultra-smooth (reduces scattering, improves signal). Clean: ultrasonic bath in ethanol (remove polishing debris). Mount on slide, analyze layers individually (position laser spot on target layer, collect spectrum; confocal rejects signal from adjacent layers if well-separated).",
      "Fluorescence from mounting materials (embedding resin, slide adhesives): use low-fluorescence resin (UV-cured polyester, Technovit 2000 LC), or quartz slides (glass fluoresces under UV/blue laser). Test blank (resin alone) to identify contaminant peaks. Surface coatings (conservation treatments, varnish): may fluoresce, obscure underlying material. If possible, analyze uncoated areas, or use longer wavelength (785 nm, 1064 nm) to reduce fluorescence. Substrate interference: if analyzing thin layer on substrate (glaze on ceramic, paint on canvas), substrate Raman peaks may appear. Distinguish via peak positions, depth profiling (confocal focus on surface layer only). Dust, debris: scatter laser, reduce signal. Clean before analysis. Thermal damage from laser: sensitive materials (organics, fugitive pigments) can degrade under prolonged irradiation. Monitor: if spectrum changes during acquisition (new peaks appear, intensities change), sample damaged. Reduce power, shorten integration time, or move to fresh spot."
    ],
    "measurementProtocol": "**Step 1: Instrument Calibration and Setup**\nDaily startup: turn on laser (warm-up 15-30 min for wavelength stability), CCD cooler (reach -70°C, ~30 min). Calibrate wavelength: measure silicon wafer standard (520.7 cm⁻¹ sharp peak), verify peak position ±0.5 cm⁻¹ (if drift, recalibrate via software offset correction). Check laser power at sample: power meter or measure Raman intensity of standard (should be consistent day-to-day, ±5%). Select laser wavelength: 532 nm for inorganics/minerals (high efficiency), 785 nm for organics prone to fluorescence. Select objective: 50× LWD (NA 0.5, WD 8 mm) typical for pigments (balance resolution and working distance); 100× (NA 0.9) for maximum resolution if accessible. Set confocal pinhole: 100-300 μm diameter (smaller for better depth resolution, larger for more signal; optimize per sample). Set spectrograph grating: 1800 l/mm for high resolution (detailed peak shapes), 600 l/mm for wide range (100-3500 cm⁻¹ in single spectrum). Configure acquisition: integration time 10 s initial (adjust after test), accumulations 2-5× (average spectra, reduce noise), cosmic ray removal enabled (auto-filter spikes from CCD noise). Duration: 30-60 minutes (startup + calibration). Critical parameters: Silicon peak at 520.7 cm⁻¹ (±0.5 cm⁻¹ tolerance), Laser power stable (±5% day-to-day), CCD at operating temperature (-70°C), Confocal pinhole set (affects depth resolution, signal level).\n\n**Step 2: Sample Positioning and Focus**\nMount object/sample on stage (secure, won't move during analysis). View via video camera (white-light illumination, coaxial with laser path). Navigate to area of interest: identify pigment grain, specific layer in cross-section, corrosion product, etc. (use optical microscope features: color, transparency, crystal habit as guides). Switch to laser illumination mode: laser light (visible for 532 nm, faint red for 785 nm) appears as bright spot on sample (camera sees reflected laser + white light). Adjust XY position to center laser spot on target (sub-μm precision via joystick or software control). Focus: adjust Z-height (stage or objective) to sharpen laser spot (minimize spot size = in-focus). For confocal: focus critical (optimal signal only when sample at focal plane; out-of-focus signal rejected by pinhole). Fine-tune focus: acquire quick spectra at different Z (scan ±10 μm), select Z giving maximum signal (peak intensity). Mark position (software records XYZ coordinates for returning to same spot, or mapping around this point). Duration: 5-15 minutes per area. Critical parameters: Laser spot centered on target feature (verify via video), Focus optimized (maximum Raman signal, sharpest peak intensities), Stage stable (no drift during acquisition, lock stage if possible).\n\n**Step 3: Test Acquisition and Parameter Optimization**\nAcquire initial spectrum: short integration (1-5 s), low laser power (1-5 mW at sample, attenuate with ND filters). Review spectrum in real-time: (1) Check for Raman peaks (sharp peaks at characteristic positions: if pigment, expect peaks in fingerprint region 100-1500 cm⁻¹). (2) Check for fluorescence (broad rising background, overwhelming peaks: if severe, cannot identify Raman peaks). (3) Check intensity (peaks should be well above baseline, SNR >10:1 desired; if low, increase integration time or power; if saturating CCD, reduce power or time). (4) Monitor sample: if photobleaching occurs (spectrum changes during acquisition, peaks disappear/shift), reduce power immediately or move to fresh spot. Optimize parameters: if fluorescence interferes, options: (a) increase integration time (10-60 s, photobleach fluorophores, Raman signal eventually emerges), (b) switch to longer wavelength laser (785 nm, 1064 nm, less fluorescence), (c) move to different location (fluorophores may be localized). If signal weak: increase laser power (2-10 mW for inorganics, but monitor for damage), increase integration time (10-60 s), increase accumulations (5-10× average), check focus (refocus if drifted). Target: SNR >10:1, no fluorescence baseline (or manageable baseline for subtraction), no sample damage (repeat spectrum, should be identical). Duration: 10-30 minutes (iterative optimization). Critical parameters: Raman peaks visible (not overwhelmed by fluorescence or noise), SNR >10:1 (adequate for identification), No sample damage (spectrum reproducible if re-acquired), Baseline manageable (fluorescence not saturating detector).\n\n**Step 4: Final Spectrum Acquisition**\nAcquire final high-quality spectrum with optimized parameters: integration time 10-60 s typical (balance signal vs. acquisition speed), accumulations 3-10× (average to reduce noise), laser power 0.5-10 mW (minimize damage, adequate signal). Monitor acquisition: software displays spectrum building in real-time (watch for artifacts: cosmic ray spikes auto-removed by software, but verify; sudden intensity jumps indicate stage movement or sample degradation, abort and troubleshoot). Acquisition complete: save raw spectrum (vendor format: .spc, .wxd, or export as .txt for processing). Immediately review: check peak positions match expected (compare to literature or database), verify reproducibility (re-acquire same spot, should be nearly identical; if different, sample heterogeneous or damaged, document this). For critical identifications: acquire spectra from multiple grains/locations (verify consistency, rule out impurities or mixtures). Duration: 1-5 minutes per spectrum (acquisition time). Critical parameters: Complete spectrum acquired (100-3500 cm⁻¹ or relevant range), Reproducible (repeat acquisitions at same spot give consistent spectra), Saved with metadata (sample ID, location, laser wavelength, power, integration time documented).\n\n**Step 5: Mapping (Optional, for Spatial Distribution)**\nIf spatial information needed (pigment distribution in cross-section, corrosion product zonation, polymer phase separation): set up mapping. Define map area: select rectangular region (e.g., 50×50 μm² in cross-section covering two paint layers), specify step size (1-5 μm typical, balance resolution vs. acquisition time; smaller step = finer detail but more points). Configure: use optimized acquisition parameters from step 4 (integration time, power, etc.), enable rapid mapping mode if available (fast stage movements, shorter settling times). Start automated acquisition: stage moves in raster pattern, acquires spectrum at each XY point (e.g., 50×50 μm² at 2 μm step = 26×26 = 676 points; if 10 s integration per point = 6760 s = 1.9 hours total). Monitor: verify spectra acquired correctly (spot-check during run; if focus drifts due to sample tilt, pause, refocus, resume). Output: hyperspectral dataset (3D: XY spatial, wavenumber spectral; typically 10-100 MB for 100×100 μm² map). Process: extract chemical maps (image showing distribution of specific compounds via peak intensity at characteristic Raman shift). Duration: 1-10 hours depending on map area, step size, integration time. Critical parameters: Map area covers features of interest (entire cross-section layer, or sufficient to capture spatial variation), Step size appropriate (finer than feature size of interest), Focus maintained (auto-focus each point, or ensure sample flat), Data manageable (100×100 map = 10,000 spectra; ensure storage, processing capacity).\n\n**Step 6: Depth Profiling (Optional, Confocal Mode)**\nFor layered materials (varnish over paint, glaze on ceramic): confocal depth profiling reveals stratigraphy. Position laser on surface (XY coordinates fixed). Acquire spectrum at surface (Z=0, focus on top). Move stage downward (or objective upward): step size 1-5 μm (smaller than confocal depth resolution 2-10 μm, oversample to resolve transitions). At each Z position: acquire spectrum (same integration time as optimized earlier). Continue stepping through depth: 10-100 μm typical (stop when signal disappears, opaque layer reached, or interest depth exceeded). Output: depth profile (series of spectra vs. Z). Analysis: plot peak intensities vs. depth (e.g., varnish peak decreases, paint pigment peak increases at varnish-paint interface) → locate interface, layer thicknesses. Note: depth scale affected by refractive index (apparent depth in air ≠ actual depth in material; correct: actual_depth = apparent_depth / n, where n=refractive index of material, typically 1.5-1.7 for organics, 1.5-2.5 for minerals). Duration: 30 minutes - 2 hours (10-50 spectra at different depths). Critical parameters: Confocal pinhole small enough (depth resolution adequate to resolve layers; 50-100 μm pinhole typical), Step size <depth resolution (avoid aliasing), Refractive index correction applied (for accurate depth scale), Sample transparent/translucent (if opaque, no depth penetration; technique not applicable).\n\n**Step 7: Quality Control and Documentation**\nReview all acquired spectra: check for artifacts (cosmic ray spikes, saturation, baseline drift during acquisition), verify peak positions consistent with calibration (re-check silicon standard if suspicious), confirm SNR adequate (peaks clearly above noise). Document: record sample info (object ID, sampling location, material), analysis conditions (laser wavelength, power at sample, integration time, objective, confocal settings), coordinates (XY position on sample, or photo annotated with analysis spots), any observations (sample appearance, color, suspected ID before Raman, sample condition post-analysis, any visible damage). Photograph: capture optical micrograph (white-light, same view as Raman analysis; shows what area was analyzed, documents appearance). Save all data: raw spectra (vendor format), processed spectra (after baseline correction, if performed), metadata, images. Backup: transfer to institutional server, archive (Raman data files small, ~KB per spectrum; maps ~MB; manageable storage). Duration: 15-30 minutes per session (review, document, backup). Critical parameters: All spectra reviewed (no corrupted files, artifacts identified), Metadata complete (sample ID, conditions documented; future re-analysis or comparison requires knowing acquisition parameters), Sample undamaged or damage documented (if photobleaching, color change observed, note in report; avoid re-analysis same spot), Data backed up (prevent loss of measurements).",
    "typicalParameters": [
      {
        "parameter": "Laser wavelength",
        "value": "532 nm or 785 nm",
        "notes": "532 nm: high Raman efficiency, risk of fluorescence (pigments, minerals). 785 nm: reduced fluorescence, moderate efficiency (organics, mixed materials). 1064 nm: minimal fluorescence, low efficiency (highly fluorescing organics)."
      },
      {
        "parameter": "Laser power at sample",
        "value": "1-5 mW",
        "notes": "Inorganic pigments: 5-20 mW safe. Organics, dyes: 0.5-2 mW (damage risk). SERS: 0.1-1 mW (enhanced sensitivity). Monitor for photobleaching."
      },
      {
        "parameter": "Integration time",
        "value": "10-30 seconds",
        "notes": "Strong scatterers (TiO₂, diamond): 1-5 s. Weak scatterers (carbonates, organics): 30-120 s. Fluorescence photobleaching: start 60+ s, signal improves over time."
      },
      {
        "parameter": "Accumulations (averaging)",
        "value": "3-5",
        "notes": "Average multiple acquisitions: improves SNR by √N (e.g., 4 accumulations → 2× SNR improvement), reduces cosmic ray artifacts. Diminishing returns beyond 10-20 accumulations."
      },
      {
        "parameter": "Spectral resolution",
        "value": "3-5 cm⁻¹",
        "notes": "High resolution (1-3 cm⁻¹): 1800 l/mm grating, narrow spectral range (~500-2000 cm⁻¹ per acquisition). Low resolution (10-20 cm⁻¹): 600 l/mm, wide range (100-4000 cm⁻¹). Heritage: 3-5 cm⁻¹ adequate (peaks ~10-50 cm⁻¹ wide)."
      },
      {
        "parameter": "Spectral range",
        "value": "100-3500 cm⁻¹",
        "notes": "Fingerprint region: 100-2000 cm⁻¹ (inorganics, aromatics). High-wavenumber: 2500-4000 cm⁻¹ (O-H, N-H, C-H stretches). Low-wavenumber: <200 cm⁻¹ (lattice modes, metal-ligand; requires notch filter with low cut-on)."
      },
      {
        "parameter": "Objective magnification/NA",
        "value": "50× LWD, NA 0.5",
        "notes": "High NA (0.8-0.9): best resolution (~0.5 μm), short WD (<2 mm), high collection efficiency. Low NA (0.15-0.4): lower resolution (~5-10 μm), long WD (10-50 mm), access to recessed areas."
      },
      {
        "parameter": "Confocal pinhole diameter",
        "value": "100-300 μm",
        "notes": "Smaller pinhole: better depth resolution (~2 μm at 50 μm pinhole), lower signal. Larger: worse resolution (~10 μm at 300 μm), higher signal. Non-confocal: no pinhole, depth ~50-200 μm."
      },
      {
        "parameter": "Mapping step size",
        "value": "2-5 μm",
        "notes": "Fine mapping: 0.5-1 μm (resolve individual pigment grains, slow). Coarse: 10-20 μm (survey large areas, faster). Balance resolution vs. time: 50×50 μm map at 1 μm step = 2500 points, at 5 μm step = 100 points (25× faster)."
      },
      {
        "parameter": "Depth profiling step size",
        "value": "2-5 μm",
        "notes": "Smaller than confocal depth resolution (2-10 μm); oversample to resolve layer interfaces. Typical: 2 μm steps for 10-50 μm depth profile (5-25 spectra)."
      }
    ],
    "calibration": "**Standards:** Silicon wafer (520.7 cm⁻¹ sharp peak; daily wavelength calibration; verify ±0.5 cm⁻¹). Polystyrene (multiple sharp peaks 620, 1001, 1031, 1602 cm⁻¹; intensity and resolution check). Cyclohexane (liquid standard, 801, 1028, 1157, 1266, 1444 cm⁻¹; if analyzing liquids). NIST SRM 2241 (Raman intensity standard; multi-peak glass, for quantitative intensity calibration; not routine for heritage). White light source (calibrate detector wavelength response, correct for CCD sensitivity variation; performed by manufacturer or annually).\n\n**Frequency:** Daily: silicon wafer (wavelength calibration before each session, ensure peak at 520.7 cm⁻¹). Weekly: polystyrene (verify multiple peaks, intensity ratios consistent). Monthly: laser power check (measure at sample, should be stable ±5%). Annually: full system calibration (alignment, white light correction, detector dark current; performed by service engineer or trained staff).\n\n**Procedure:** **Wavelength calibration:** Place silicon wafer on stage, focus, acquire spectrum (1-5 s integration). Identify silicon peak (should appear ~520.7 cm⁻¹). If shifted (e.g., 521.3 cm⁻¹), apply offset correction in software (shift all spectra by -0.6 cm⁻¹). Verify correction: re-measure silicon (should now read 520.7 cm⁻¹). **Intensity calibration (optional, for quantitative work):** Use NIST SRM 2241 or polystyrene with known intensity ratios. Measure spectrum, compare peak intensity ratios to reference values. If systematic deviation, adjust detector response curve (software correction) or investigate issues (dirty optics, misalignment). **Laser power measurement:** Remove objective, place power meter at laser exit (or use calibrated photodiode at sample position). Measure power (mW). Compare to expected (e.g., 5 mW nominal). If lower (e.g., 3 mW), may indicate laser aging (replace laser diode/doubling crystal), dirty optics (clean beam path), misalignment (realign, requires expertise). Document power in metadata (power at sample affects signal, reproducibility).",
    "qualityControl": [
      "Silicon peak at 520.7 ± 0.5 cm⁻¹ (wavelength calibration valid)",
      "Baseline flat or smoothly varying (not erratic, jumpy; indicates stable acquisition, no vibration)",
      "SNR >10:1 for major peaks (adequate signal for identification)",
      "No cosmic ray spikes (auto-removal enabled; verify by checking spectrum, no isolated single-pixel spikes)",
      "Reproducibility: repeat spectrum at same spot, peak positions ±1 cm⁻¹, intensities ±10% (if larger variation: sample heterogeneous, damaged, or instrumental drift)",
      "No sample damage: visual inspection post-analysis (no color change, charring, bubbling; compare to pre-analysis photo), spectral consistency (if re-acquiring, spectrum unchanged)",
      "Appropriate laser power (not so high that sample damaged, not so low that signal weak; optimize per material)",
      "Confocal signal clean (if depth profiling: signal drops to zero when out of focus; confirms confocal rejection working)"
    ]
  },
  "dataAnalysis": {
    "rawDataFormat": "Vendor formats: .spc (Galactic/Thermo), .wxd (Renishaw WiRE), .ngc (Horiba LabSpec), .dpt (Bruker). Export formats: .txt, .csv (ASCII, intensity vs wavenumber), .mat (MATLAB), .spc (JCAMP-DX universal). Data structure: 1D spectrum: wavenumber (cm⁻¹, typically 100-3500 cm⁻¹) vs intensity (counts or arbitrary units). Typical: 1024-2048 data points (determined by CCD pixels, grating dispersion). Hyperspectral map: 3D dataset (X × Y spatial, wavenumber spectral); e.g., 50×50 pixels × 1024 wavenumbers = 2.56 million data points. Metadata: laser wavelength, power, integration time, accumulations, objective, date, sample ID. Typical file size: Single spectrum: 10-100 KB (ASCII .txt). Map: 10-500 MB (depends on size: 100×100 map × 1024 points × 4 bytes/point ≈ 40 MB uncompressed; vendor formats compressed ~10-50% smaller).",
    "preprocessing": [
      "Cosmic ray removal: Identify and remove high-energy particle hits (single-pixel spikes). Method: compare multiple accumulations (median filter, outlier rejection), or single-spectrum despiking (identify pixels >>neighboring pixels, replace with interpolated value). Essential for clean spectra. Software: Built-in (WiRE, LabSpec), or MATLAB/Python scripts.",
      "Baseline correction: Remove fluorescence background, substrate contributions. Methods: (1) Polynomial fit (order 3-7, fit to valleys between peaks, subtract from spectrum), (2) Asymmetric least squares (ALS, fits baseline preferentially to low points, avoids peaks), (3) Rubberband (connect minima, baseline underneath peaks). Goal: flat baseline, peaks on zero. Necessary if fluorescence present; skip if spectrum already has flat baseline. Software: WiRE, LabSpec (built-in), OriginLab, MATLAB (msbackadj function), Python (BaselineRemoval library).",
      "Smoothing: Reduce noise via averaging adjacent points. Methods: Savitzky-Golay filter (polynomial smoothing, preserves peak shapes; window size 5-15 points typical), moving average (simple, can broaden peaks; less common). Trade-off: smoother spectrum vs. peak broadening, loss of fine features. Apply judiciously (only if SNR poor; over-smoothing reduces spectral resolution). Software: WiRE, LabSpec, OriginLab, MATLAB (sgolayfilt), Python (scipy.signal.savgol_filter).",
      "Normalization: Scale intensity for comparison. Methods: (1) Maximum intensity = 1.0 (divide by max peak height), (2) Area normalization (total integral = constant), (3) Internal standard (normalize to peak of known compound at fixed concentration). Use: compare spectra from different samples, compensate for laser power/integration time variations. For quantitative work: internal standard preferred. Software: WiRE, LabSpec, custom scripts.",
      "Wavenumber calibration check: Verify peak positions correct. Use known peaks in spectrum (if present: e.g., silicon substrate 520.7 cm⁻¹) or compare to database (expected positions). If systematic shift: apply correction (offset all wavenumbers). If random shifts: spectra may be from different instruments/calibrations, align via correlation algorithms before comparison. Software: Manual inspection + spreadsheet, or automated (MATLAB correlation-based alignment).",
      "Spectral cropping: Limit analysis to relevant wavenumber range. Remove: (1) Low wavenumber (<100 cm⁻¹, often noisy, filter edge effects), (2) High wavenumber (>3500 cm⁻¹, usually no signal for heritage materials), (3) Rayleigh scatter region (near laser line, if not fully blocked: 0-50 cm⁻¹ may have residual laser, exclude). Focus on fingerprint region 100-2000 cm⁻¹ and high-wavenumber 2700-3200 cm⁻¹ (C-H, O-H) if relevant. Software: All analysis software (select region of interest)."
    ],
    "analysisWorkflow": "**Step 1: Visual Inspection of Spectrum**\nLoad spectrum into analysis software (WiRE, LabSpec, OriginLab, MATLAB, Python). Display: wavenumber (x-axis, 100-3500 cm⁻¹) vs intensity (y-axis, arbitrary units). Inspect: (1) Peak count and positions: note major peaks (tall, sharp), minor peaks (small but distinct). Record peak positions (wavenumbers of maxima). (2) Baseline: flat (ideal) or sloped/curved (fluorescence, needs correction). (3) Noise level: smooth vs grainy (assess SNR). (4) Artifacts: cosmic ray spikes (narrow, isolated, random positions), saturation (flat-topped peaks), substrate peaks (e.g., broad glass silicate hump 500-600 cm⁻¹). Make preliminary assessment: strong scatterer (many sharp peaks, low baseline, e.g., TiO₂, diamond) vs weak (few peaks, high baseline, e.g., carbonate, organic).\n\n**Step 2: Preprocessing (if needed)**\nApply preprocessing steps as needed based on inspection: (1) Cosmic ray removal: if spikes present (common), apply despiking filter. (2) Baseline correction: if fluorescence background (sloped, curved), fit polynomial (order 4-6 typical) and subtract → should yield flat baseline near zero between peaks. Verify: baseline flat, peaks preserved (not distorted). (3) Smoothing: if noisy (SNR <10:1), apply Savitzky-Golay (window 7-11 points). Check: noise reduced, peaks not excessively broadened. (4) Normalization: if comparing multiple spectra, normalize to maximum intensity = 1.0 or to internal standard peak. Save preprocessed spectrum (separate file or overwrite, depending on workflow; keep raw data archived).\n\n**Step 3: Peak Identification and Assignment**\nIdentify all significant peaks: use peak-finding algorithm (software auto-detects peaks above threshold, e.g., 10% of max intensity) or manual (visually mark each peak, click to record position). For each peak: record wavenumber (cm⁻¹, to nearest 1 cm⁻¹). Create peak list (table: peak position, relative intensity, width). Assign peaks to vibrational modes using reference data: (1) Consult databases: RRUFF (minerals), commercial pigment libraries (Horiba, Renishaw databases), literature (journal articles, Raman spectroscopy textbooks). (2) Match peak positions: compare measured vs. reference (±5 cm⁻¹ tolerance typical; peaks within this are same vibration, considering matrix effects, instrument calibration). (3) Identify compound: if multiple peaks match single reference compound (e.g., measured peaks at 144, 464, 612 cm⁻¹ match anatase TiO₂ 144, 197, 399, 515, 639 cm⁻¹ – several peaks correlate), likely that compound. Single peak insufficient (many compounds share common peaks, e.g., 1000-1100 cm⁻¹ carbonate/sulfate; need multiple peaks for definitive ID). Document: assign each peak (e.g., '612 cm⁻¹: anatase TiO₂ Eg mode'), note uncertainties or alternative assignments.\n\n**Step 4: Database/Library Searching**\nUse spectral library search for automated matching: Import spectrum into database software (RRUFF, KnowItAll, vendor libraries). Run search: software compares entire spectrum (or specified region) to library entries, computes correlation coefficient or similarity score (0-1, higher = better match). Review top matches (typically 5-10 best): inspect overlay (measured spectrum vs. library reference plotted together), verify peak positions align (all major peaks in reference should appear in sample). Check match quality: correlation >0.9 excellent (definitive ID), 0.8-0.9 good (likely ID, confirm with other data), <0.8 poor (not a match, or mixed sample, or degraded material not in database). Select best match: compare to context (expected material, color, source), confirm chemically reasonable. If no good match: compound may not be in database (expand search: other databases, literature), or sample is mixture (proceed to mixture analysis, step 6). Document: save search results (top matches, scores), note selected ID and confidence level.\n\n**Step 5: Polymorph and Phase Determination**\nFor compounds with multiple forms (polymorphs, hydration states): Raman distinguishes via peak positions, intensities. Common heritage examples: (1) TiO₂: anatase (peaks 144, 197, 399, 515, 639 cm⁻¹, strong 144 cm⁻¹) vs. rutile (peaks 143, 447, 612 cm⁻¹, strong 447 cm⁻¹). Shifted positions, different intensities. (2) CaCO₃: calcite (strong 1086 cm⁻¹ carbonate, 155, 281, 711 cm⁻¹ lattice) vs. aragonite (1085 cm⁻¹ carbonate, different lattice modes 154, 207, 701 cm⁻¹). Subtle but distinguishable. (3) Iron oxides: hematite (225, 292, 410, 612 cm⁻¹) vs. magnetite (538, 667 cm⁻¹) vs. goethite (300, 385, 550 cm⁻¹). Compare sample spectrum to reference for each polymorph: select based on exact peak positions, relative intensities. Significance: polymorphs indicate synthesis/formation conditions (e.g., anatase vs. rutile TiO₂ in white pigments: anatase = modern, rutile = modern or natural; calcite vs. aragonite: different geological sources, precipitation conditions). Document: specify polymorph in ID (e.g., 'TiO₂ (anatase)' not just 'TiO₂').\n\n**Step 6: Mixture Analysis (if applicable)**\nIf spectrum shows peaks from multiple compounds (mixture, layered sample signal from depth): Deconvolve components. Methods: (1) **Manual decomposition:** Identify peak groups belonging to each component (e.g., peaks A+B+C = compound X, peaks D+E = compound Y). Assign all peaks. Check: all major peaks assigned, no contradictions (same peak assigned to two compounds should be chemically related). (2) **Peak fitting:** If overlapping peaks, fit multiple Gaussian/Lorentzian curves to resolve (e.g., two peaks at 990 and 1010 cm⁻¹ appear as one broad peak, fit two functions → deconvolve). Estimate compositions: integrate areas of peaks for each component, calculate relative % (semi-quantitative: peak area ∝ concentration × Raman cross-section, but cross-sections vary → ratios approximate). (3) **Library subtraction:** If one component known (e.g., substrate glass), subtract its library spectrum (scaled to match intensity) → residual reveals other component(s). (4) **Advanced: multivariate analysis (PCA, MCR):** For complex mixtures, hyperspectral maps, use chemometrics (principal component analysis, multivariate curve resolution) to extract pure-component spectra from mixture data. Requires expertise, software (MATLAB PLS Toolbox, Python scikit-learn). Report: list all identified components, estimated proportions (e.g., 'mixture: 70% vermilion, 30% lead white, based on peak intensity ratios'), acknowledge semi-quantitative nature.\n\n**Step 7: Spatial Analysis (Mapping Data)**\nIf hyperspectral map acquired: extract chemical information. Workflow: (1) Load map dataset (3D: X × Y × wavenumber). (2) Select peak of interest: choose characteristic peak for compound (e.g., 1086 cm⁻¹ calcite C-O stretch). (3) Generate chemical map: integrate intensity in peak region (±5-10 cm⁻¹ window) at each XY pixel → create 2D image (intensity map, shows spatial distribution of compound). Display as false-color (hot colors = high concentration, cool = low). (4) Repeat for multiple compounds: create separate maps (e.g., calcite map, gypsum map, quartz map from cross-section), overlay as RGB composite (each compound different color → multi-phase distribution visible). (5) Extract spectra from regions: define ROI (region of interest, e.g., specific layer, grain), average spectra within ROI → representative spectrum for that region (higher SNR than single pixel). (6) Classify pixels: assign each pixel to phase (based on spectrum, library matching or cluster analysis) → phase map (segmented image, each phase different color). Analysis: interpret chemical distribution (e.g., pigment layering in paint cross-section, corrosion product zonation on metal, polymer phase separation). Document: annotated maps, identified phases, spatial relationships (e.g., 'Layer 1: ultramarine, Layer 2: lead white', 'Corrosion: inner layer magnetite, outer hematite').\n\n**Step 8: Reporting and Archiving**\nCompile results: (1) Identified compound(s): chemical name, formula, confidence level (definitive if multiple peaks match, tentative if partial match or mixture). (2) Key Raman peaks: list (position, assignment, e.g., '1086 cm⁻¹ C-O symmetric stretch, calcite'). (3) Spectrum figure: plot (labeled axes, peak annotations, comparison to reference if helpful). (4) Context: sample information (object, location sampled, appearance), analysis parameters (laser, power, integration time). (5) Interpretation: significance (e.g., 'Ultramarine identified in blue paint, consistent with 17th-century Flemish palette', 'Anatase TiO₂ indicates modern white pigment, post-1920 based on commercial availability'). (6) Caveats: acknowledge limitations (e.g., 'fluorescence prevented analysis of organic binder', 'mixture of pigments, proportions semi-quantitative', 'depth profiling suggests varnish layer present but could not resolve from paint due to similar refractive indices'). Archive data: save processed spectra, peak lists, figures in institutional repository, link to sample/object record. Follow standards: if publishing, follow journal requirements (supplementary data, spectral files in standard format like JCAMP-DX).",
    "softwareTools": [
      {
        "name": "WiRE (Renishaw)",
        "url": "https://www.renishaw.com",
        "notes": "Acquisition and processing (inVia systems). Cosmic ray removal, baseline correction, smoothing. Library search (Renishaw pigment library). Mapping, depth profiling. Cost: Included with Renishaw instruments."
      },
      {
        "name": "LabSpec (Horiba)",
        "url": "https://www.horiba.com",
        "notes": "Acquisition and processing (LabRAM systems). Advanced baseline correction (polynomial, ALS). Multivariate analysis (PCA, MCR). Extensive pigment/mineral libraries. Cost: Included with Horiba instruments."
      },
      {
        "name": "OMNIC (Thermo Fisher)",
        "url": "https://www.thermofisher.com",
        "notes": "Acquisition (DXR systems). Spectral search, library matching. Quantitative analysis, reporting. Cost: Included with Thermo instruments."
      },
      {
        "name": "RRUFF Database & Software",
        "url": "https://rruff.info",
        "notes": "Extensive mineral Raman database (>15,000 spectra). Online search, downloadable spectra. Standalone tool (RRUFFViewer) for local search. Cost: Free."
      },
      {
        "name": "OriginLab",
        "url": "https://www.originlab.com",
        "notes": "Spectral plotting, peak fitting. Baseline correction, smoothing, normalization. Multivariate analysis tools. Publication-quality figures. Cost: $600-$1,400 (perpetual license)."
      },
      {
        "name": "MATLAB (with PLS Toolbox)",
        "url": "https://www.mathworks.com",
        "notes": "Custom scripting (preprocessing, analysis). Advanced chemometrics (PCA, MCR, classification). Batch processing, automation. Hyperspectral imaging analysis. Cost: $2,500 (MATLAB academic) + $1,500 (PLS Toolbox)."
      },
      {
        "name": "Python (scipy, scikit-learn, pandas)",
        "url": "https://www.python.org",
        "notes": "Free alternative to MATLAB. Extensive libraries (signal processing, ML, plotting). Hyperspectral analysis (PySptools, Spectral Python). Community support, reproducible workflows. Cost: Free."
      },
      {
        "name": "KnowItAll (Wiley)",
        "url": "https://sciencesolutions.wiley.com/knowitall-spectroscopy-software/",
        "notes": "Spectral database (Raman, IR, MS, NMR). Library search across techniques. Mixture analysis. Subscription or perpetual. Cost: $3,000-$10,000 (depends on modules)."
      }
    ],
    "interpretationGuidelines": "**Peak positions:** Diagnostic for molecular structure (±5 cm⁻¹ tolerance for ID; matrix effects, stress, instrument calibration cause small shifts). Low-wavenumber (<500 cm⁻¹): lattice modes (inorganics, crystals), metal-ligand vibrations (coordination compounds), heavy atom bends. Mid-range (500-2000 cm⁻¹): fingerprint region (C-C, C=C, C-O, C-N stretches; aromatic rings; inorganic anion groups SO₄²⁻, CO₃²⁻, PO₄³⁻; most diagnostic for ID). High-wavenumber (>2500 cm⁻¹): X-H stretches (C-H 2800-3000 cm⁻¹, O-H 3200-3600 cm⁻¹, N-H 3300-3500 cm⁻¹; broad peaks, often overlapping, less specific but confirm presence of functional groups). **Peak intensities:** Relative intensities characteristic (peak ratios in reference vs sample should match; large deviations indicate mixture, wrong ID, or resonance effects). Absolute intensities not directly quantitative (depend on concentration × Raman cross-section × instrument factors; use for semi-quantitative comparisons within same session). **Peak widths:** Sharp peaks (5-10 cm⁻¹ FWHM): crystalline materials (well-defined vibrational modes). Broad peaks (20-100 cm⁻¹): amorphous materials (disordered structure, mode frequency distribution), or overlapping peaks (mixture). **Fluorescence interference:** If present despite optimization (long wavelength laser, photobleaching), indicates organic content (binders, dyes, aged varnish). Absence of fluorescence + strong Raman: likely inorganic (mineral pigments, corrosion products). **Comparison to reference:** Multiple peaks must match (≥3-5 peaks for confident ID); single peak insufficient. If partial match: consider mixture (missing peaks from second component), degradation (new peaks from degradation products), or different polymorph/hydration state (slightly shifted peaks).",
    "commonPitfalls": [
      "Misidentification due to single-peak matching: Novice identifies compound based on one prominent peak (e.g., sees peak at 1090 cm⁻¹, concludes 'calcite' based on calcite C-O stretch 1086 cm⁻¹). Problem: many compounds have peaks in same region (gypsum SO₄²⁻ 1008 cm⁻¹, aragonite 1085 cm⁻¹, barite 988 cm⁻¹). Single peak overlap common → false positive ID. Correct approach requires multiple peaks: calcite diagnostic set 155, 281, 711, 1086 cm⁻¹. If only 1086 present: insufficient (could be mixture with only carbonate peak visible; could be different carbonate). Always verify ≥3-4 peaks match before confident ID. Avoidance: Match multiple peaks (≥3-5) across spectrum. Consult full reference spectrum (not just peak table). If only one peak visible: acknowledge uncertainty ('tentative ID, single peak match; confirm with additional techniques or samples'). Use library search algorithms (compare entire spectrum, not just individual peaks). For critical IDs (authentication, dating): confirm with complementary technique (FTIR, XRF for elemental corroboration).",
      "Ignoring fluorescence, forcing interpretation: Sample has strong fluorescence background (broad sloped baseline, Raman peaks barely discernible, SNR <3:1). Novice applies aggressive baseline subtraction (high-order polynomial, or ALS with very low smoothness), forcing flat baseline. Result: baseline subtraction creates artifacts (false peaks where baseline was curved, real peaks distorted). Analyst interprets artifacts as real Raman peaks → wrong ID (e.g., fluorescence tail creates apparent peak at 1200 cm⁻¹, interpreted as quartz, but quartz not actually present). Or subtraction removes broad real Raman peaks (e.g., carbon D/G bands 1350, 1590 cm⁻¹ are somewhat broad, subtraction removes them thinking they're fluorescence). Avoidance: Recognize when fluorescence too severe: if SNR <5:1 even after baseline subtraction, data unreliable (don't over-interpret weak features). Instead: (1) try different laser (785 nm or 1064 nm), (2) photobleach longer (5-10 minutes integrated exposure may reduce fluorescence enough), (3) accept limitation (report 'fluorescence prevented Raman identification; FTIR recommended'). For baseline correction: use conservative settings (polynomial order ≤6, ALS smoothness moderate), visually inspect subtracted spectrum (should look like Raman peaks on flat baseline, not artificial-looking features). If uncertain: show both raw + corrected spectra, note that correction may introduce uncertainty.",
      "Sample damage unrecognized (altered spectrum interpreted as original material): Analyst acquires spectrum, observes peaks, identifies compound. Unknown to analyst: laser power too high (10-50 mW on sensitive organic), sample thermally degraded during acquisition. Degradation products give different Raman spectrum than original (e.g., Prussian blue laser-heated → iron oxide; organic dye photo-oxidized → new aromatic compounds). Analyst identifies degradation product, reports as original material → wrong conclusion (e.g., 'sample contains hematite' when actually Prussian blue that converted to hematite under laser). Or identifies mixture (original + degradation product coexist). Avoidance: Always test reproducibility: acquire spectrum, then immediately re-acquire at same spot (should be identical within noise, ±5%). If second spectrum different (peaks appear/disappear, intensities change): damage occurred, first spectrum compromised. Start with low power (1-5 mW), short integration (5-10 s), verify spectrum stable. For sensitive materials (organics, Prussian blue, some sulfides): <2 mW, monitor continuously (software displays real-time spectrum, watch for changes). If color visibly changes (photobleaching, charring): damage occurred, data invalid. Document: note laser power, integration time in report; state 'no visible damage observed, spectra reproducible' or 'sample sensitive, reduced power to 1 mW to prevent alteration'.",
      "Substrate peaks mistaken for sample (thin/translucent samples): Analyzing thin layer (paint glaze 1-10 μm on canvas, polymer coating on glass). Laser penetrates through layer, collects Raman from substrate (glass, canvas sizing). Substrate peaks appear in spectrum. Novice identifies both layer and substrate as mixture (e.g., 'sample contains organic resin AND silica', interpreting glass silicate band as quartz in paint; or 'protein binder' from canvas glue sizing under paint layer). Misleading: substrate not part of sample, should be distinguished. Avoidance: Recognize substrate signatures: glass (broad 500-600 cm⁻¹ silicate hump, 800 cm⁻¹ shoulder), quartz (464, 1084 cm⁻¹ strong), polymers (C-H stretches 2800-3000 cm⁻¹, aromatic 1600 cm⁻¹). If unexpected material appears: check if substrate (compare to blank measurement of substrate alone). Use confocal (small pinhole, focus on surface → reject substrate signal from depth). If substrate still appears: note 'spectrum includes signal from substrate (glass slide, underlying layer)' and distinguish peaks accordingly. For critical analysis: isolate sample (remove from substrate, analyze alone) or use very thin substrate (quartz, minimal Raman) or use opaque backing (block laser from penetrating to substrate).",
      "Polymorph confusion (wrong phase identified): Compound exists in multiple forms (polymorphs, hydration states), Raman distinguishes them, but peak positions differ by only 5-20 cm⁻¹. Novice uses low-resolution spectrum (10-20 cm⁻¹ resolution, e.g., handheld Raman) or doesn't carefully check peak positions. Identifies wrong polymorph (e.g., calls rutile TiO₂ when actually anatase; confuses calcite vs aragonite; mistakes goethite for hematite). Consequence: wrong interpretation (e.g., anatase=modern pigment, rutile could be natural; calcite vs aragonite affects sourcing, climate interpretation in geological samples). Misidentification can impact conservation decisions, authentication, provenance studies. Avoidance: Use high-resolution spectra (≤5 cm⁻¹ resolution) for polymorph discrimination. Consult reference spectra for ALL polymorphs of compound (not just 'TiO₂' but anatase AND rutile, compare both). Verify multiple peak positions (e.g., anatase 144, 197, 399, 515, 639 cm⁻¹; rutile 143, 447, 612 cm⁻¹ → anatase strongest peak 144, rutile strongest 447 → very different, but if only looking at 143/144 peak could confuse). Report specific polymorph in results: 'TiO₂ (anatase)' not just 'TiO₂'. If uncertain: state 'TiO₂ detected, polymorph determination requires higher resolution' or confirm with XRD (definitive for polymorphs)."
    ]
  },
  "applications": {
    "primaryUses": [
      "Inorganic pigment identification (ultramarine, vermilion, lead white, ochres, chromates, cadmiums, cobalts)",
      "Organic colorant analysis (indigo, Prussian blue, alizarin, synthetic organic pigments; limited by fluorescence)",
      "Mineral identification (quartz, calcite, gypsum, clays, gemstones; polymorph determination)",
      "Corrosion product characterization (rust phases, copper corrosion, bronze disease, silver tarnish)",
      "Polymer identification (acrylics, polyesters, PVC, conservation resins; modern art materials)",
      "Gemstone authentication (natural vs synthetic, treatments, geographical origin via inclusions/spectral fingerprint)",
      "Multi-layer analysis (confocal depth profiling: varnish/glaze over paint, coatings, gilding)",
      "Degradation studies (photo-oxidation products, environmental damage markers, aging assessment)"
    ],
    "materialTypes": [
      "Inorganic pigments (ultramarine, vermilion, minium, chromates, titanium white): excellent - Strong Raman scatterers; well-characterized reference spectra; definitive identification including polymorphs",
      "Mineral phases (calcite, gypsum, quartz, clay minerals, gemstones): excellent - Ideal application; Raman distinguishes polymorphs (calcite vs aragonite, anatase vs rutile), structural variations",
      "Organic pigments and dyes (indigo, alizarin, synthetic organics): fair-good - Often fluoresce (785 nm or 1064 nm laser helps); if non-fluorescing, excellent characterization; Prussian blue excellent",
      "Corrosion products (hematite, goethite, magnetite, verdigris, malachite, azurite): excellent - Distinguishes iron oxide phases, copper corrosion products; identifies transformation stages, degradation pathways",
      "Polymers and resins (acrylics, polyesters, epoxy, conservation materials): good - Identifies polymer type; C=C, C-O, aromatic peaks characteristic; natural resins (dammar, mastic) can fluoresce, challenging",
      "Organic binders (oils, proteins, polysaccharides): poor-fair - Weak Raman scatterers; strong fluorescence (especially aged oils, proteins); better analyzed with FTIR,Py-GC-MS",
      "Carbon-based materials (graphite, charcoal, carbon black, soot): excellent - Strong Raman: D band ~1350 cm⁻¹, G band ~1580 cm⁻¹; distinguishes crystalline graphite vs amorphous carbon; no fluorescence",
      "Gemstones (diamond, ruby, sapphire, emerald, jade): excellent - Non-destructive authentication; distinguishes natural vs synthetic, treatments (heating, irradiation alter spectrum), inclusions",
      "Ceramics and glass: good-excellent - Crystalline phases (quartz, mullite, pigments) excellent; amorphous glass gives broad bands (less diagnostic but identifies silicate, borate types)",
      "Metals (pure metals, alloys): not applicable - Metals have no molecular vibrations (no Raman peaks); but surface oxides, corrosion products excellent; SERS on nanostructured metal surfaces"
    ],
    "caseStudies": [
      {
        "title": "Vermeer's 'Girl with a Pearl Earring': Raman Microscopy Identifies Pigment Palette and Paint Layering",
        "description": "The Mauritshuis and RCE conducted comprehensive study of Vermeer's masterpiece (2018), using Raman microscopy for non-destructive pigment identification. Equipment: Renishaw inVia Reflex confocal Raman microscope. Lasers: 532 nm (inorganics) + 785 nm (organics). Analysis: 50+ in-situ locations on painting surface + 15 cross-sections. Results: Complete pigment palette identified (12 pigments): ultramarine (548 cm⁻¹), vermilion (254, 284, 344 cm⁻¹), lead-tin yellow type I (130-452 cm⁻¹), lead white (1050 cm⁻¹), chalk (1086 cm⁻¹), bone black (1350, 1580 cm⁻¹), ochres (hematite 225-612 cm⁻¹), smalt (weak glass bands). Layer structure revealed via cross-section mapping: ultramarine + smalt in blue areas (economizing expensive ultramarine). Integration with MA-XRF: Raman molecular ID + XRF elemental distribution → complete characterization. Significance: Non-destructive in-situ analysis, polymorph discrimination (calcite vs aragonite, lead-tin yellow type I vs II), authentication support (palette matches 17th-century Dutch, no anachronisms). Methodology published (van Loon et al. 2019, Heritage Science).",
        "reference": "van Loon, A., et al. 2019. 'Vermeer's Girl with a Pearl Earring: A Technical Study Using Macro-X-Ray Fluorescence Scanning and Raman Microscopy.' Heritage Science 7: 64. DOI: 10.1186/s40494-019-0307-5"
      }
    ]
  },
  "multimodal": {
    "complementaryTechniques": [
      "ftir-spectroscopy",
      "xrf",
      "sem-eds",
      "xrd",
      "gc-ms",
      "uv-vis-spectroscopy"
    ],
    "commonCombinations": [
      {
        "techniques": [
          "raman-spectroscopy",
          "ftir-spectroscopy"
        ],
        "rationale": "Raman and FTIR complementary (different selection rules): Raman strong for symmetric, non-polar vibrations (C=C, aromatic rings, metal-O); FTIR strong for polar, asymmetric vibrations (C=O, O-H, N-H). Raman identifies inorganic pigments, FTIR identifies organic binders (oils, proteins). Use both for complete organic+inorganic characterization.",
        "examples": "Paint cross-section analysis: Raman maps pigment distribution (layer 1: lead white + ultramarine; layer 2: vermilion pure; layer 3: bone black + umber). FTIR on same cross-section (ATR on polished surface, press onto each layer): identifies binders (layer 1: protein tempera, amide I/II peaks; layer 2: oil, ester C=O 1740 cm⁻¹; layer 3: oil). Combined: complete stratigraphy (layer 1 = lead white + ultramarine in protein; layer 2 = vermilion in oil; layer 3 = black + umber in oil). Neither technique alone provides full picture: Raman misses binders (fluorescence, weak signal), FTIR less specific for pigments (broad bands, some inorganics have weak/no IR). Together: comprehensive."
      },
      {
        "techniques": [
          "raman-spectroscopy",
          "xrf"
        ],
        "rationale": "XRF fast, large-area (scan 50×50 cm painting in hours), non-destructive → identifies where elements are. Raman slower, point-by-point, but identifies molecules → what compounds, not just elements. XRF ambiguous for mixed-element pigments (Pb present in 5+ pigments; Fe in 10+ pigments; Ti in 2 whites + 1 yellow + impurities). Raman resolves: definitive molecular ID. Combined: XRF guides Raman (efficient, analyze only relevant locations), Raman validates XRF interpretation (confirms compound).",
        "examples": "Vermeer 'Girl with Pearl Earring' (see case study): MA-XRF mapped Na + Al + Si + S (elements in ultramarine). Ambiguity: also in azurite (different Cu + carbonate) or smalt (Co glass). Raman targeted blue regions (based on XRF hot spots), identified ultramarine (548 cm⁻¹ diagnostic peak, not azurite 400/1096 cm⁻¹ or smalt broad glass bands). XRF Pb + Sn map showed turban. Raman identified lead-tin yellow type I (not type II, or mixture lead white + tin oxide). Combined: XRF spatial (ultramarine in background + jacket accents), Raman definitive ID. Efficient, comprehensive."
      },
      {
        "techniques": [
          "raman-spectroscopy",
          "sem-eds"
        ],
        "rationale": "SEM-EDS provides morphology (particle size distribution: important for pigment dating, source; 19th-century vermilion coarser than modern; hand-ground vs synthetic differences in particle shape) and elements (qualitative/quantitative composition). Raman provides molecular structure (crystal phase, polymorph, organic vs inorganic). SEM cannot distinguish polymorphs (anatase vs rutile both Ti + O in EDS; hematite vs magnetite vs goethite all Fe + O). Raman cannot image morphology (diffraction-limited ~1 μm, cannot see particle shapes <1 μm; no particle size distribution data). Combined: complete characterization (morphology + chemistry + structure).",
        "examples": "Pigment authentication (natural vs synthetic ultramarine): SEM shows particle morphology (natural lapis lazuli: irregular angular grains 5-50 μm, inclusions of other minerals; synthetic ultramarine: uniform spheres 0.5-5 μm, no inclusions). EDS: both Na + Al + Si + S (same elements, cannot distinguish). Raman: both show 258, 548, 1096 cm⁻¹ ultramarine peaks (molecular structure same; synthesized to mimic natural). Distinction: SEM morphology (natural irregular, synthetic uniform) + Raman (natural may have trace calcite 1086 cm⁻¹, pyrite 343/379 cm⁻¹ from lapis matrix; synthetic pure ultramarine only). Combined: definitive natural vs synthetic ID. Important for dating (natural used pre-1828, synthetic post-1828), authentication (forgeries may use anachronistic synthetic in 'old' painting)."
      }
    ]
  },
  "references": {
    "onlineResources": [
      {
        "title": "RRUFF Database",
        "url": "https://rruff.info",
        "notes": "15,000+ mineral Raman spectra, searchable, downloadable; essential reference for heritage minerals, pigments"
      },
      {
        "title": "IRUG (Infrared and Raman Users Group)",
        "url": "http://www.irug.org",
        "notes": "Spectral database (FTIR + Raman), heritage materials focus; biennial meetings, training workshops, publications"
      },
      {
        "title": "e-VISART Database",
        "url": "http://www.e-visart.cch.kcl.ac.uk",
        "notes": "Pigment, dye spectra (Raman, FTIR, UV-Vis); searchable; European heritage materials"
      },
      {
        "title": "Renishaw Pigment Checker",
        "url": "https://www.renishaw.com",
        "notes": "Online Raman library search; upload spectrum, match to heritage pigment database; free tool"
      }
    ]
  },
  "tags": [
    "Raman spectroscopy",
    "vibrational spectroscopy",
    "molecular analysis",
    "pigment identification",
    "confocal microscopy",
    "non-destructive analysis",
    "inorganic pigments",
    "mineral identification",
    "polymorph",
    "corrosion products",
    "laser spectroscopy"
  ],
  "relatedTechniques": [
    "ftir-spectroscopy",
    "xrf",
    "sem-eds",
    "xrd",
    "gc-ms",
    "uv-vis-spectroscopy"
  ],
  "lastUpdated": "2025-01-15"
}