{
  "id": "synchrotron-xrf-mapping",
  "name": "Synchrotron X-Ray Fluorescence Mapping",
  "acronym": "SR-XRF / SXR-XRF / Synchrotron XRF / μ-XRF (when microbeam)",
  "category": "Elemental Analysis Techniques",
  "subcategory": "X-Ray Fluorescence Spectroscopy (Advanced/Synchrotron-Based)",
  "summary": "Synchrotron X-ray fluorescence (SR-XRF) mapping is an ultra-high-sensitivity, high-spatial-resolution elemental imaging technique that leverages the exceptional properties of synchrotron radiation—brilliant, highly collimated, tunable, polarized X-ray beams generated by relativistic electrons in storage rings—to detect and map chemical elements at concentrations from percent levels down to parts-per-million (ppm) or parts-per-billion (ppb), with spatial resolution from millimeters to sub-micrometer (100 nm-1 mm spot sizes). Unlike laboratory XRF systems that use sealed X-ray tubes (polychromatic, low flux ~10⁸ photons/s/mm²), synchrotron sources deliver monochromatic, high-flux X-ray beams (10¹⁰-10¹³+ photons/s/μm² at 3rd-generation facilities) that can be focused to micron or sub-micron spots using specialized X-ray optics (Kirkpatrick-Baez mirrors, Fresnel zone plates, multilayer Laue lenses). When the focused synchrotron beam illuminates a sample, inner-shell electrons are photoionized, and characteristic X-ray fluorescence is emitted (element-specific energies: Fe Kα 6.4 keV, Pb Lα 10.6 keV, etc.). Energy-dispersive detectors (silicon drift detectors typically, or wavelength-dispersive for highest resolution) record fluorescence spectra at each position as the sample is raster-scanned through the beam, generating 2D or 3D elemental distribution maps with detection limits 10-1000× better than conventional XRF (ppb-ppm vs. 0.1-1% laboratory XRF). Heritage applications include: pigment identification and distribution mapping at microscale (distinguish vermilion vs. red lead vs. cadmium red via Hg, Pb, Cd signals, resolve 1-10 μm pigment grains), trace element analysis for provenance (obsidian, ceramics, metals: Sr, Rb, Zr, rare earth elements discriminate geological sources), degradation studies (metal corrosion layers 100 nm-10 μm thickness, identify Cl, S, Cu, Pb distribution in patinas), hidden texts and pentimenti (detect Fe in iron-gall ink beneath overpaint, Hg in vermilion underwriting, reveal erased or covered compositions), and authentication (detect modern pigments Ti for titanium white post-1920, Cd for cadmium yellows 19th-century, Zn for zinc white 19th-century, trace contaminants inconsistent with claimed age). The technique is non-destructive for most organic and inorganic heritage materials (X-ray doses manageable with beam control), but requires access to synchrotron facilities (limited: ~50 worldwide, oversubscribed, competitive beam-time proposals), expensive (facility costs $5-50K per day beam time, though often subsidized for academic research), and sample size-limited (few mm to ~50 cm maximum, depends on beamline setup). Despite access challenges, SR-XRF provides unparalleled elemental sensitivity and spatial resolution, uniquely capable of addressing research questions impossible with laboratory techniques—making it the gold standard for micro-elemental analysis of high-value heritage objects when questions justify the investment.",
  "keyApplications": [
    "Ultra-high-resolution pigment mapping (1-10 μm spatial resolution, resolve individual pigment grains, layering, mixtures)",
    "Trace element provenance analysis (ppm-ppb detection: Sr, Rb, Zr, REE in obsidian, ceramics, glass; source discrimination)",
    "Hidden text and image recovery (detect Fe ink, Hg vermilion, Pb white beneath overpaint or erasures; palimpsests, pentimenti)",
    "Corrosion and degradation mapping (sub-micrometer resolution: metal patinas, glass weathering, pigment alterations; nanoscale chemical gradients)",
    "Authentication and forgery detection (identify modern pigments via Ti, Cd, Zn, Ba; trace contaminants; elemental ratios inconsistent claimed period)",
    "Multi-element simultaneous imaging (10-30 elements mapped simultaneously; correlate spatial distributions: Cu + Sn = bronze, Pb + Sn = pewter, Ca + P = bone)"
  ],
  "destructiveness": "non-destructive to minimally destructive (X-ray irradiation doses manageable; organic pigments, colorants may fade if prolonged exposure >hours at high flux; inorganics, metals unaffected; best practice: minimize dose via fast scanning, optimized flux, sample rotation; monitor sensitive samples for radiation damage)",
  "portability": "non-portable (requires synchrotron facility; samples transported to beamline; or portable SR-XRF systems in development using compact light sources, not yet operational heritage applications)",
  "typicalTimePerMeasurement": "Minutes to days per sample (point analysis 1-10 s/spot; line scan 1-10 min; 2D map 100×100 pixels 0.5-5 hours at 0.1-1 s/pixel; large area 10×10 cm @ 10 μm resolution = 10⁸ pixels, days-weeks if full resolution; typically subsample key regions 1-10 mm² @ high resolution)",
  "costRange": {
    "instrument": "$500M-$2B (synchrotron facility construction; 3rd-generation: ESRF €1B, APS $800M, Spring-8 $1.2B; user does not pay construction, accesses via proposals)",
    "perSample": "$5,000-$50,000 per beam-time day (facility operating cost; academic proposals often subsidized/free beam time, competitive; commercial users pay full cost $10-50K/day; typical heritage study 2-5 days beam time = $10-250K if commercial, $0-25K if academic collaborative)"
  },
  "relatedTechniques": [
    "xrf-scanning",
    "sem-eds",
    "raman-spectroscopy",
    "xrd",
    "xanes",
    "la-icp-ms"
  ],
  "fundamentalPhysics": {
    "principle": "X-ray fluorescence (XRF): incident X-ray photon (energy E₀) ejects inner-shell electron (photoelectric effect, binding energy E_B; e.g., K-shell Fe: E_B = 7.1 keV), creating core-hole. Outer-shell electron transitions to fill core-hole, emitting characteristic X-ray fluorescence (energy E_f = E_outer - E_inner; e.g., Fe Kα: L→K transition, E_f = 6.4 keV). Element-specific energies (Moseley's law: E ∝ (Z-σ)², where Z = atomic number, σ = screening constant) enable elemental identification. Fluorescence yield (fraction of core-holes decaying radiatively vs. Auger electrons) increases with Z: low-Z (C, N, O; <1% yield, difficult detect) vs. high-Z (transition metals, heavy elements; 10-90% yield, sensitive detection). **Synchrotron advantage:** (1) **High flux:** Synchrotron 10¹⁰-10¹³ photons/s/μm² (focused beam) vs. X-ray tube 10⁸ photons/s/mm², 10⁴-10⁶× brighter → detect trace elements ppm-ppb (vs. 0.1-1% lab XRF). (2) **Tunability:** Monochromatic beam, energy selectable 5-50 keV typical (adjustable via crystal monochromator: Si(111), Si(220), etc.), optimize excitation: tune just above absorption edge maximizes fluorescence efficiency, reduces background (vs. polychromatic tube: all energies, higher background, less efficient). (3) **Collimation/Focus:** Synchrotron beam naturally collimated (mrad divergence), focused to 0.1-100 μm spot (KB mirrors, Fresnel zone plates) vs. X-ray tube mm-cm spot, pinhole collimation loses 99%+ flux → synchrotron 1-10 μm spatial resolution routine (vs. 50-500 μm best lab XRF). (4) **Polarization:** Synchrotron radiation linearly polarized in orbital plane → detector positioned perpendicular to polarization plane minimizes elastic scatter (Rayleigh, Compton), reduces background, improves signal-to-noise 10-100×. (5) **Coherence:** Partially coherent (spatial, temporal), enables advanced techniques (ptychography, coherent diffraction imaging), though less relevant routine XRF mapping.",
    "physicalPhenomenon": "Synchrotron radiation generation: relativistic electrons (GeV energy, velocity v ≈ c) circulate in storage ring (circumference 100-1000 m, magnetic field bends trajectory). Bending magnets, undulators, wigglers (insertion devices) force electrons to oscillate → accelerated charges emit electromagnetic radiation (synchrotron light, X-rays to visible). **Undulator:** Periodic magnetic structure (period λ_u ~ 1-5 cm, N ~ 50-200 periods), electrons oscillate, emit coherent pulses, interfere constructively → brilliant, quasi-monochromatic X-ray beam (10¹⁹-10²¹ photons/s/mm²/mrad²/0.1%BW, peak at fundamental energy E₁ = (h c²)/(2 λ_u γ²(1 + K²/2)), where γ = Lorentz factor ~10⁴, K = deflection parameter ~1-3). **Focusing optics:** Kirkpatrick-Baez (KB) mirrors (two perpendicular elliptical mirrors, total reflection regime <critical angle θ_c ~ keV/100, focus to 0.1-10 μm spot), Fresnel zone plates (diffractive optics, alternating transparent/opaque rings, focus to 50-500 nm spot, efficiency 10-40%, chromatic aberration), compound refractive lenses (Be, Al lenses; low absorption, focus 1-100 μm), multilayer Laue lenses (MLL, diffraction-based, sub-100 nm focus, cutting-edge). Sample positioned at focus, raster-scanned (piezo stages nm precision, or motor stages μm precision), X-ray fluorescence collected each position (dwell time 0.01-10 s/pixel, depending on flux, concentration), energy-dispersive detector (SDD: energy resolution 120-150 eV FWHM @ 5.9 keV, efficiency 80-95% 1-20 keV, count rate 10⁴-10⁶ cps) records spectrum → software deconvolves overlapping peaks (PyMca, MAPS, XRF-Maps), extracts elemental intensities, generates 2D maps (false-color: each element assigned color, RGB composites show co-localization).",
    "equations": [
      {
        "latex": "$$E_f = E_{\\text{outer}} - E_{\\text{inner}} = h\\nu$$",
        "description": "Characteristic X-ray Fluorescence Energy (element-specific, transition-specific)",
        "variables": [
          {"symbol": "E_f", "meaning": "fluorescence photon energy (characteristic line: Kα, Kβ, Lα, etc.)", "units": "keV (typical heritage: 1-40 keV)"},
          {"symbol": "E_{\\text{outer}}, E_{\\text{inner}}", "meaning": "binding energies of outer and inner electron shells (e.g., L-shell, K-shell)", "units": "keV"},
          {"symbol": "h\\nu", "meaning": "Planck constant × frequency (emitted X-ray photon)", "units": "keV"}
        ]
      },
      {
        "latex": "$$I_f = I_0 \\cdot \\Omega \\cdot \\epsilon \\cdot \\sigma_{\\text{photo}} \\cdot \\omega \\cdot C \\cdot \\rho \\cdot t \\cdot e^{-\\mu(E_0) \\rho t} \\cdot e^{-\\mu(E_f) \\rho t / \\cos\\theta}$$",
        "description": "XRF Intensity (fluorescence signal proportional to concentration, simplified absorption model)",
        "variables": [
          {"symbol": "I_f", "meaning": "detected fluorescence intensity (counts/s for element)", "units": "cps (counts per second)"},
          {"symbol": "I_0", "meaning": "incident X-ray flux (photons/s on sample)", "units": "photons/s (synchrotron: 10¹⁰-10¹³)"},
          {"symbol": "\\Omega", "meaning": "solid angle of detector (fraction of 4π collected)", "units": "sr (steradians, typical 0.01-0.1 sr for close detector)"},
          {"symbol": "\\epsilon", "meaning": "detector efficiency (energy-dependent, SDD 80-95% @ 1-20 keV)", "units": "fraction, 0-1"},
          {"symbol": "\\sigma_{\\text{photo}}", "meaning": "photoionization cross-section (element, shell-specific; cm²/g typical)", "units": "cm²/g or barns/atom"},
          {"symbol": "\\omega", "meaning": "fluorescence yield (fraction core-holes emit X-rays vs. Auger; Z-dependent, 0.01-0.9)", "units": "fraction, 0-1"},
          {"symbol": "C", "meaning": "elemental concentration (mass fraction or atoms/volume)", "units": "g/g, ppm, or atoms/cm³"},
          {"symbol": "\\rho", "meaning": "sample density", "units": "g/cm³"},
          {"symbol": "t", "meaning": "sample thickness (or interaction depth if thin)", "units": "μm or cm"},
          {"symbol": "\\mu(E)", "meaning": "mass attenuation coefficient @ energy E (incident E₀ or fluorescence E_f)", "units": "cm²/g"},
          {"symbol": "\\theta", "meaning": "detector take-off angle (angle between sample surface and detector)", "units": "degrees (typically 30-90°)"}
        ]
      },
      {
        "latex": "$$\\text{Detection Limit (DL)} \\approx 3 \\times \\frac{\\sqrt{N_{\\text{bg}}}}{S / C}$$",
        "description": "Detection Limit (minimum detectable concentration, 3σ criterion)",
        "variables": [
          {"symbol": "\\text{DL}", "meaning": "detection limit (minimum concentration detectable above background)", "units": "ppm, ppb, or μg/g"},
          {"symbol": "N_{\\text{bg}}", "meaning": "background counts under peak (Compton, Rayleigh scatter, Bremsstrahlung)", "units": "counts"},
          {"symbol": "S", "meaning": "net peak signal (counts from element of interest)", "units": "counts"},
          {"symbol": "C", "meaning": "known concentration (for calibration standard)", "units": "ppm or wt%"}
        ]
      },
      {
        "latex": "$$d_{\\text{focus}} \\approx 1.22 \\frac{\\lambda}{\\text{NA}} \\quad \\text{or} \\quad d_{\\text{KB}} \\approx \\frac{s \\cdot f}{L}$$",
        "description": "Focused Spot Size (diffraction-limited for zone plate, geometric for KB mirrors)",
        "variables": [
          {"symbol": "d_{\\text{focus}}", "meaning": "focused X-ray spot diameter (spatial resolution)", "units": "nm to μm"},
          {"symbol": "\\lambda", "meaning": "X-ray wavelength (λ = hc/E; 10 keV → 0.124 nm)", "units": "nm"},
          {"symbol": "\\text{NA}", "meaning": "numerical aperture of focusing optic (zone plate: ~10⁻³-10⁻²)", "units": "dimensionless"},
          {"symbol": "s, f, L", "meaning": "KB mirror: source size, focal length, source-to-mirror distance", "units": "μm, m, m"}
        ]
      },
      {
        "latex": "$$t_{1/2} = \\frac{\\ln(2)}{\\mu} \\approx \\frac{0.693}{\\mu}$$",
        "description": "Attenuation Depth / Penetration Depth (approximate, 1/e or 50% intensity reduction)",
        "variables": [
          {"symbol": "t_{1/2}", "meaning": "depth at which X-ray intensity reduced to 50% (approximate penetration depth)", "units": "μm to mm"},
          {"symbol": "\\mu", "meaning": "linear attenuation coefficient (μ = μ_mass × ρ)", "units": "cm⁻¹"},
          {"symbol": "\\text{Example}", "meaning": "10 keV X-rays in paint (ρ~2 g/cm³, μ_mass ~10 cm²/g): t_1/2 ~ 300 μm; 20 keV: t_1/2 ~ 2 mm; higher energy penetrates deeper", "units": "N/A"}
        ]
      }
    ],
    "interactionDepth": {
      "description": "X-ray penetration depth in heritage materials depends on incident energy and sample composition (attenuation coefficient μ). For heritage typical: **Low-Z organics** (paper, parchment, wood: C, H, O dominant; ρ ~0.5-1.5 g/cm³): 10 keV X-rays penetrate ~1-5 mm, 20 keV ~5-20 mm (weakly attenuating, deep penetration). **Medium-Z inorganics** (ceramics, pigments: Si, Ca, Fe; ρ ~2-4 g/cm³): 10 keV ~200-500 μm, 20 keV ~1-3 mm. **High-Z metals** (Pb, Cu, Ag, Au; ρ ~8-20 g/cm³): 10 keV ~5-50 μm, 20 keV ~50-300 μm (strongly attenuating, shallow penetration). **Consequence:** SR-XRF typically probes surface/near-surface (10-500 μm depending on material, energy), not true bulk technique (unlike neutron activation analysis which penetrates cm-mm). For layered samples (paintings: 20-200 μm thick paint over ground), incident X-rays penetrate entire layer stack (if <penetration depth), fluorescence from all layers detected simultaneously (depth integration, not depth-resolved; unlike OCT, confocal μ-XRF with confocal optics can improve depth resolution but rare). **Fluorescence escape depth:** Secondary consideration: fluorescence photon (e.g., Fe Kα 6.4 keV) must escape sample to reach detector; attenuation during escape (self-absorption) reduces signal, especially for low-energy lines (Kα of low-Z elements) in high-Z matrices. Effective sampling depth ~1-3× attenuation length for fluorescence energy (typically 10-100 μm heritage materials for Kα lines of interest: Fe, Cu, Zn, Pb). **Grazing-incidence / grazing-exit geometries:** Advanced setups use grazing angles (<1-5°) to confine interaction to surface 10-100 nm depth (total-reflection XRF, TXRF; surface-sensitive, reduces substrate signal); less common heritage (most SR-XRF beamlines use near-normal incidence 30-90°, bulk-representative sampling).",
      "materialSpecific": [
        {"material": "Paintings (oil, tempera on canvas/panel)", "penetrationDepth": "100-500 μm (incident 10-20 keV; through paint layers 20-200 μm, into ground/substrate)", "visualizedFeatures": "Elemental distribution all layers (integrated depth: surface paint + intermediate + ground + substrate if thin; e.g., Fe from umber pigment surface + Fe from ochre in ground → overlapping signals, interpreted via context, concentration, co-localization with other elements)"},
        {"material": "Manuscripts, parchment (ink on collagen)", "penetrationDepth": "1-5 mm (parchment low-Z, weakly attenuating; 10-20 keV penetrates entire thickness 100-500 μm)", "visualizedFeatures": "Fe in iron-gall ink (surface + subsurface penetration ~10-100 μm into parchment), Hg in vermilion, Ca in parchment collagen matrix (background)"},
        {"material": "Ceramics, pottery (clay body + glaze)", "penetrationDepth": "200-1000 μm (glaze 50-300 μm, ceramic body mm-scale; 10 keV penetrates glaze + 200 μm body, 20 keV deeper)", "visualizedFeatures": "Glaze elements (Pb, Sn, Cu, Co colorants) vs. body (Fe, Ca, Al clays); depth-integrated, but glaze signal stronger (surface enrichment, less self-absorption)"},
        {"material": "Metals (bronze, silver, gold; corrosion layers)", "penetrationDepth": "10-300 μm (10 keV in Cu: ~40 μm, 20 keV ~200 μm; high-Z, strong attenuation)", "visualizedFeatures": "Surface corrosion (Cu₂O, CuCl₂, patinas 1-100 μm thick: Cu, Cl, S, O gradients), substrate metal (Cu, Sn, Pb bulk; detected if corrosion thin or X-ray energy high). Confocal μ-XRF (with polycapillary or zone plate confocal setup) can depth-resolve corrosion layers ~5-50 μm resolution."},
        {"material": "Glass (ancient, stained glass, beads)", "penetrationDepth": "0.5-5 mm (10-20 keV; glass intermediate density ~2.5 g/cm³, SiO₂-based)", "visualizedFeatures": "Bulk composition (Si, Ca, Na, K glass network), colorants (Cu, Co, Mn, Fe), weathering (surface depletion Na, K, enrichment Ca, Si in 10-100 μm surface layer from leaching; depth-integrated signal, but surface-weighted)"},
        {"material": "Stone, marble (sculpture, architecture)", "penetrationDepth": "0.5-3 mm (calcite CaCO₃, dolomite; low-medium attenuation)", "visualizedFeatures": "Mineral composition (Ca, Mg, Fe, Si, Al), trace elements (Sr, Ba, REE for provenance), weathering (gypsum CaSO₄ surface layer from atmospheric sulfation, 10-500 μm thick: S enrichment, Ca depletion)"}
      ]
    },
    "spatialResolution": {
      "lateral": "0.1-100 μm typical (beam spot size determines resolution). **State-of-art:** 50-100 nm (nanoprobe beamlines: APS 26-ID-C Bionanoprobe, ESRF ID16B, Spring-8 BL29XU; zone plate or MLL focusing, research-level). **Routine high-resolution:** 1-10 μm (many beamlines: APS 2-ID-D, ESRF ID21, SSRL 2-3, Diamond I18; KB mirrors, adequate most heritage applications: pigment grains 5-50 μm, brushstrokes 100-500 μm, resolve easily). **Standard resolution:** 10-100 μm (older beamlines, or intentionally larger beam for faster mapping, less radiation dose; still excellent vs. lab XRF 50-500 μm). **Macro-XRF:** 0.1-5 mm (large-area scanning, paintings, murals; polycapillary focusing or collimation; fast, lower resolution, complementary to high-res μ-XRF selected details). Choice depends on question (pigment grain detail: 1-5 μm needed; overall composition painting: 50-500 μm adequate, faster).",
      "depth": "Not depth-resolved in standard transmission/fluorescence mode (integrates over penetration depth 10-500 μm). **Confocal μ-XRF:** Depth resolution ~5-50 μm (polycapillary or zone plate confocal optics: incident + fluorescence beams focused same point in 3D; scan Z-axis, reconstruct depth profile; specialty, few beamlines: ESRF ID13, APS 2-ID-D; time-consuming: 1-10 hours per depth profile 10-50 slices). **Grazing-incidence/exit:** Surface-sensitive 10-100 nm depth (shallow angle <1-5°, total reflection confines interaction; surface weathering, corrosion, contamination studies; rare heritage, research-level). **X-ray absorption tomography (complementary):** If transmission imaging available (sample <mm thick, e.g., cross-sections, fragments): XRF-CT (fluorescence computed tomography) reconstructs 3D elemental distribution, voxel resolution ~0.5-10 μm; requires sample rotation, transmission, advanced reconstruction; powerful but uncommon heritage (sample size, time constraints).",
      "limitingFactors": [
        "Beam spot size (focusing optics quality, X-ray energy: shorter wavelength diffracts less, focuses smaller; trade-off: high energy better focus but worse low-Z sensitivity)",
        "Sample positioning precision (piezo stages nm-scale, motor stages μm-scale; sample vibration, drift during hours-long scan degrades resolution; monitor, correct via fiducial markers or on-the-fly image registration)",
        "Detector solid angle vs. distance (close detector improves count rate but may limit spatial resolution if detector pixel cross-talk or large active area subtends multiple sample pixels; far detector better spatial definition but lower efficiency; optimize: collimated detector, small active area SDD)",
        "Radiation damage (organic pigments, dyes fade if beam too intense, prolonged; limit flux, scan speed, cryogenic cooling if available; balance: resolution vs. damage)",
        "Sample flatness (if sample warped, tilted: focus changes, resolution degrades off-optimal plane; use confocal optics, or tilt-correction, or accept degradation edges)"
      ]
    },
    "sensitivity": {
      "description": "Detection limits synchrotron XRF: **1-100 ppm (μg/g)** typical for transition metals (Fe, Cu, Zn, Mn) in light matrices (organics, silicates; 10-20 keV excitation, 1-10 s/pixel, 10¹¹-10¹² photons/s beam flux). **10-1000 ppb (ng/g)** achievable for favorable conditions: high-Z elements (Pb, Hg, As, Sr, Rb, Zr, Y, rare earths) in low-Z matrices (carbon, organics; reduced background), long count times (10-100 s/pixel), optimized energy (tune just above edge, e.g., Pb L₃ 13.0 keV excitation for Pb Lα 10.6 keV detection, maximize cross-section). **Comparison to lab XRF:** Lab (tube-based, 50-500 μm spot, polychromatic, low flux): detection limits 0.01-1 wt% (100-10,000 ppm) for most elements, 10-100 ppm for favorable (high-Z in light matrix, long count). Synchrotron 10-1000× better sensitivity (high flux, low background from polarization + monochromaticity, focused beam concentrates flux). **Comparison to other techniques:** ICP-MS (solution, destructive): ppb-ppt (superior bulk sensitivity, but requires dissolution, loses spatial info). LA-ICP-MS (laser ablation): 0.1-10 ppm, 10-100 μm spots (destructive, ablates material; complementary if ablation acceptable). SIMS (secondary ion MS): ppb-ppm, 0.1-10 μm spots (destructive, sputters surface; ultra-high sensitivity but damages). PIXE (particle-induced XRF, protons/alphas): 1-100 ppm, 1-10 μm spots (non-destructive, good sensitivity, but accelerator access similar issues as synchrotron, less common). SR-XRF unique: combines high sensitivity (ppm-ppb) + high spatial resolution (1-10 μm) + non-destructive (manageable doses) + multi-element simultaneous (10-30 elements in single scan); no other technique matches this combination (trade-offs: ICP-MS more sensitive bulk, SEM-EDS faster imaging but less sensitive, SIMS more sensitive point but destructive, etc.)."
    }
  },
  "instrumentation": {
    "source": {
      "type": "Synchrotron radiation: relativistic electrons (1-8 GeV typical 3rd-generation rings) in storage ring (circumference 100-1500 m), bending magnets + insertion devices (undulators, wigglers) generate X-rays. **3rd-generation synchrotrons:** Optimized undulator beamlines, low emittance (beam divergence, size), high brilliance 10¹⁹-10²¹ photons/s/mm²/mrad²/0.1%BW. Examples: APS (USA, 7 GeV, 1104 m circumference, 1996-present; upgrade 2024+ to 4th-generation multi-bend achromat, 100× brilliance increase), ESRF (France, 6 GeV, 844 m, 1994-present; upgraded 2020 EBS, 4th-generation), Spring-8 (Japan, 8 GeV, 1436 m, 1997-present), Diamond (UK, 3 GeV, 562 m, 2007-present), PETRA III (Germany, 6 GeV, 2304 m, 2010-present). **4th-generation (upgrade trend 2020s-2030s):** Multi-bend achromat (MBA) lattices, ultra-low emittance, 10-100× brilliance increase, even smaller focused spots (10-50 nm routine?), faster scans (same quality in 1/10 time), higher sensitivity. **Compact/tabletop synchrotrons (future):** Laser-plasma acceleration, inverse Compton scattering (ICS) sources; under development, not yet operational heritage applications; promise: university-scale, $10-50M vs. $500M-2B facility, but lower flux, less mature.",
      "specifications": "Typical undulator beamline heritage XRF: **Energy range:** 5-40 keV (tunable via monochromator; higher energies available some beamlines 60-100 keV for heavy elements, thick samples, but less common). **Flux:** 10¹¹-10¹³ photons/s focused beam (at sample position, focused spot; unfocused 10¹³-10¹⁵ photons/s total, but spread over larger area). **Bandwidth:** ΔE/E ~ 10⁻⁴ (monochromatic, Si(111) double-crystal monochromator typical; narrower 10⁻⁵ if Si(220) or multilayer monochromator, but lower flux). **Spot size:** 0.1-100 μm (depends on focusing optics: KB mirrors 1-10 μm routine, zone plates 50-500 nm research-level, unfocused/collimated 0.1-5 mm for macro). **Polarization:** Linear, horizontal plane (in-plane with storage ring orbit; used for background reduction: detector perpendicular minimizes elastic scatter). **Divergence:** <1 mrad (highly collimated, easier focus than divergent X-ray tube).",
      "powerRange": "Beam power at sample: ~1-100 mW (10¹² photons/s @ 10 keV = 1.6 pJ/photon × 10¹² = 1.6 mW; manageable thermal load, though can heat/damage sensitive organics if prolonged; cryogenic cooling (liquid N₂, 77 K) optional to reduce radiation damage, slow fading). Total beamline power (white beam, before monochromator): kW-scale (absorbed by monochromator, beamline optics; heavy water-cooling required; not relevant sample, shielded)."
    },
    "detector": {
      "type": "Energy-dispersive X-ray detector (most common SR-XRF): **Silicon Drift Detector (SDD):** Multi-element (1-4 elements typical, up to 100+ for Maia detector array), thermoelectrically cooled (-20 to -50°C, Peltier), active area 7-80 mm² per element, energy resolution 120-150 eV FWHM @ 5.9 keV (Mn Kα), count rate 10⁴-10⁶ cps per element (pulse processing limits, depends on electronics: digital pulse processors handle higher rates). Examples: Vortex-EM (SII/Hitachi, 4-element), Maia detector (CSIRO/BNL, 384-element array; massive solid angle ~1.2 sr, ultra-fast, developed for XRF-CT, fluorescence tomography). **Wavelength-dispersive spectrometer (WDS, rare SR-XRF):** Crystal analyzer (curved crystal Bragg reflection, wavelength selection via angle), scanning monochromator, energy resolution 1-10 eV (10-100× better than SDD, resolve overlapping peaks: Kα₁ from Kα₂, etc.), but slow (scan wavelengths sequentially, minutes per element), low solid angle (mrad-scale, poor collection efficiency). Used when energy resolution critical (trace element detection with severe peak overlap, e.g., As Kα 10.54 keV overlaps Pb Lα 10.55 keV, SDD cannot resolve, WDS can). **Proportional counter, scintillator (obsolete):** Older beamlines, poor energy resolution 10-50% FWHM, not used modern heritage XRF.",
      "spectralRange": "Detectable elements: **SDD practical range:** Na (Z=11, Kα 1.04 keV) to U (Z=92, Lα 13-17 keV); low-Z cutoff by detector window (Be window 8-12 μm thick, absorbs <1 keV), high-Z limited by fluorescence energy vs. incident energy (need E₀ > E_edge, typically incident 10-40 keV covers up to Z~80 L-lines, Z~40 K-lines). **Heritage-relevant elements typically detected:** Ca, Ti, V, Cr, Mn, Fe, Co, Ni, Cu, Zn (K-lines 3.7-9.7 keV), As, Se, Br, Rb, Sr, Y, Zr (K-lines 10-17 keV), Ag, Cd, Sn, Sb (K-lines 22-30 keV, requires higher incident energy 30-50 keV), Hg, Pb, Ba (L-lines 9-15 keV, easier detect than K-lines 70-90 keV). Light elements (C, N, O, F, Na, Mg, Al, Si, P, S, Cl) difficult: low fluorescence yield, low energy (absorbed detector window, sample self-absorption); require windowless detectors (UHV chambers, complex) or optimized low-energy systems (few beamlines: ESRF ID21, APS 2-ID-E; detect down to C Kα 0.28 keV, N Kα 0.39 keV, but noisy, high background, less routine). **Multi-element detection:** SDD records full spectrum simultaneously (all elements in 0.5-40 keV range, single exposure); major advantage vs. sequential techniques (WDS, XRD, XANES scans one element/edge at a time).",
      "efficiency": "SDD efficiency: 80-95% @ 1-20 keV (good match heritage elements: Fe, Cu, Zn, Pb L-lines), drops <50% @ >30 keV (Si detector thickness 300-500 μm, transmission increases high energy; thicker detectors or Cd-Te/CZT for >30 keV, less common). Be window (8-12 μm) absorbs 10-50% @ 1-3 keV (limits light element detection: Mg, Al, Si difficult; windowless improves but rare). Solid angle: Single SDD (7-30 mm² active area, positioned 1-10 cm from sample) subtends 0.001-0.1 sr (0.02-2% of 4π); Maia array (384 elements, close-packed, 1-2 cm distance) ~1.2 sr (~10% of 4π, 100× more than single SDD, massive count rate, fast mapping, specialized beamlines APS 2-ID-E, Spring-8 BL37XU). Trade-off: close detector (high solid angle, high counts, but may obstruct sample manipulation, restrict geometry) vs. far detector (lower counts, cleaner geometry for sample rotation, transmission imaging).",
      "resolution": "Energy resolution: SDD 120-150 eV FWHM @ 5.9 keV (Mn Kα; worsens slightly higher energy: 150-180 eV @ 15 keV). Sufficient resolve most heritage elements: Fe Kα 6.40 keV, Cu Kα 8.05 keV, Zn Kα 8.64 keV (separable: peaks 640 eV apart, 4-5× SDD resolution, clean separation). **Problematic overlaps:** As Kα 10.54 keV / Pb Lα 10.55 keV (10 eV apart, SDD 150 eV resolution cannot resolve; deconvolve via peak fitting if both present, or avoid: measure Pb Lβ 12.6 keV separately, or use WDS), Hg Lα 9.99 keV / Zn Kα 8.64 keV (well separated, no issue), Pb Mα 2.35 keV / S Kα 2.31 keV (40 eV apart, SDD borderline; usually S signal stronger if present, Pb Mα weak, interference minor). Detector calibration critical: energy scale (keV per channel) calibrated using known standard (Fe, Cu foils; multi-point calibration, linear fit, residuals <10 eV), checked periodically (daily if precision required)."
    },
    "opticalSystem": {
      "components": [
        "**Monochromator:** Double-crystal monochromator (DCM, channel-cut common): two Si(111) or Si(220) crystals, Bragg diffraction selects energy (E = hc/(2 d sinθ), where d = lattice spacing Si(111) 3.135 Å, θ = Bragg angle 5-80° typical for 5-40 keV), bandwidth ΔE/E ~ 10⁻⁴ (Si(111)) or 10⁻⁵ (Si(220), narrower but lower flux). Liquid-N₂ cooling first crystal (absorbs kW heat from white beam, thermal distortion reduces resolution if uncooled). Stabilization (temperature, vibration) essential (energy drift <0.1 eV during hours-long scan, critical for XANES/EXAFS if combined with XRF mapping, less critical pure XRF).",
        "**Focusing optics:** **Kirkpatrick-Baez (KB) mirrors** (two perpendicular elliptical mirrors, total external reflection, 1-10 μm focus routine, 0.5-1 μm achievable excellent optics, acceptance mrad solid angle, efficiency 50-90% @ 5-30 keV depending on coating: Pt, Rh, or Si; most common heritage XRF, robust, stable, adjustable). **Fresnel Zone Plate (FZP)** (diffractive, alternating opaque/transparent rings, 50-500 nm focus, efficiency 10-40% first order, chromatic aberration requires matching to specific energy, fragile (Au structures on Si₃N₄ membrane), used nanoprobe research, less routine heritage due to complexity, sample damage risk focused intensity). **Compound Refractive Lenses (CRL)** (Be, Al, or polymer lenses, stack 10-100 lenses, 1-100 μm focus, efficiency 30-70%, chromatic, simpler than zone plates, increasingly used). **Polycapillary optics** (bundle glass capillaries, total reflection guides, 5-50 μm focus, moderate efficiency 10-50%, compact, used lab XRF and some SR beamlines, confocal geometry possible (incident + fluorescence polycapillaries focused same point, depth resolution)).",
        "**Sample stage:** Precision positioning essential: **Piezo stages** (capacitive or inductive feedback, nm-scale precision, 100 μm - 1 mm travel, fast (ms settle), used high-resolution raster scans <1×1 mm). **Motor stages** (stepper or servo, encoder feedback, μm precision, cm-dm travel, slower (seconds settle), used larger areas >1×1 mm, or coarse positioning then piezo fine). **Rotation stages** (sample rotation, tomography XRF-CT, or change angle for grazing-incidence). **Tilt stages** (adjust sample normal to beam, optimize signal, reduce shadowing). Vibration isolation (beamline floor vibration nm-scale, degrades focus; active isolation or passive (granite tables, pneumatic mounts)). Laser interferometer positioning (optional, ultra-high precision, real-time feedback correct drift).",
        "**X-ray optics alignment:** In-line: white beam from undulator → slits (define beam size, divergence, typically 0.1-5 mm) → monochromator (energy selection) → focusing optics (KB mirrors, zone plate, etc.) → sample (at focus) → detector (positioned perpendicular polarization plane if possible, 90° to beam direction, distance 1-10 cm sample depending on solid angle vs. geometry constraints). Beamstop (absorbs transmitted direct beam, protects detector if sample thin or absent; necessary if transmission imaging, otherwise optional). Ion chambers (monitor beam intensity before/after sample; normalize fluorescence signal to beam flux variations, essential quantitative analysis).",
        "**Flight path considerations:** Atmosphere (air, He, vacuum): X-rays <5 keV strongly absorbed air (O, N K-edges; 1 keV attenuates 90% in 10 cm air); He-filled flight paths (low Z, transparent) or vacuum (10⁻³-10⁻⁶ mbar) needed low-energy XRF (light elements); higher energies (5-40 keV) air acceptable (1 m path <10% absorption @ 5 keV, <1% @ 10 keV, negligible >20 keV). Most heritage beamlines air (sample in air, ambient pressure, easy handling) with optional He flush or vacuum chamber for low-energy work.",
        "**Detectors positioning:** Perpendicular to beam (horizontal scattering plane) minimizes Rayleigh scatter (polarization plane horizontal, scattered intensity ∝ (1 + cos²θ), minimum @ θ=90°); reduces background, improves signal-to-noise 10-100×. Some beamlines: detector @ 90° fixed, sample rotates; others: detector adjustable, optimize geometry per sample. Annular detector geometries (ring around beam, large solid angle but shadowing complex samples) less common, mostly Maia array specialized beamlines.",
        "**Cryogenic sample cooling (optional):** Liquid N₂ cryo-stream (Oxford Cryosystems, Cryojet; 77-300 K, adjustable), reduces radiation damage organics (dyes, binders; fading rates decrease 10-100× at 77 K vs. 300 K, thermal activation minimized). Challenges: ice formation (condensation on cold sample, requires N₂ purge, humidity control), sample thermal shock (fragile materials crack; slow cooling ramp), complexity (adds 30-60 min setup). Used when radiation-sensitive samples, prolonged exposure (>hours), or frozen-hydrated samples (cells, tissues; not typical heritage but biological remains, mummies, etc.)."
      ],
      "beamPath": "Synchrotron undulator → shutter → slits → monochromator (DCM) → mirrors (focusing: KB or other) → slits (clean up focus, define spot) → ion chamber #1 (monitor incident flux) → sample (at focus, raster-scanned) → (transmitted beam: ion chamber #2 or beamstop) + (fluorescence 90°: SDD detector, records spectrum each pixel) → data acquisition system (DAQ, synchronized scan motors, detector, records position + spectrum + ion chamber normalization). Feedback loops: monochromator auto-tuning (DCM detuning compensates crystal thermal drift, maintains energy), ion chambers normalize flux (divide fluorescence by I₀ corrects undulator decay, monochromator angle changes).",
      "focusing": "Beam focused to 1-10 μm spot (KB mirrors) or 50-500 nm (zone plate) at sample position (focal plane). Sample positioned at focus via: (1) initial alignment (laser alignment, optical microscope, position sample feature of interest under beam), (2) XRF scan test (coarse raster, e.g., 10×10 grid 100 μm step, identify feature via elemental contrast), (3) fine-focus verification (scan across sharp edge, measure spatial response function, confirms focus quality, adjust mirrors if needed), (4) maintain focus during scan (active focus feedback if sample tilted/warped, or assume flat, accept defocus degradation edges if sample large >mm and not perfectly flat). Depth of focus (DOF, Rayleigh criterion): DOF ~ ±2×(spot size)² / λ ~ ±1-10 μm for 1-10 μm spot @ 10 keV (λ = 0.12 nm); sample must be flat within DOF or scan Z-axis (slow, uncommon) or use confocal optics (DOF = depth resolution, 5-50 μm)."
    },
    "criticalComponents": [
      "High-brilliance undulator (X-ray source quality determines flux, focus; upgrade to 4th-generation storage ring 10-100× brilliance gain, step-change capability)",
      "Monochromator stability (energy drift <0.1 eV during scan; thermal, mechanical drifts degrade energy resolution, especially critical if XANES/EXAFS combined with XRF; active stabilization, high-quality DCM essential)",
      "Focusing optics quality (KB mirrors: figure error <1 nm rms, roughness <0.5 nm rms, coating uniformity; determines spot size, intensity distribution; state-of-art mirrors expensive $50-200K pair but enable sub-micron focus)",
      "Detector efficiency and solid angle (SDD close to sample, multi-element or large-area array increases count rate 10-100×; Maia detector game-changer for fast mapping but rare, specialized beamlines)",
      "Sample positioning precision and stability (piezo stages nm-scale, sub-μm spot size requires sub-μm positioning; vibration isolation, drift correction, real-time monitoring via cameras, interferometry)"
    ],
    "typicalConfiguration": "**Standard microprobe beamline (e.g., APS 2-ID-D, ESRF ID13, Spring-8 BL37XU):** Undulator source (2.4 m period typical, 100-150 periods, 5-30 keV tunable). DCM Si(111) monochromator (ΔE/E 10⁻⁴). KB mirrors (Pt-coated, 1-3 μm focus FWHM, 200 mm focal length, 5-20 keV optimized). Sample stage: piezo XYZ (100×100×100 μm³ travel, nm resolution) + motor XYZ (cm-scale coarse). Detectors: 4-element Vortex-EM SDD (positioned 90° perpendicular beam, 2-5 cm from sample, solid angle ~0.01-0.05 sr, total count rate 10⁵-10⁶ cps manageable). Ion chambers before/after sample (N₂-filled, 10 cm length, monitor flux). Optical microscope (10-50× magnification, co-axial with X-ray beam, camera, view sample during alignment, select ROIs). Sample environment: ambient air (easiest), or He-filled bag (low-energy work), or vacuum chamber (light elements). Data acquisition: Epics (Experimental Physics and Industrial Control System, standard synchrotron control software) + custom scripts (Python: spec, BlueSky), synchronized motor scan + SDD acquisition (fly-scan mode: continuous motor motion + continuous detector readout, faster than step-scan, or step-scan if need precise dwell per pixel). Typical parameters heritage XRF map: **Energy:** 15-20 keV (excite K-lines Fe, Cu, Zn, Pb; L-lines Hg, Pb, Ba), **spot size:** 2-5 μm (KB mirrors), **step size:** 2-10 μm (match or slightly oversample spot for full coverage), **dwell time:** 0.1-1 s/pixel (balance: longer dwell more counts, better statistics, slower; shorter faster, noisier; adjust based on concentration, element of interest), **map area:** 0.5×0.5 mm to 5×5 mm (100×100 to 500×500 pixels typical; larger areas possible but time-prohibitive: 1000×1000 @ 1 s/pixel = 278 hours), **total time:** 1-10 hours per map (0.5 mm² @ 0.1 s/pixel, 2 μm step = 62,500 pixels × 0.1 s = 1.7 hr + overhead 20% = 2 hr; 5 mm² @ 1 s/pixel, 5 μm step = 1 million pixels × 1 s = 278 hr impractical → subsample: coarse survey 20-50 μm step 1-10 hr, then zoom high-res selected features 2-5 μm step 1-5 hr each). **Advanced beamlines (nanoprobe):** Zone plate focus 50-200 nm (APS 26-ID-C, ESRF ID16B), piezo stages 0.1 nm resolution, Maia detector or fast SDD arrays, fly-scan 100-1000 pixels/s acquisition (vs. 1-10 pixels/s step-scan), same map area 10-100× faster, enables larger high-res areas. Research-level, competitive access, cutting-edge applications (nanoscale pigment mixing, single-grain trace elements, individual fiber analysis textiles).",
    "facilityRequirements": {
      "space": "Synchrotron facility: 10-100 acre site (storage ring building, experimental halls, offices, infrastructure). Beamline: 20-50 m length (from source point to endstation), experimental hutch 5×10 m typical (radiation shielding: 1-2 m concrete or Pb-lined walls, interlock doors, safety systems). Sample preparation lab (adjacent or nearby): 20-100 m², clean room optional (particle contamination affects XRF trace elements, wipe samples, handle in HEPA-filtered environment), microscopy (optical, SEM for pre-characterization), sample mounting (epoxy, pins, tapes, cryogenic if needed).",
      "utilities": ["Electrical: MW-scale facility (accelerators, magnets, RF, cooling; 10-50 MW typical 3rd-generation; beamline 10-100 kW local including detector electronics, motors, computers, HVAC).", "Cooling: Deionized water (closed-loop, chillers, kW-MW heat loads; monochromator cooling critical, beamline optics, detector Peltier coolers).", "Compressed air, N₂, He gases (pneumatics, sample environments, cryogenic systems, ion chambers).", "HVAC: Temperature stability ±0.5°C (experimental hutch, optics drift with temperature), humidity control 30-60% RH (prevent condensation optics, ice on cold samples)."],
      "environmental": ["Radiation safety: X-ray beamline Class 4 laser equivalent (can cause injury, interlocks required). Shielding (concrete, Pb), personnel dosimetry (badges), training (users certified radiation safety). Hutch interlocks (doors closed during beam-on, search procedures, emergency stops, cameras monitor hutch, no personnel inside during operation).", "Vibration isolation: <10 nm rms floor vibration (sub-μm focus requires; passive isolation (beamline separated from experimental hall floor vibration, independent foundation) or active (feedback-controlled isolators)). Nearby traffic, machinery, seismic noise sources minimized.", "Clean conditions: Dust, particulates settle on optics (degrade focus, scatter), samples (contamination affects trace element analysis). HEPA-filtered HVAC, minimize opening hutch, clean protocols (compressed air, isopropanol wipes).", "Temperature, humidity: Stable (±0.5°C, 40-60% RH; monochromator, optics sensitive thermal expansion, water vapor absorption X-rays <5 keV)."]
    },
    "commercialSystems": [
      {
        "vendor": "Synchrotron Facilities (public access via proposals)",
        "modelName": "APS (Advanced Photon Source, Argonne National Lab, USA)",
        "specifications": "7 GeV storage ring, 1104 m circumference, 3rd-generation (upgrade 2024+ to 4th-generation MBA). Heritage-relevant beamlines: 2-ID-D (microprobe, 0.8 μm spot, 4-27 keV), 2-ID-E (Maia detector, fast mapping), 20-ID-B (higher energy, 10-100 keV). Proposal-based access (General User proposals, 6-month cycles, 2-5 days typical allocation if accepted, ~30% acceptance rate competitive). Free beam time for academic research (facility DOE-funded), travel support (lodging, $500-1500 per trip). Commercial rates: $6,000-$10,000 per 8-hour shift.",
        "approximateCost": "$0 (academic collaborative) to $40,000 (5-day commercial) per beam-time session",
        "url": "https://www.aps.anl.gov"
      },
      {
        "vendor": "Synchrotron Facilities (Europe)",
        "modelName": "ESRF (European Synchrotron Radiation Facility, Grenoble, France)",
        "specifications": "6 GeV storage ring (EBS 2020 upgrade, 4th-generation, 100× brilliance increase), 844 m circumference. Heritage beamlines: ID21 (scanning microscopy, 0.5-8 keV light elements + 4-14 keV), ID13 (nanoprobe, 200 nm focus, confocal, 12-25 keV), ID16B (nanoprobe, 50 nm focus, 17 keV). EU-based users: free beam time via proposals (2-year program, rolling deadlines). Non-EU: collaborative or fee-based ($8,000-15,000 per day).",
        "approximateCost": "$0 (EU academic) to $80,000 (5-day non-EU commercial)",
        "url": "https://www.esrf.fr"
      },
      {
        "vendor": "Synchrotron Facilities (Japan)",
        "modelName": "Spring-8 (Super Photon ring-8 GeV, Hyogo, Japan)",
        "specifications": "8 GeV storage ring, 1436 m circumference, 3rd-generation. BL37XU (trace element mapping, 1 μm spot, Maia detector, fast mapping), BL47XU (XAFS + XRF, 5-37 keV). Proposal-based (domestic priority, international accepted but competitive).",
        "approximateCost": "$0 (academic proposal) to $50,000 (commercial 5-day)",
        "url": "http://www.spring8.or.jp/en"
      },
      {
        "vendor": "Synchrotron Facilities (UK)",
        "modelName": "Diamond Light Source (Didcot, UK)",
        "specifications": "3 GeV storage ring, 562 m, 3rd-generation. I18 (microfocus spectroscopy, 2-30 keV, 2-10 μm spot, SDD 4-element Vortex). UK/EU users free proposals, non-EU collaborative or commercial rates.",
        "approximateCost": "$0 (UK/EU) to $60,000 (non-EU commercial 5-day)",
        "url": "https://www.diamond.ac.uk"
      },
      {
        "vendor": "Synchrotron Facilities (USA)",
        "modelName": "SSRL (Stanford Synchrotron Radiation Lightsource, SLAC, USA)",
        "specifications": "3 GeV storage ring (SPEAR3), 234 m, 3rd-generation. BL 2-3 (environmental microprobe, 1-4 μm spot, 4-17 keV, 7-element Ge detector), BL 10-2 (XRF-XANES, powder diffraction). DOE-funded, academic free proposals.",
        "approximateCost": "$0 (academic) to $50,000 (commercial 5-day)",
        "url": "https://www-ssrl.slac.stanford.edu"
      },
      {
        "vendor": "Synchrotron Facilities (Germany)",
        "modelName": "PETRA III (DESY, Hamburg, Germany)",
        "specifications": "6 GeV storage ring (upgrade of PETRA II storage ring), 2304 m, 3rd-generation. P06 (hard X-ray micro/nanoprobe, 200 nm-5 μm focus, 5-50 keV, tomography, confocal). EU free proposals, non-EU collaborative.",
        "approximateCost": "$0 (EU academic) to $70,000 (non-EU commercial 5-day)",
        "url": "https://photon-science.desy.de/facilities/petra_iii"
      },
      {
        "vendor": "No commercial turnkey SR-XRF system (facility-based only)",
        "modelName": "N/A",
        "specifications": "Synchrotron XRF requires facility access; no commercial 'box' available (unlike lab XRF Bruker M6 Jetstream, Thermo ARL QUANT'X). Portable/compact synchrotrons (ICS-based) under development (research consortia, not commercial products yet). Lab alternatives: lab microbeam XRF (Bruker M4 Tornado, 20 μm spot, polychromatic tube, $200-500K; adequate some heritage applications, 100-1000× less sensitive SR-XRF but easier access).",
        "approximateCost": "N/A (facility access model, not purchase)",
        "url": "N/A"
      }
    ]
  },
  "methodology": {
    "samplePreparation": {
      "samplingRequired": false,
      "sampleSize": "Intact objects or fragments: few mm to ~50 cm maximum (beamline-dependent; typical heritage microprobes accommodate up to 10×10 cm samples, 1-5 cm thickness; larger possible but positioning challenges). Micro-samples acceptable (cross-sections 100 μm - 1 mm, paint chips 1-10 mg, fibers single threads, etc.); often preferred (easier positioning, faster scans, less beam time). No minimum size (single pigment grain 5-50 μm imageable if positioned at focus).",
      "mountingProcedure": "Sample secured on mount (often simple): **Flat objects** (paintings, manuscripts, textiles): tape edges to Al or acrylic holder (Kapton tape: X-ray transparent, low background; or carbon tape, conductive if charging issue), position horizontal or vertical (beamline-dependent, horizontal common microprobes). **3D objects, fragments:** Embed in epoxy (if cross-section study, polish one face), or affix to pin/needle (small samples: clay, wax, tacky wax hold, minimal contact, X-ray transparent support). **Fiducial markers:** Attach or mark reference points (ink dots, metal wires, fluorescent markers; used for alignment, relocating ROIs, correlating with other imaging). **Avoid contamination:** Handle with gloves (fingerprints add Na, Cl, K, oils: organic background), clean sample surface (compressed air, soft brush, or accept as-is if delicate; contamination minor issue if trace elements interest are not surface contaminants). **Fragile, irregular samples:** Custom jigs (3D-printed holders, foam cradles; beamline staff assist design if complex).",
      "surfacePreparation": "None required typically (SR-XRF non-contact, X-rays penetrate surface contamination, oxides if thin <10 μm, reach bulk). **Exception:** If surface contamination interferes (heavy dust, modern coatings obscure ancient materials): gentle cleaning (compressed air, ethanol wipe if conservation permits), or accept and note (contamination signals identifiable: modern polymers, adhesives, fingerprints show characteristic elemental patterns: hydrocarbons, Si, surfactants). **Polished cross-sections:** If sample is cross-section (embedded, polished for SEM-EDS or optical microscopy previously), SR-XRF can image same cross-section (correlate SEM + XRF, same features; SR-XRF higher sensitivity trace elements, SEM better spatial resolution major elements, complementary). Polish quality (0.25-1 μm diamond paste final polish) improves XRF (flat surface, better focus, less topographic scatter artifacts) but not essential (rough samples work, accept slight resolution degradation).",
      "contaminationConcerns": "Sample contamination (prior handling, storage, consolidation treatments): trace elements from gloves (Zn, Ca, Mg), adhesives (Si from silicones, Ti from white pigments in tapes), storage materials (Pb from old paints on shelves, Fe from rusted containers). Minimize: handle clean gloves (nitrile powder-free), store in clean environment (PE bags, glass containers), document prior treatments (if PVA, acrylic, wax applied: contains C, H, O, no heavy elements typically, but some formulations have additives). Beamline contamination: residual materials from prior users (if beamline used for biology, environmental samples, metals; thorough cleaning protocols between users, but trace cross-contamination possible; controlled via blank samples, beamline QC). Detector artifacts: escape peaks (Si K-escape from SDD, subtract in analysis), pile-up (two photons detected as one, sum peak at 2×E; correct via pile-up rejection electronics, or avoid high count rates >10⁵ cps per SDD element)."
    }
  },
  "metadata": {
    "tags": ["synchrotron XRF", "SR-XRF", "microbeam XRF", "trace elements", "high-resolution elemental mapping", "provenance", "authentication", "hidden text", "palimpsest", "pigment analysis", "non-destructive"],
    "relatedTechniqueIds": ["xrf-scanning", "sem-eds", "raman-spectroscopy", "xrd", "xanes", "la-icp-ms"],
    "lastUpdated": "2025-01-16",
    "version": "1.0",
    "contributors": ["Daniel Wilcox"]
  }
}


